[
  {
    "title": "The current landscape of neoadjuvant therapy for resectable colon cancer.",
    "abstract": "Neoadjuvant therapy has been proposed as a safe and effective treatment option for resectable colon cancer, providing several advantages over the current standard adjuvant protocol. This review summarizes the recent developments in neoadjuvant strategies for resectable colon cancer, highlighting key clinical trial data, current and emerging challenges, and the role of precision medicine in guiding treatment. Sources for this review were obtained through searches of PubMed, ClinicalTrials.gov, and relevant conference abstracts. Neoadjuvant therapy is emerging as a promising approach for treating colon cancer, especially for dMMR/MSI-H colon cancer where neoadjuvant immunotherapy have shown exceptional complete pathologic response rates and durable responses. Ongoing trials are focused on identifying optimal treatment approaches that balance oncological efficacy with the minimization of toxicity. A reliable multimodal evaluation framework incorporating advanced staging techniques and biomarkers such as circulating tumor DNA is essential to guide treatment and improve patient selection.",
    "authors": [
      "Mei Chan",
      "Tharani Krishnan",
      "Amanda Townsend",
      "Christos Karapetis",
      "Amitesh Roy",
      "Tiffany Foo",
      "Niall Tebbutt",
      "Tony Dhillon",
      "Timothy Price"
    ],
    "pub_date": "2025-Jun-06",
    "pmid": "40478728"
  },
  {
    "title": "Combining immunotherapy with radiotherapy for glioblastoma: recent advances and challenges.",
    "abstract": "Glioblastoma (GBM) is an extremely aggressive brain tumor. Its standard treatment currently involves surgery followed by radiotherapy and temozolomide. However, recurrence is frequently unavoidable, and the effect of various treatments is not ideal due to numerous inherent obstacles. Immunotherapy has demonstrated promising prospects in the management of various cancers. Despite several preclinical studies have shown that immunotherapy may improve the survival in GBM mouse model, the results from completed clinical trials reveal that it brings only limited benefit for GBM patients to date. Interestingly, several studies have demonstrated that radiotherapy not only eliminates tumor cells by inducing DNA damages but also improves the effect of immunotherapy by modulating immune response. Combining immunotherapy with radiotherapy for GBM has been evaluated extensively. Herein, we present the immunotherapy applied in GBM and highlight the importance of tumor microenvironment in immunotherapy for GBM. Moreover, we review the preclinical and clinical data for applying immunotherapy combined with radiotherapy for GBM. Finally, we also discuss the challenges facing combined treatment of immunotherapy and radiotherapy for GBM and further research aspects in the discussion section.",
    "authors": [
      "Yuanyang Sun",
      "Yun Wang",
      "Shukun Mu",
      "Xiaofeng Wu",
      "Suchun Yu",
      "Zhongming Wang"
    ],
    "pub_date": "2025--",
    "pmid": "40475019"
  },
  {
    "title": "An exploration of the initiation time and patient selection of PD-1 inhibitors/PD-1 inhibitors combined with chemotherapy as salvage therapy in R/R DLBCL patients after anti-CD19-CAR T-cell therapy.",
    "abstract": "A significant proportion of patients with relapsed/refractory diffuse large B-cell lymphoma (R/R DLBCL) exhibit no response to chimeric antigen receptor (CAR) T-cell therapy or suffer from disease progression thereafter. This study investigated the efficacy and safety of salvage therapy with PD-1 inhibitor-based combination treatment and the patient selection after their CAR T-cell therapy. Twenty-one patients with R/R DLBCL and a high tumor burden were treated with CAR T-cell therapy, a treatment that has shown promising results in clinical trials and has been approved by the Food and Drug Administration (FDA) for use in DLBCL. Patients who achieved complete response (CR) with the CAR T-cell therapy received salvage therapy when their disease progressed again. Patients who obtained partial response (PR) or stable disease (SD) with the CAR T-cell therapy received salvage therapy immediately. Salvage therapy consisted of single PD-1 inhibitors or PD-1 inhibitors combined with chemotherapy. We observed the overall response rate (ORR), overall survival (OS), CAR T-cell amplification, the expression of PD-1, CD3+ T cells, cytokines, and the adverse events. For instance, in a clinical trial of LCAR-B38M CAR T-cell therapy, an 88% ORR was observed, with 74% of patients achieving CR and a median duration of response (DOR) of 16 months. The ORR and CR of the salvage therapy were 28.57% and 19.05%, respectively. The ORR and CR were 38.46% and 30.77% in the 13 patients who achieved PR/SD with the CAR T-cell therapy and received salvage therapy 2 months after CAR T-cell infusion. But the ORR and CR were only 12.5% and 0%, respectively, in patients who achieved CR with the CAR T-cell therapy and received salvage therapy when they experienced disease re-progression. The ratio of CAR-T cells on day 7/day 14 was lower in the PR in CAR-T (effective to PD-1) group. Before salvage therapy, the percentage of CD3+ T cells was higher in the PR in CAR-T (effective to PD-1) group. There was no difference in the Common Terminology Criteria for Adverse Events (CTCAE) grades among the four groups in the salvage therapy. PD-1 inhibitor-based salvage therapy in patients with R/R DLBCL following the CAR T-cell therapy could be an effective and safe treatment, especially in patients who achieved PR after the CAR T-cell therapy and received this salvage therapy immediately.",
    "authors": [
      "Xin Li",
      "Juan Mu",
      "Jia Wang",
      "Qing Li",
      "Yili Jiang",
      "Jingyi Li",
      "Qi Deng"
    ],
    "pub_date": "2025--",
    "pmid": "40474425"
  },
  {
    "title": "Efficacy and safety of a novel CD19, CD22 dual-targeted fully human loop bi-CAR-T for the treatment of relapsed/refractory B cell non-Hodgkin lymphoma.",
    "abstract": "Chimeric antigen receptor (CAR) T-cell therapies targeting CD19 have demonstrated promising efficacy in treating refractory or relapsed B-cell malignancies. Nonetheless, challenges such as antigen escape-mediated relapse and toxicities, including cytokine release syndrome (CRS) and neurotoxicity, may impede their clinical application. In this study, we developed a fully human, bivalent loop bi-CAR-T targeting both CD19 and CD22 (CT120). We conducted an open-label, single-center, single-arm phase I/II trial to evaluate the efficacy and safety of CT120 in patients with relapsed or refractory B-cell non-Hodgkin lymphoma (NHL). The overall response rate (ORR) was 65.2%, with 56.5% of patients achieving a complete response. The median progression-free survival (PFS) was 23.95 months, and the median overall survival (OS) was not reached. The 12-month PFS rate was 54.66%, and the 12-month OS rate was 77.34%. The 24-month PFS rate was 49.69% and the 24-month OS rate was 72.51%. Prognostic factors for poorer outcomes included bulky mass, high international prognostic index (IPI), multiple extranodal lesions, or MYD88 mutation. No loss of CD19/CD22 expression was observed in patients with relapse. Grade 3 or higher CRS occurred in only one patient (4.3%), and no immune effector cell-associated neurotoxicity syndrome (ICANS) was seen. Notably, we observed both early and late immune effector cell-associated hematotoxicity (ICAHT) following CT120 infusion. Late-onset neutropenia (after day 30) occurred in 78.3% of patients, and severe anemia was correlated with worse prognosis. Overall, CT120 infusion is effective, safe, and reliable for reducing antigen escape-related relapse in patients with relapsed or refractory NHL. Chinese Clinical Trial Registry (ChiCTR), ChiCTR2000038641). Registered 26 September 2020, https://www.chictr.org.cn/showproj.html?proj=61780 .",
    "authors": [
      "Hanyu Wang",
      "Gaoxiang Wang",
      "Tongjuan Li",
      "Peiling Zhang",
      "Zekai Mao",
      "Hui Luo",
      "Xiaojian Zhu",
      "Dengju Li",
      "Jianfeng Zhou",
      "Xiaoxi Zhou",
      "Liang Huang"
    ],
    "pub_date": "2025-Jun-05",
    "pmid": "40474279"
  },
  {
    "title": "TRANS: a prediction model for EGFR mutation status in NSCLC based on radiomics and clinical features.",
    "abstract": "Early detection of epidermal growth factor receptor (EGFR) is critical for guiding therapeutic decisions in non-small-cell lung cancer (NSCLC). The study aims to develop a predictive model for EGFR mutations with multicohort data. The study enrolled 254 NSCLC patients of four cohorts: the Affiliated Hospital of Qingdao University (AHQU, n = 54), the Second Affiliated Hospital of Soochow University (SAHSU, n = 78), TCGA-NSCLC (n = 91), and CPTAC-NSCLC (n = 31). Radiomic features were extracted using the LIFEx software. The least absolute shrinkage and selection operator (LASSO) algorithm was utilized to select predictive features of CT radiomics, clinical data, and RNA sequencing, which were evaluated using receiver operating characteristic (ROC) curves. A nomogram was developed by integrating predictive features. Biological functions were analyzed utilizing RNA sequencing data. Eight radiomic features, four clinical features, and seven genomic features were selected to construct distinct signatures. Through internal 5-fold cross-validation, the first two signatures demonstrated notable discrimination capabilities for distinguishing between mutated and wild-type EGFR, resulting in area under the curve (AUC) values of 0.79 (± 0.08) and 0.74 (± 0.06), respectively. The combination of clinical variables and radiomics signature resulted in an increased AUC of 0.84 (± 0.01). This combined model was named TRANS, representing TTF-1, radiomic signature, AE1/AE3, NapsinA, and stage, which uses radiomics and routine immunohistochemistry markers as inputs. High-risk TRANS was observed to be associated with poor overall survival, and showed relationships with high T cell infiltration and response to PD-1 immunotherapy. The TRANS model demonstrated favorable ability in predicting EGFR mutation status in NSCLC, providing a valuable approach for optimizing therapeutic strategies in clinical practice.",
    "authors": [
      "Zhigang Chen",
      "Huiying Lu",
      "Ao Liu",
      "Jia Weng",
      "Lei Gan",
      "Lina Zhou",
      "Xiao Ding",
      "Shicheng Li"
    ],
    "pub_date": "2025-Jun-05",
    "pmid": "40474176"
  },
  {
    "title": "Inherited mitochondrial genetics as a predictor of immune checkpoint inhibition efficacy in melanoma.",
    "abstract": "Response to immune checkpoint inhibitors (ICIs) in metastatic melanoma (MM) varies among patients, and current baseline biomarkers predicting treatment outcomes are limited. As mitochondrial (MT) metabolism has emerged as an important regulator of host immune function, we explored the association of host MT genetics (MT haplogroups) with ICI efficacy in 1,225 ICI-treated patients with MM from the clinical trial CheckMate-067 and the International Germline Immuno-Oncology Melanoma Consortium. We discovered and validated significant associations of MT haplogroup T (HG-T) with resistance to anti-programmed cell death protein-1-based ICI (both single-agent and combination) and have shown that HG-T is independent from established tumor predictors. We also found that patients belonging to HG-T exhibit a unique nivolumab-resistant baseline peripheral CD8",
    "authors": [
      "Kelsey R Monson",
      "Robert Ferguson",
      "Joanna E Handzlik",
      "Leah Morales",
      "Jiahan Xiong",
      "Vylyny Chat",
      "Sasha Dagayev",
      "Alireza Khodadadi-Jamayran",
      "Danny Simpson",
      "Esther Kazlow",
      "Anabelle Bunis",
      "Chaitra Sreenivasaiah",
      "Milad Ibrahim",
      "Iryna Voloshyna",
      "Wouter Ouwerkerk",
      "Rosalie M Luiten",
      "Mariaelena Capone",
      "Gabriele Madonna",
      "Yuting Lu",
      "Yongzhao Shao",
      "Anna Pavlick",
      "Michelle Krogsgaard",
      "Janice Mehnert",
      "Hao Tang",
      "Sonia Dolfi",
      "Daniel Tenney",
      "John B A G Haanen",
      "Thomas F Gajewski",
      "F Stephen Hodi",
      "Keith T Flaherty",
      "Kasey Couts",
      "William Robinson",
      "Igor Puzanov",
      "Marc S Ernstoff",
      "Osama Rahma",
      "Michael Postow",
      "Ryan J Sullivan",
      "Jason J Luke",
      "Paolo A Ascierto",
      "Iman Osman",
      "Tomas Kirchhoff"
    ],
    "pub_date": "2025-Jun-05",
    "pmid": "40473950"
  },
  {
    "title": "A phase I/II trial of WT1-specific TCR gene therapy for patients with acute myeloid leukemia and active disease post-allogeneic hematopoietic cell transplantation: skewing towards NK-like phenotype impairs T cell function and persistence.",
    "abstract": "Relapsed and/or refractory acute myeloid leukemia (AML) post-allogeneic hematopoietic cell transplantation (HCT) is usually fatal. We previously reported that post-HCT immunotherapy with Epstein-Barr virus (EBV)-specific donor CD8",
    "authors": [
      "Francesco Mazziotta",
      "Lauren E Martin",
      "Daniel N Egan",
      "Merav Bar",
      "Sinéad Kinsella",
      "Kelly G Paulson",
      "Valentin Voillet",
      "Miranda C Lahman",
      "Daniel Hunter",
      "Thomas M Schmitt",
      "Natalie Duerkopp",
      "Cecilia C S Yeung",
      "Tzu-Hao Tang",
      "Raphael Gottardo",
      "Yuta Asano",
      "Elise C Wilcox",
      "Bo Lee",
      "Tianzi Zhang",
      "Paolo Lopedote",
      "Livius Penter",
      "Catherine J Wu",
      "Filippo Milano",
      "Philip D Greenberg",
      "Aude G Chapuis"
    ],
    "pub_date": "2025-Jun-05",
    "pmid": "40473616"
  },
  {
    "title": "Association of candidate surrogate endpoints with overall survival in advanced biliary tract cancer.",
    "abstract": "The use of surrogate endpoints in trials including biliary tract cancers (BTC) is growing. While this may expedite drug approval and decrease costs, it may not always correlate with an overall survival (OS) advantage. We aimed to explore the association of progression-free survival (PFS), objective response rate (ORR) and disease-control rate (DCR) with OS at the trial- and patient-level. For the trial-level analysis, we performed a systematic review of Pubmed/MEDLINE, Embase, Cochrane, clinicaltrials.gov and conference proceedings for phase II-III trials in advanced BTC. We used a weighted linear regression to measure the correlation of OS with PFS, ORR and DCR. For the patient-level analysis, we analyzed patients included in five randomized trials and three real-world datasets. The protocol is registered with PROSPERO, CRD42023398279. For the trial-level analysis, we included 41 studies, involving 88 treatment arms and 7817 patients. The coefficient of determination (R PFS shows a moderate correlation with OS both at the trial- and patient-level, while ORR and DCR show a low correlation. Whilst PFS is currently the best candidate surrogate marker for OS, our results highlight the need for novel endpoints in this field. The use of validated surrogate endpoints in biliary tract cancer trials may decrease costs and improve study feasibility, particularly with agents that only target small subsets of patients or in trials that incorporate a cross-over design. A formal statistical validation of surrogacy requires patient-level and trial-level data. This is the first comprehensive analysis to incorporate novel agents (including immunotherapies and targeted agents), include patient-level data and rigorously and homogeneously extract appropriate measures of treatment effect for endpoint correlation. These results show a moderate correlation for progression-free survival both at the trial- and patient-level and a low correlation for disease-control rate and response rate. This information will aid clinicians in appropriately interpreting contemporary clinical trials and guide clinical researchers and trial sponsors involved in clinical trial design. Furthermore, it has important implications for the regulatory approval process and may aid agencies in appropriately evaluating novel drugs.",
    "authors": [
      "Florian Castet",
      "Carles Fabregat-Franco",
      "John Bridgewater",
      "Jin Won Kim",
      "Margherita Rimini",
      "Adelaida La Casta",
      "Angela Lamarca",
      "Minsu Kang",
      "Francesca Salani",
      "Alfredo Castillo",
      "Andre Lopes",
      "Jaewon Hyung",
      "Lorenza Rimassa",
      "Jorge Adeva",
      "Daniel López-Valbuena",
      "Míriam Basagaña-Farres",
      "Simran Vaja",
      "Ka Man Mak",
      "Tian V Tian",
      "Andrés Muñoz",
      "Andrea Casadei-Gardini",
      "Changhoon Yoo",
      "Juan W Valle",
      "Teresa Macarulla"
    ],
    "pub_date": "2025-Jun-03",
    "pmid": "40473034"
  },
  {
    "title": "Biochemical analysis of PD-L1 ubiquitination by CRL3",
    "abstract": "As a key immune checkpoint ligand, PD-L1 is a critical target in cancer immunotherapy. While multiple E3 ubiquitin ligases including CRL3",
    "authors": [
      "Guojiao Xie",
      "Lin Gao",
      "Renee Lu",
      "Linxia Tian",
      "Tiantian Zheng",
      "Xinning Li",
      "Yongjun Dang",
      "Philip A Cole",
      "Xian Yu",
      "Hanjie Jiang",
      "Zan Chen"
    ],
    "pub_date": "2025-May-24",
    "pmid": "40472843"
  },
  {
    "title": "An updated, comprehensive meta-analysis of the treatment of anti-NMDAR encephalitis: Analysis, equipoise, and the urgent need for evidence over anecdote.",
    "abstract": "There are no FDA-approved treatments for anti-N-methyl-d-aspartate receptor encephalitis (NMDARE), and no prospective, multicenter clinical trials have been completed to provide evidence for management of this disease. We evaluated changes in treatment strategies and outcomes since the previous comprehensive review in 2019. A systematic literature review was conducted in PubMed capturing manuscripts published from January 2019 through March 2024. Demographic and clinical data were extracted from articles containing individual immunotherapy data in NMDARE and were compared to a previously published literature review. Studies with ≥10 cases, ≥6 months follow-up, and outcomes reported as favorable (modified Rankin Scale [mRS] 0-2) and poor (mRS 3-5 or 3-6), were grouped and summarized by diagnosis period. Among 649 patients from 321 articles, first- (from 91.3 % to 98.3 %, p < 0.001) and second-line (from 31.8 % to 42.5 %, p < 0.001) immunotherapy use has increased. The proportion of patients receiving immunotherapy within 30 days of symptom onset increased from 50.1 % to 72.5 % (p < 0.001). Favorable outcome (mRS 0-2) increased from 71.5 % to 76.7 % (p = 0.024), while mortality (6.3 % to 6.9 %, p = 0.714) and relapse rates (12.6 % vs. 13.2 %, p = 0.789) remained unchanged. Data from larger cohort studies of patients diagnosed with NMDARE after 2013 have reported wide variability in the proportion of patients achieving a favorable outcome at final follow-up, ranging from 56 % to 93 %, depending on the institution and follow-up duration. Since 2019, more patients have been treated early with first- and second-line immunotherapies. Functional outcomes have shown modest improvements, whereas mortality and relapse rates have remained unchanged.",
    "authors": [
      "Yoji Hoshina",
      "Tammy L Smith",
      "Alen Delic Mstat",
      "Ka-Ho Wong",
      "Lisa K Peterson",
      "Anastasia Zekeridou",
      "Albert Aboseif",
      "Christopher Coffey",
      "Melissa A Wright",
      "Brenda Banwell",
      "Annalisa Dialino-Felix",
      "Susan Flavin",
      "Lisa Dill",
      "Maarten J Titulaer",
      "Gregory S Day",
      "Stacey L Clardy"
    ],
    "pub_date": "2025-May-27",
    "pmid": "40472799"
  },
  {
    "title": "Impact of the IL-15 superagonist N-803 on lymphatic reservoirs of HIV.",
    "abstract": "NK cell function is impaired in people with HIV (PWH), hindering their potential to reduce the lymphoid tissue (LT) reservoir. The IL-15 superagonist N-803 has been shown to enhance NK and T cell function, and thus may reduce viral reservoirs. To determine the impact of N-803 on LTs, we conducted a clinical trial where 10 PWH on effective antiretroviral therapy (ART) were given three 6 mcg/kg doses of N-803 subcutaneously. We obtained PBMCs and lymph node (LN) and gut biopsies at baseline and after the last N-803 dose. We found a non-statistically significant ~0.50 median log reduction in the frequency of viral(v)RNA+ and vDNA+ cells/g in the 6 participants with baseline and post-treatment LNs. In the ileum, we observed reductions of vRNA+ cells in 8/10 participants and vDNA+ cells in all participants. We also found significant inverse correlations between NK cell proliferation and the frequency of vRNA+ cells, and between NKG2A expression on NK cells and the frequency of vRNA+ cells. Our findings suggest N-803 may reduce the HIV reservoir in LTs of PWH on ART, an effect likely mediated by enhanced NK cell function. Controlled studies assessing the impact of NK cell therapy on HIV LTs are needed.",
    "authors": [
      "Joshua Rhein",
      "Jeffrey G Chipman",
      "Gregory J Beilman",
      "Ross Cromarty",
      "Kevin Escandón",
      "Jodi Anderson",
      "Garritt Wieking",
      "Jarrett Reichel",
      "Rodolfo Batres",
      "Alexander Khoruts",
      "Christopher M Basting",
      "Peter Hinderlie",
      "Zachary B Davis",
      "Anne Eaton",
      "Byron P Vaughn",
      "Elnaz Eilkhani",
      "Jeffrey T Safrit",
      "Patrick Soon-Shiong",
      "Jason V Baker",
      "Nichole R Klatt",
      "Steven G Deeks",
      "Jeffrey S Miller",
      "Timothy W Schacker"
    ],
    "pub_date": "2025-Jun-03",
    "pmid": "40471871"
  },
  {
    "title": "Immunotherapy Utilization Outcomes in Distantly Metastatic Head and Neck Squamous Cell Carcinoma.",
    "abstract": "Immunotherapy is part of multimodal treatment for distantly metastatic head and neck squamous cell carcinoma (mHNSCC); however, survival outcomes outside of clinical trials have not been systematically assessed. This study used the US National Cancer Database (NCDB) to evaluate the use and outcomes of nonpalliative immunotherapy across various HNSCC primary sites outside of clinical trial settings. To assess the routine clinical use of nonpalliative immunotherapy and its survival outcomes for different primary sites of mHNSCC. This was a large population-based cohort study using data from the NCDB, a cancer registry of patients treated at more than 1500 hospitals in the US. Eligible participants were patients with mHNSCC who received immunotherapy from 2013 to 2020. Data analysis was conducted from October 2023 and March 2025. Receiving immunotherapy or not. Overall survival (OS) following mHNSCC diagnosis was the primary outcome. The secondary outcome was prognostic factors of OS stratified by primary site. Kaplan-Meier and multivariable Cox regression models were used in the analysis. Among 5059 patients with mHNSCC (mean [SD] age at diagnosis, 64.6 [10.6] years; 4074 male [80.5%]; 162 Asian [3.2%], 763 Black [15.1%], 267 Hispanic [5.3%], 19 Native American [0.4%], and 3848 White [76.1%] individuals), there were 1073 (21.3%) who received immunotherapy and 3986 (78.8%) who did not. Immunotherapy use increased year over year from 2013 to 2020 (9.3% vs 33.8%). Immunotherapy recipients were predominantly covered by Medicare (539 patients [22.3%]) or privately insured (310 patients [23.9%]). Patients receiving both chemotherapy and immunotherapy had the longest median survival at 19.1 (95% CI, 17.0-21.5) months, followed by those receiving chemotherapy alone at 17.3 (95% CI, 16.6-18.3) months. Compared to chemotherapy alone, multivariable Cox analysis demonstrated improved OS for the addition of immunotherapy (hazard ratio [HR], 0.81; 95% CI, 0.72-0.91) but worse OS for immunotherapy alone (HR, 1.25; 95% CI, 1.08-1.45) and no chemotherapy or immunotherapy (HR, 2.31; 95% CI, 2.12-2.52). Adding immunotherapy to chemotherapy improved OS in patients with hypopharyngeal (HR, 0.66; 95% CI, 0.50-0.86), oral cavity (HR, 0.76; 95% CI, 0.59-0.98), and laryngeal (HR, 0.81; 95% CI, 0.66-1.00) cancers, but not for p16-positive (HR, 1.05; 95% CI, 0.79-1.39) or p16-negative (HR, 1.33; 95% CI, 0.96-1.86) oropharyngeal cancers. This cohort study found that immunotherapy use increased significantly from 2013 to 2020 for mHNSCC treatment, particularly at academic centers. Immunotherapy use was associated with modest OS improvement in patients with hypopharyngeal, oral cavity, and laryngeal cancers, but not for those with oropharyngeal cancer.",
    "authors": [
      "Neel R Sangal",
      "Iulia Tapescu",
      "Praneet Kaki",
      "Robert M Brody",
      "Ryan M Carey"
    ],
    "pub_date": "2025-Jun-05",
    "pmid": "40471563"
  },
  {
    "title": "Updated overall survival data and predictive biomarkers of autologous NK cells plus Sintilimab as second-line treatment for advanced non-small cell lung cancer.",
    "abstract": "Combination strategies involving immune checkpoint inhibitors (ICIs) have been a prominent focus of research in the treatment of non-small cell lung cancer (NSCLC). Our prior findings demonstrated that the combination of autologous NK cells with the PD-1 antibody (Sintilimab), offered promising efficacy in NSCLC patients who failed the first-line platinum-based chemotherapy. Here, we present updated overall survival (OS) data from the final analysis, aiming to identify patient subgroups that derive maximal benefit from this therapeutic approach. Twenty NSCLC patients without driver gene mutations were enrolled and treated with a combination of autologous NK cells and Sintilimab every three weeks. Multicolor immunofluorescence staining was applied to evaluate static markers within the tumor microenvironment. Concurrently, dynamic assessments were conducted using next-generation sequencing and monitoring of PD-1/PD-L1 expression on NK cells to identify patient populations with favorable prognoses. The median OS was 27.3 months (95% CI, 0.76 to 53.8), with six patients still alive at the follow-up cutoff. A significant correlation was observed between the CD56+PD-L1+ cellular phenotype and extended survival. Clearance of circulating tumor DNA (ctDNA) and an increased percentage of PD-L1+ NK cells following treatment was associated with significantly better survival outcomes. Notably, prolonged treatment exposure did not lead to increased toxicity. The combination of autologous NK cells with Sintilimab significantly enhances long-term survival in NSCLC patients without exacerbating adverse effects, presenting a promising strategy for future combination immunotherapy approaches in NSCLC treatment. https://www.clinicaltrials.gov/ct2/show/NCT03958097, identifier NCT03958097.",
    "authors": [
      "Lin Jia",
      "Naifei Chen",
      "Xiao Chen",
      "Chao Niu",
      "Ziling Liu",
      "Kewei Ma",
      "Lei Yang",
      "Yuguang Zhao",
      "Wei Song",
      "Jin Lu",
      "Chen Chen",
      "Xiaofeng Cong",
      "Xu Wang",
      "Yinghui Xu",
      "Guozhen Cui",
      "Zengguang Liu",
      "Rongrong Chen",
      "Huan Yin",
      "Na Zhang",
      "Jiuwei Cui"
    ],
    "pub_date": "2025--",
    "pmid": "40469279"
  },
  {
    "title": "Peripheral memory B cell population maintenance and long-term survival after perioperative chemoimmunotherapy in NSCLC (NADIM trial).",
    "abstract": "Perioperative chemoimmunotherapy has significantly improved survival rates for non-small cell lung cancer (NSCLC). However, current tissue biomarkers remain inadequate, underscoring the need for more sensitive and accessible alternatives to monitor relapse risk. Intratumoral B-cells are increasingly recognized for their role in enhancing immunotherapy outcomes, yet the contribution of peripheral B-cells to immune surveillance remains unexplored. Peripheral B-cell immunophenotypes were analyzed from blood samples (at diagnosis, post-neoadjuvant, and at 6- and 12-months of adjuvant treatment) in 41 stage IIIA NSCLC patients treated with perioperative nivolumab plus chemotherapy, included in the NADIM clinical trial (NCT03081689). Results were correlated with 5-year survival outcomes and validated through unsupervised clustering. An increase in the percentage of total B-cells (CD19",
    "authors": [
      "Belén Sierra Rodero",
      "Cristina Martínez-Toledo",
      "Ernest Nadal",
      "Marta Molina-Alejandre",
      "Rosario García Campelo",
      "Ángeles Gil-González",
      "Bartomeu Massuti",
      "Aránzazu García-Grande",
      "Manuel Dómine",
      "Amelia Insa",
      "Javier de Castro Carpeño",
      "Gerardo Huidobro Vence",
      "Margarita Majem",
      "Alex Martinez-Marti",
      "Diego Megias",
      "Daniel Lobato",
      "Ana Collazo-Lorduy",
      "Virginia Calvo",
      "Mariano Provencio",
      "Alberto Cruz-Bermúdez"
    ],
    "pub_date": "2025-Dec-",
    "pmid": "40468805"
  },
  {
    "title": "A nomogram integrating clinical stage and pre-EBV DNA to identify the cycles of induction chemotherapy for locoregionally advanced nasopharyngeal carcinoma.",
    "abstract": "This research focused on determining the optimal cycles of induction chemotherapy (IC) in high-risk locoregionally advanced nasopharyngeal carcinoma (LA-NPC). The retrospective analysis was conducted on 885 patients. Potential bias was minimized by propensity score matching (PSM). Overall survival (OS) served as the primary endpoint. Survival outcomes were analyzed using Kaplan-Meier curves, with statistical comparisons performed via the log-rank test. Prognostic determinants were identified through multivariate cox regression analysis. A nomogram model was constructed to quantify individualized prognosis. Patients were divided into 2/3-cycle (IC = 2/3) and 4-cycle IC (IC = 4) groups. After PSM, 446 patients remained and were categorized into distinct risk groups according to independent predictors, including clinical stage and pre-treatment Epstein-Barr virus DNA (pre-EBV DNA). For the high-risk cohort (stage IVa with pre-EBV DNA ≥ 4000 copies/mL), the IC = 4 regimen showed higher 5-year OS (70.4% vs. 54.7%, P = 0.036) than the IC = 2/3 regimen. In the low- and middle-risk cohorts, the IC = 2/3 regimen exhibited OS comparable to the IC = 4 regimen. The established nomogram model demonstrated superior prognostic power compared to individual factors. Given the adverse effects, the IC = 4 regimen was associated with significantly higher rates of grade 3-4 neutropenia (24.6% vs. 15.5%, P = 0.017) and thrombocytopenia (8.0% vs. 3.7%, P = 0.049) compared to the IC = 2/3 regimen. The developed nomogram offers personalized guidance on selecting individual IC cycles for LA-NPC patients.",
    "authors": [
      "Sunqin Cai",
      "Zongwei Huang",
      "Zihan Chen",
      "Ying Li",
      "Jingjing Su",
      "Ronghui Chen",
      "Siqi Xu",
      "Jing Wang",
      "Sufang Qiu"
    ],
    "pub_date": "2025-Jun-04",
    "pmid": "40468367"
  },
  {
    "title": "HS-10375, a selective EGFR C797S tyrosine kinase inhibitor, in advanced non-small cell lung cancer.",
    "abstract": "The C797S mutation is one of the most common mechanisms of acquired resistance to third generation EGFR TKIs, yet no approved therapies have been available to target it. Here we developed a novel selective EGFR C797S inhibitor, HS-10375, and report the results of pre-clinical research and the first-in-human phase 1 trial. Ba/F3 cell lines and patient-derived cells expressing mutant EGFR were used to test the selectively inhibitory potency of HS-10375 in vitro, and cell line-derived xenograft animal models were used to evaluate the anticancer efficacy of HS-10375 in vivo. In the phase 1 trial, HS-10375 was administered orally at six dose levels (10-240 mg) daily (QD) in 21-day cycles, following a rule-based, rolling six design. The primary objectives were the safety, tolerability and maximum tolerated dose (MTD). The secondary objectives included PK parameters and anti-tumor activity. HS-10375 showed more potent activity in inhibiting EGFR phosphorylation compared to 1st to 3rd generation EGFR TKIs in C797S triple-mutant cell lines. HS-10375 also exhibited comparable inhibitory activity to 1st- and 2nd- generation EGFR TKIs and superior activity to 3rd-generation EGFR TKIs in C797S double-mutant cell lines. Furthermore, cells harboring EGFR double or triple C797S mutation underwent remarkable apoptosis upon HS-10375 treatment. HS-10375 effectively inhibited tumor growth in C797S triple-mutant mouse models. In the first-in-human trial, 28 patients with advanced or metastatic non-small cell lung cancers who harbored EGFR mutation and who had experienced treatment failure with EGFR TKI treatment received at least one dose of HS-10375. Dose-limiting toxicities were observed in 2 patients at 240 mg QD, and MTD was reached at HS-10375 150 mg QD. The most common treatment-related adverse events were vomit (37.0%), loss of appetite (33.3%), and elevated AST (33.3%). One patient with EGFR mutations showed tumor shrinkage after progression on five-line treatment including gefitinib, almonertinib, chemotherapy, immunotherapy, and EGFRxHER3 antibody-drug conjugate. HS-10375 demonstrated potent and mutant-selective activity against the EGFR C797S mutation in preclinical results, and showed an acceptable safety profile and objective response in a first-in-human phase 1 trial. Trial registration This trial is registered on China Drug Trials (CTR20220045), and ClinicalTrials.gov (NCT05435248).",
    "authors": [
      "Jianhua Zhan",
      "Jinhui Xue",
      "Lin Wu",
      "Zhiye Zhang",
      "Qiming Wang",
      "Yuxiang Ma",
      "Yan Huang",
      "Yunpeng Yang",
      "Yuanyuan Zhao",
      "Wenfeng Fang",
      "Yang Zhang",
      "Qianwen Liu",
      "Wen Xu",
      "Yan Yang",
      "Zhenming Chen",
      "Baili Song",
      "Danni Sun",
      "Xia Sun",
      "Peng Gao",
      "Hongyun Zhao",
      "Li Zhang"
    ],
    "pub_date": "2025-Jun-04",
    "pmid": "40468352"
  },
  {
    "title": "Avelumab First-line Maintenance for Advanced Urothelial Carcinoma: Long-term Outcomes from the JAVELIN Bladder 100 Trial in Patients with Nonvisceral or Lymph Node-only Disease.",
    "abstract": "In the JAVELIN Bladder 100 randomized phase 3 trial (N = 700), avelumab first-line maintenance plus best supportive care (BSC) significantly prolonged overall survival (OS; primary endpoint) and progression-free survival (PFS) versus BSC alone in patients with advanced urothelial carcinoma (aUC) without progression after first-line platinum-based chemotherapy (PBC). Here, we report exploratory analyses of subgroups with nonvisceral metastases at the start of PBC (including bone metastases) or lymph node-only disease at randomization. The median OS with avelumab versus control in patients with nonvisceral metastases (n = 318) was 31.4 versus 17.1 mo (hazard ratio [HR], 0.60 [95% confidence interval {CI}, 0.45-0.79]), and in patients with lymph node-only disease (n = 102), it was 31.9 versus 22.7 mo (HR, 0.86 [95% CI, 0.51-1.47]). In patients with nonvisceral metastases, prolonged OS was observed with avelumab irrespective of the response to PBC or PBC regimen received. PFS analyses favored avelumab over control in all the subgroups. Incidences of avelumab-related adverse events were similar across the subgroups. Limitations include small sample sizes and the exploratory nature of analyses. Overall, exploratory analyses suggest that in first-line PBC-treated patients without progression, avelumab maintenance is effective and has a manageable toxicity profile in patients with aUC who have nonvisceral metastases or lymph node-only disease.",
    "authors": [
      "Joaquim Bellmunt",
      "Thomas Powles",
      "Se Hoon Park",
      "Eric Voog",
      "Begona P Valderrama",
      "Howard Gurney",
      "Anders Ullén",
      "Yohann Loriot",
      "Srikala S Sridhar",
      "Norihiko Tsuchiya",
      "Cora N Sternberg",
      "Jeanny B Aragon-Ching",
      "Daniel P Petrylak",
      "Miguel A Climent Duran",
      "Karin Tyroller",
      "Jason Hoffman",
      "Natalia Jacob",
      "Petros Grivas",
      "Shilpa Gupta"
    ],
    "pub_date": "2025-Jun-03",
    "pmid": "40467365"
  },
  {
    "title": "Neoadjuvant chemotherapy or chemoradiotherapy plus sintilimab versus neoadjuvant chemoradiotherapy for locally advanced oesophageal squamous cell carcinoma: a study protocol of a multicentre, randomised, controlled, phase III trial (SCIENCE study).",
    "abstract": "Oesophageal squamous cell carcinoma (ESCC) is a globally challenging digestive tract malignancy with poor prognosis and limited treatment options. Early-stage ESCC is often asymptomatic, leading to a late-stage diagnosis in many cases. Neoadjuvant therapy combined with surgery is the standard treatment approach for locally advanced ESCC. In recent years, immunotherapy has shown significant efficacy in ESCC. However, various neoadjuvant treatment regimens, including chemotherapy, radiotherapy and immunotherapy, have produced inconsistent outcomes. This study aims to evaluate the efficacy and safety of neoadjuvant chemotherapy (nCT) or neoadjuvant chemoradiotherapy (nCRT) combined with immunotherapy compared with nCRT alone. This is a prospective, multicentre, randomised, controlled phase III trial enrolling 420 patients with locally advanced thoracic ESCC. Patients will be randomly assigned (1:1:1) into three groups: (A) nCT plus sintilimab, (B) nCRT plus sintilimab or (C) nCRT alone. The primary endpoints are pathological complete response and event-free survival. Secondary endpoints include the objective remission rate, disease control rate, R0 resection rate, major pathological remission rate, disease-free survival, overall survival, patient quality of life and patient-reported outcomes. Data will be analysed using both the intention-to-treat and per-protocol approaches, with multiple imputation methods for handling missing data. The study has been approved by the Ethics Committee for Medical Research and New Medical Technology of Sichuan Cancer Hospital (approval number: SCCHEC-02-2022-108). Written informed consent will be obtained from all participants. The findings will be disseminated through peer-reviewed journals and conference presentations. NCT05244798.",
    "authors": [
      "Wenwu He",
      "Hansong Bai",
      "Jiahua Lv",
      "Peng Tang",
      "Tongchen Hu",
      "Haining Zhou",
      "Wenguang Xiao",
      "Lin Peng",
      "Guangyuan Liu",
      "Kangning Wang",
      "Qiang Fang",
      "Yunxiang Qi",
      "Long Liang",
      "Xiumei Zheng",
      "Haomiao Qing",
      "Yungchang Chen",
      "Yehan Zhou",
      "Wenjing Xie",
      "Yongtao Han",
      "Xuefeng Leng"
    ],
    "pub_date": "2025-Jun-04",
    "pmid": "40467307"
  },
  {
    "title": "Clinical study of adebrelimab in combination with apatinib and irinotecan for PD-1 inhibitor-ineffective advanced-stage gastric cancer: study protocol for a single-arm, single-centre, exploratory trial.",
    "abstract": "Immunotherapy has revolutionised cancer treatment. Immune checkpoint inhibitors have demonstrated significant efficacy across multiple tumour types, including gastric cancer, where several approved programmed cell death 1/programmed cell death-ligand 1 (PD-1/PD-L1) inhibitors show promising antitumour activity. While PD-L1 expression serves as a predictive biomarker for PD-1 inhibitor response, and PD-L1-positive patients generally show better outcomes, therapeutic resistance remains a challenge. Many initial responders eventually develop resistance, and surprisingly, some PD-L1-positive patients fail to achieve expected response rates, indicating emerging resistance mechanisms in potentially responsive populations. Adebrelimab, a PD-L1 inhibitor, demonstrates mechanistic advantages over PD-1 inhibitors, with clinical studies suggesting promising therapeutic potential. When combined with irinotecan, apatinib has shown efficacy in second-line gastric cancer treatment. This study aims to evaluate the efficacy and safety of combining adebrelimab with apatinib and irinotecan for advanced gastric cancer refractory to PD-1 inhibitors. This single-arm, single-centre exploratory trial will be conducted at Renji Hospital, enrolling 32 patients aged 18-75 years. Eligible patients must have initially achieved partial response, complete response or stable disease with progression-free survival (PFS)≥3 months during prior immunotherapy but subsequently progressive disease on imaging. Treatment will continue until meeting discontinuation criteria. The primary endpoint is objective response rate with Clopper-Pearson 95% CI. Secondary endpoints include disease control rate (95% CI), PFS and overall survival (estimated by Kaplan-Meier method), along with safety assessments. All participants will provide informed consent. The protocol has been approved by the Shanghai Jiaotong University School of Medicine, Renji Hospital Ethics Committee (LY2023-201-C). The results will be disseminated through peer-reviewed manuscripts, reports and presentations. ChiCTR2300077329.",
    "authors": [
      "Tao Liu",
      "Yujing Guan",
      "Long Bai",
      "Bo Ni",
      "Hao-Yu Zhang",
      "Yeqian Zhang",
      "Jiayi Gu",
      "Muerzhate Aimaiti",
      "Shuchang Wang",
      "Ben Yue",
      "Zizhen Zhang",
      "Xiang Xia"
    ],
    "pub_date": "2025-Jun-04",
    "pmid": "40467306"
  },
  {
    "title": "Methotrexate exerts antitumor immune activity and improves the clinical efficacy of immunotherapy in patients with solid tumors.",
    "abstract": "Low-dose methotrexate (MTX) is the first-line drug for treating rheumatoid arthritis as an immunosuppressor. We have identified that low-dose MTX exhibits antitumor immune activity. MTX treatment reduced tumor metastasis and enhanced the efficacy of radiation therapy and immune checkpoint blockade therapy in mice. Mechanistically, MTX selectively induced DNA damage, cGAS-STING [cyclic guanosine monophosphate-adenosine monophosphate (cGAMP) synthase (cGAS)-stimulator of interferon genes (STING)] pathway activation, and cGAMP generation in cancer cells. Furthermore, MTX bound to the substrate-binding pocket of ectonucleotide pyrophosphatase/phosphodiesterase 1 (ENPP1), inhibiting ENPP1-mediated cGAMP hydrolysis and adenosine generation. Consequently, MTX reduced extracellular adenosine and enhanced host STING-mediated antitumor immunity. In addition, a preliminary clinical trial demonstrated promising efficacy and safety of low-dose MTX in combination with immunotherapy and radiotherapy for patients with unresectable or metastatic solid tumors, showing improved outcomes compared with historical controls. These results highlight the previously unrecognized immunostimulatory functions of MTX and provide a rationale for combining MTX with tumor immunotherapy and radiotherapy in clinical settings.",
    "authors": [
      "Ruirui Yang",
      "Bei Wang",
      "Zhaoming Su",
      "Ying Song",
      "Yingying Zhang",
      "Yadan Liu",
      "Yinghui Zhang",
      "Changyu He",
      "Xi Yang",
      "Feisheng Zhong",
      "Zunyun Fu",
      "Yiluan Ding",
      "Naixia Zhang",
      "Rui Li",
      "Shuqing Chu",
      "Chuanhai Xu",
      "Jian Sun",
      "Haiwei Shen",
      "Wei Geng",
      "Sulin Zhang",
      "Mingyue Zheng"
    ],
    "pub_date": "2025-Jun-04",
    "pmid": "40465690"
  },
  {
    "title": "A Phase I Study of the Anti-CEACAM6 Antibody Tinurilimab (BAY 1834942) in Patients with Advanced Solid Tumors.",
    "abstract": "Tinurilimab is a humanized immunoglobulin G subclass 2 antibody that blocks carcinoembryonic antigen-related cell adhesion molecule 6 (CEACAM6), an immune checkpoint regulator that is overexpressed in several tumor types. This phase I study evaluated the safety, tolerability, pharmacokinetics, pharmacodynamics, and tumor response profile of tinurilimab in patients with advanced solid tumors with a described expression of CEACAM6. In this first-in-human, dose-escalation and dose-expansion study, tinurilimab was administered as a 1-h intravenous infusion in 21-day cycles at a starting dose of 2.5 mg, with a planned escalation up to 1800 mg. Following observation of treatment toxicity (cytokine release syndrome in one patient and neutropenia in all patients treated at 30 mg), a premedication regimen was initiated that included dexamethasone 8 mg before and after dosing. Thirty patients received treatment across six dosing cohorts (2.5-100 mg with or without dexamethasone). The maximum tolerated dose was not determined, as the study was terminated due to an unfavorable benefit/risk assessment. All 30 patients (100%) treated with tinurilimab experienced at least one treatment-emergent adverse event of any grade, most commonly fatigue (36.7%), infusion-related reaction (30.0%), and neutropenia (26.7%). The most common grade ≥ 3 treatment-related adverse events were neutropenia (23.3%), followed by febrile neutropenia, cytokine release syndrome, increased hepatic enzymes, decreased lymphocyte count, hypophosphatemia, lactic acidosis, and acute kidney injury (3.3% each). No patients reported an objective response. Following study termination, the clinical development program for tinurilimab was discontinued permanently. www. gov , NCT03596372.",
    "authors": [
      "Lillian L Siu",
      "David S Hong",
      "Wolf-Dietrich Döcke",
      "Reimo Tetzner",
      "Mark Trautwein",
      "Charles Phelps",
      "Joerg Willuda",
      "Xiang Qing Yu",
      "Hendrik Nogai",
      "Melissa Johnson",
      "Boon Cher Goh"
    ],
    "pub_date": "2025-Jun-04",
    "pmid": "40465170"
  },
  {
    "title": "Study of the Role of the Tumor Microenvironment in Ovarian Cancer (MICO): A Prospective Monocentric Trial.",
    "abstract": "Ovarian cancer (OC) is one of the most aggressive tumors requiring new therapeutic approaches. Immunotherapy represents an opportunity, but to date, OC patients do not appear to benefit from current protocols. A better understanding of the composition of the tumor microenvironment (TME), especially in its immune components, could unveil mechanisms of immune suppression in a useful way to predict response to therapies and develop new therapeutic approaches. The MICO (tumor MICroenvironment of Ovarian cancer) study is a single-center observational study. Starting from peritoneal biopsy of high-grade serous ovarian carcinoma (HGSOC), the purpose of the MICO study is to generate tumor patient-derived organoid (PDOs) cultures and evaluate the concordance between in vitro platinum-based chemotherapy sensitivity and in vivo sensitivity. Simultaneously, we will characterize through multiparameter cytofluorimetric analysis the composition of the OC TME, focusing on B lymphocytes and mast cells whose roles in ovarian cancer remain controversial and underinvestigated. Furthermore, patients experiencing recurrence will be longitudinally followed to monitor changes in the TME composition and the responsiveness of PDOs to in vitro stimulation with drugs. The association between the composition of the TME, the reactivity of the PDOs, and patients' disease progression will be analyzed to identify whether specific subpopulations of tumor-infiltrating immune cells could be predictive factors of the disease outcomes. The comparison of molecular profiles, in vitro response to drugs, and clinical-pathological data will allow the definition of a pattern capable of predicting the response of the primary tumor for the identification of those patients who may benefit from specific treatment. The results of our study could help to better understand the OC behavior, may have implications for the development of effective immunotherapy and targeted pharmacological therapies for epithelial OC in a personalized medicine perspective. This will be a monocentric trial with an involvement of only 43 patients, so further studies will need to confirm our results. The clinical trial has been registered at Clinical-Trials.gov with the identifier NCT06272240 on 02/14/2024.",
    "authors": [
      "Martina Arcieri",
      "Eleonora Capezzali",
      "Stefano Restaino",
      "Sara Pregnolato",
      "Laura Mariuzzi",
      "Alessandro Mangogna",
      "Maria Orsaria",
      "Angelica Tulisso",
      "Silvia Tonon",
      "Maria De Martino",
      "Miriam Isola",
      "Lorenza Driul",
      "Carlo Pucillo",
      "Giovanni Scambia",
      "Barbara Frossi",
      "Giuseppe Vizzielli"
    ],
    "pub_date": "2025-Jun-",
    "pmid": "40464605"
  },
  {
    "title": "Ferroptosis-related gene signature-based subtype identification of triple-negative breast cancer to prioritize treatment strategies.",
    "abstract": "Ferroptosis, an iron-dependent form of regulated cell death (RCD), has been proven to affect the response to antineoplastic therapies. However, little is known about the role of ferroptosis in chemotherapy and immune checkpoint inhibitor (ICI) therapy responses, as well as the molecular subtype identification of triple-negative breast cancer (TNBC). We performed unsupervised clustering to stratify patients with TNBC in the Fudan University Shanghai Cancer Center (FUSCC) TNBC cohort into distinct ferroptosis-related subtypes according to the expression of eight ferroptosis-related genes (FRGs): EMC2, FTH1, HMOX1, LPCAT3, NOX4, SOCS1, BAP1, and ISCU. We conducted Gene Ontology (GO) analysis and gene set variation analysis (GSVA) to characterize the immune phenotype and enriched pathways of the distinct subtypes of TNBC. We constructed the FerrScore model to identify the most promising candidate compounds and predict ICI therapy benefits for patients with TNBC. We identified two distinct ferroptosis-related subtypes with different overall survival (OS). Patients in cluster 1 exhibited better OS, which had a phenotype of a \"hot\" tumor with abundant immune cell infiltration and higher expression of immune checkpoints compared to cluster 2. We screened everolimus as the most promising candidate drug for patients with high FerrScore referring to comprehensive factors including CMap score, experimental evidence, and clinical trial status. Further, we confirmed that FerrScore was a potentially powerful metric to predict anti-PD-L1, anti-PD-1, and anti-PD-1 + CTLA-4 ICI therapy benefits. Ferroptosis reprogrammed the tumor microenvironment (TME) and classified patients into distinct subgroups with significantly different OS. FerrScore was a potentially powerful metric to screen candidate compounds and predict ICI therapy benefits for patients with TNBC, which prioritized clinical treatment strategies.",
    "authors": [
      "Yongzhen Chen",
      "Xiaoying Huang",
      "Junqi Wang",
      "Chao Hu",
      "Yanan Zheng",
      "Yumeng Wang",
      "Shuqian Zheng",
      "Guozhong Ji",
      "Qiang You"
    ],
    "pub_date": "2025--",
    "pmid": "40463869"
  },
  {
    "title": "CAR-T cell therapy clinical trials: global progress, challenges, and future directions from ClinicalTrials.gov insights.",
    "abstract": "Chimeric antigen receptor T (CAR-T) cell therapy has undergone vigorous development in recent years, yet it still faces significant challenges and difficulties in its clinical application and further development. A systematic synthesis of global trends in CAR-T clinical trials is essential to identify knowledge gaps, optimize treatment strategies, and guide future research directions. This review analyzed 1,580 CAR-T clinical trials registered at ClinicalTrials.gov as of April 2024, and extracted characteristic data in multiple dimensions, including target specificity, treatment indication, and development stage etc. The transparency of trial outcomes was assessed by validation with articles published in PubMed/Google Scholar. Additionally, it is complemented by investigator surveys assessing to barriers to CAR-T development, prospects, and recommendations.",
    "authors": [
      "Li-Ya Cao",
      "Yue Zhao",
      "Yang Chen",
      "Pan Ma",
      "Jiang-Chuan Xie",
      "Xin-Mei Pan",
      "Xin Zhang",
      "Yong-Chuan Chen",
      "Qian Wang",
      "Lin-Li Xie"
    ],
    "pub_date": "2025--",
    "pmid": "40463393"
  },
  {
    "title": "Efficacy of neoadjuvant, adjuvant, and perioperative immunotherapy in non-small cell lung cancer across different PD-L1 expression levels: a systematic review and meta-analysis.",
    "abstract": "Immune checkpoint inhibitors, particularly anti-PD-1/PD-L1 monoclonal antibodies, have transformed non-small cell lung cancer (NSCLC) treatment. This meta-analysis evaluates the efficacy of neoadjuvant, adjuvant, and perioperative immunotherapy in resectable NSCLC, stratified by PD-L1 expression levels. We conducted a meta-analysis of 10 randomized controlled trials (RCTs) involving 11 articles, focusing on pathological complete response (pCR), major pathological response (MPR), event-free survival (EFS), and overall survival (OS). These outcomes were stratified by PD-L1 expression levels (<1%, ≥1%, 1-49%, ≥50%). Immunotherapy significantly improved pCR (OR=4.96, 95% CI=2.88-8.57 for PD-L1<1%; OR=9.58, 95% CI=6.32-14.53 for PD-L1≥1%), MPR (OR=2.86, 95% CI=1.97-4.16 for PD-L1<1%; OR=7.39, 95% CI=4.59-11.88 for PD-L1≥1%), and EFS (HR=0.80, 95% CI=0.70-0.92 for PD-L1<1%; HR=0.53, 95% CI=0.45-0.62 for PD-L1≥1%) across all PD-L1 subgroups. Greatest benefits were observed in PD-L1≥50% subgroup, with ORs for pCR and MPR, and HRs for EFS, showing consistent improvements. OS benefits were significant in PD-L1≥1% patients (HR=0.62, 95% CI=0.49-0.79 for PD-L1≥1%) but uncertain in PD-L1<1% cohorts (HR=1.11, 95% CI=0.86-1.44 for PD-L1<1%). Immunotherapy in perioperative setting demonstrated robust efficacy, with significant pathological response and EFS benefits across all PD-L1 subgroups. This meta-analysis supports immunotherapy within perioperative care for resectable NSCLC, emphasizing PD-L1 expression as a predictive biomarker. Future studies should optimize patient selection and clarify immunotherapy's role in different treatment settings. https://www.crd.york.ac.uk/PROSPERO/view/CRD42025644497, identifier CRD42025644497.",
    "authors": [
      "Zhenlong Zhang",
      "Yuchen Lin",
      "Shuchen Chen"
    ],
    "pub_date": "2025--",
    "pmid": "40463367"
  },
  {
    "title": "Prognostic Value of 18F-FDG PET/CT in Neoadjuvant PD-1 Inhibitor-treated NSCLC: A Five-year Follow-up Study.",
    "abstract": "Neoadjuvant immunotherapy has shown promising short-term outcomes of perioperative treatments for resectable non-small cell lung cancer (NSCLC) and is expected to release long-term survival benefits. Here, we reported the long-term prognostic value of 18F-FDG PET/CT over ∼a 5-year follow-up. A total of 35 patients with NSCLC (29 males and 6 females; median age, 62 y) received 2 doses of sintilimab, followed by complete tumor resection and PET/CT scans at baseline and post-neoadjuvant stages. We investigated the prognostic value of PET/CT for overall survival (OS) and progression-free survival (PFS), focusing on metabolic parameters of primary tumors, mediastinal lymph nodes, lymphoid organs, and immune-related adverse events on imaging. During a median follow-up of 62.6 months, patients with low primary tumor metabolism (SULmax ≤6.6, SULpeak ≤4.0/3.9, or SULmean ≤2.7) at post-neoadjuvant scan were alive and disease-free, demonstrating improved OS (P = 0.07, 0.07, and 0.09) and significantly enhanced PFS (P = 0.01, 0.02, and 0.02); those with low metabolic tumor volume ≤49.3 or total lesion glycolysis ≤41.0 at post-neoadjuvant scan also had significantly improved OS (P = 0.03 and 0.05). Patients with low lymph node metabolism (SULmax ≤4.6) at baseline scan had significantly improved PFS (P = 0.04). This is the first study to report the long-term prognostic value of 18F-FDG PET/CT for resectable NSCLC after neoadjuvant immunotherapy. Low primary tumor metabolism at post-neoadjuvant scan and low lymph node metabolism at baseline scan are promising prognostic markers for improved clinical outcomes.",
    "authors": [
      "Xiuli Tao",
      "Qian Zhang",
      "Ning Li",
      "Shuhang Wang",
      "Wei Guo",
      "Pei Yuan",
      "Jianming Ying",
      "Jing Li",
      "Lei Guo",
      "Wei Tang",
      "Ying Liu",
      "Zewei Zhang",
      "Shijun Zhao",
      "Shugeng Gao",
      "Ning Wu"
    ],
    "pub_date": "2025-Jul-01",
    "pmid": "40462321"
  },
  {
    "title": "Neoadjuvant toripalimab combined with chemotherapy in locally advanced HNSCC.",
    "abstract": "To determine the safety and efficacy of neoadjuvant toripalimab combined with chemotherapy in locally advanced head and neck squamous cell carcinoma (LA-HNSCC). This single-arm investigator-initiated trial was conducted at a tertiary cancer hospital in China. The untreated LA-HNSCC patients received two cycles of neoadjuvant paclitaxel and cisplatin (TP) + toripalimab regimen (paclitaxel 175 mg/m The study enrolled a total of 23 patients. All the patients completed the entire treatment course with an ORR of 78.3% (18/23). Any grades of treatment-related adverse events (TRAEs) were reported in 12 patients (52.2%), and three patients experienced grade 3-4- TRAEs. No delay for curative treatment was observed. Twelve patients underwent radical surgery, and six patients developed pathological complete response (pCR), with a pCR rate of 50%. With a median follow-up of 15 months, 12 surgery patients maintained event-free survival; however, three out of 11 who received CRT suffered from local recurrence or metastases. Neoadjuvant TP + toripalimab for LA-HNSCC showed high ORR and pCR rates with a good safety profile. https://www.chictr.org.cn/showproj.html?proj=231832, identifier ChiCTR2400091148.",
    "authors": [
      "Zhaoyang Wang",
      "Sheng Yang",
      "Dangui Yan",
      "Ye Zhang",
      "Xiwei Zhang",
      "Fa Zhang",
      "Xiaohui Zhao",
      "Zongmin Zhang",
      "Shaoyan Liu",
      "Lin Gui",
      "Changming An"
    ],
    "pub_date": "2025--",
    "pmid": "40458723"
  },
  {
    "title": "Final Survival Outcomes With Ramucirumab Plus Erlotinib Versus Placebo Plus Erlotinib in Patients With Untreated ",
    "abstract": "Significant improvement in progression-free survival (PFS; primary end point) was reported in the phase 3 RELAY study with ramucirumab (RAM) plus erlotinib (ERL) versus placebo (PL) in untreated  Patients (no central nervous system metastases) were randomized 1:1 (stratification included  At final OS data cutoff (median follow-up = 48.2 mo), PFS benefit was sustained with RAM plus ERL versus PL plus ERL (median [m] PFS: 19.4 versus 11.2 mo; HR = 0.69, 95% CI: 0.51-0.93); the mOS was 54.3 and 46.0 months (HR = 0.91, 95% CI: 0.65-1.26), respectively. In L858R (n = 110) and ex19del (n = 100) subgroups, the mOS was 54.3 versus 43.2 months (HR = 0.63, 95% CI: 0.40-0.99) and 53.9 versus 62.1 months (HR = 1.40, 95% CI: 0.86-2.28), respectively. T790M rates post-progression were 52.0% versus 51.1%, respectively. Osimertinib as subsequent therapy was received by 61.0% versus 55.2% patients (L858R: 58.2% versus 48.1%; ex19del: 65.3% versus 62.7%); the median (range) osimertinib treatment duration was 16.8 (0.7-58.3) versus 20.1 (2.1-77.2) months. Safety was consistent with known RAM and ERL profiles, with no increased toxicity over time. The Japanese subset reported that RAM plus ERL improved PFS, and a mOS greater than 50 months was achieved. OS differed by  NCT02411448.",
    "authors": [
      "Makoto Nishio",
      "Takashi Seto",
      "Martin Reck",
      "Edward B Garon",
      "Kazuto Nishio",
      "Kazuo Kasahara",
      "Kazumi Nishino",
      "Miyako Satouchi",
      "Kiyotaka Yoh",
      "Hidetoshi Hayashi",
      "Kazuko Sakai",
      "Sotaro Enatsu",
      "Bente Frimodt-Møller",
      "Tomoko Matsui",
      "Sunoj Chacko Varughese",
      "Michelle Carlsen",
      "Carla Visseren-Grul",
      "Kazuhiko Nakagawa"
    ],
    "pub_date": "2025-Jun-",
    "pmid": "40458541"
  },
  {
    "title": "Therapeutic drug monitoring (TDM) of tyrosine kinase inhibitors (TKI) for optimized outcome in patients with metastatic renal cell carcinoma. The TKI-TDM Trial. Study protocol.",
    "abstract": "Metastatic renal cell carcinoma (mRCC) is notably resistant to chemotherapy and radiotherapy. However, tyrosine kinase inhibitors (TKIs) and checkpoint immunotherapy have significantly improved outcomes. Still, about 20% of patients experience disease progression as their best response to TKIs, and 16-63% endure severe toxicities, reducing quality of life. Optimizing dosing is therefore essential. Therapeutic drug monitoring (TDM) is a promising strategy for individualizing treatment. The TKI-TDM trial aims to identify a therapeutic plasma concentration range for six TKIs (axitinib, cabozantinib, pazopanib, sorafenib, sunitinib, tivozanib) in mRCC patients. This prospective observational study will enroll mRCC patients with at least 6 months of stable disease or regression on TKI therapy. Blood samples will be collected during routine care. Plasma concentrations of TKIs and metabolites will be measured using validated liquid chromatography-tandem mass spectrometry (LC-MS/MS) methods. These levels will be correlated with clinical outcomes including objective response rate, progression-free survival, overall survival, and toxicity. Genetic analysis of UGT1A1 polymorphisms will explore their influence on pazopanib metabolism and response. Identifying plasma TKI levels associated with efficacy and reduced toxicity could minimize under- or overdosing, improving outcomes and quality of life. TDM may allow dose adjustments early in therapy, improving therapeutic management and reducing healthcare costs. Findings may also inform treatment of other cancers using TKIs or TKI-immunotherapy combinations. The trial (clinicaltrials.gov NCT04659343) is expected to conclude in 2028, with results in 2029.",
    "authors": [
      "Jakob N Henriksen",
      "Charlotte U Andersen",
      "Frede Donskov",
      "Elke Hoffmann-Lücke",
      "Eva Greibe",
      "Niels Fristrup"
    ],
    "pub_date": "2025-Jun-02",
    "pmid": "40457584"
  },
  {
    "title": "Multi-omics unveils BCAA metabolism markers L-leucine and HMGCS1 as prognostic marker for immunotherapy efficacy in non-small cell lung cancer.",
    "abstract": "This study aims to identify branched-chain amino acid (BCAA) plasma metabolites and gene signatures that enhance prognostic assessments in non-small cell lung cancer (NSCLC) patients receiving immunotherapy. Plasma metabolites were measured using untargeted UPLC-MS/MS (n = 94 and 40), with lymphocyte subset tests on 72 patients. BCAA-related subtypes were identified in NSCLC datasets (n = 274, 176, and 196). A prognostic risk model was developed and validated in NSCLC (n = 16, 27, 24, and 339), melanoma (n = 25), and pan-cancer ICIs cohorts (n = 330 and 81). Immune cell infiltration and prognostic signatures were validated using mIF (n = 21 in CHCAMS), scRNA-seq (n = 8 and 21), and spatial transcriptomics (n = 2 and 6). Cell and animal experiments involving HMGCS1 were conducted in a lung cancer model. Additionally, based on our previous findings that B cells with higher malignancy exhibited enhanced cholesterol homeostasis pathways in diffuse large B-cell lymphoma (DLBCL), we further analyzed the prognostic value of HMGCS1 using our spatial transcriptomics (n = 10) and immunohistochemistry (IHC, n = 39) in DLBCL. Our plasma metabolite analysis showed higher L-leucine levels were associated with better prognosis and had higher T cell counts and CD4 This study identifies a BCAA-related plasma metabolites and gene signature as effective prognostic markers for NSCLC patients receiving immunotherapy, with HMGCS1 as a key prognostic factor influencing tumor progression and immune response.",
    "authors": [
      "Liyuan Dai",
      "Xinzheng Wang",
      "Ning Lou",
      "Lin Li",
      "Liling Huang",
      "Le Tang",
      "Jiarui Yao",
      "Yuankai Shi",
      "Xiaohong Han"
    ],
    "pub_date": "2025-Jun-02",
    "pmid": "40457349"
  },
  {
    "title": "Macrophages in prostate cancer: dual roles in tumor progression and immune evasion.",
    "abstract": "Prostate malignant tumors are notably common within the male urinary tract and present significant challenges in medical treatment. A crucial aspect of understanding the progression of these tumors involves examining the immune microenvironment, particularly the multifaceted role played by macrophages. These immune cells have dual functions: on the one hand, they can inhibit tumor growth, while on the other hand, they can also facilitate and accelerate the progression of prostate cancer. Investigations have shed light on the mechanisms through which macrophages contribute to cancer promotion. These mechanisms include their involvement in mediating inflammatory responses, the secretion of chemokines that attract other immune cells, and the production of macrophage extracellular traps (METs), all of which may create favorable environments for tumor development. In the context of advanced prostate cancer, immunotherapy has emerged as the primary treatment modality. However, the effectiveness of this approach often falls short, leading to disheartening prognoses for patients undergoing such therapies. The suboptimal efficacy and poor outcomes associated with immunotherapy may be correlated with the activity of macrophages within the tumor microenvironment (TME). Specifically, the infiltration of macrophages into tumor tissues, along with elevated levels of these cells in the peripheral blood, has been identified as an indicator of a poor prognosis for individuals with prostate cancer. This study provides a deeper understanding of the cancer-promoting effects of macrophages and the various mechanisms by which they operate, including the roles of chemokines and the production of macrophage extracellular traps in both the onset and progression of prostate cancer. Furthermore, we explored how these factors are related to local tumor infiltration and systemic macrophage counts, which are associated with unfavorable survival outcomes for patients with this disease.",
    "authors": [
      "Ruihong Liu",
      "Jianxin Lu",
      "Jun Liu",
      "Yilei Liao",
      "Yinuo Guo",
      "Peiqi Shi",
      "Ziqiang Wang",
      "Han Wang",
      "Jingling Lai"
    ],
    "pub_date": "2025-Jun-02",
    "pmid": "40457341"
  },
  {
    "title": "Perioperative Durvalumab in Gastric and Gastroesophageal Junction Cancer.",
    "abstract": "Perioperative FLOT (fluorouracil, leucovorin, oxaliplatin, and docetaxel) is a standard therapy for resectable gastric and gastroesophageal junction adenocarcinomas, but recurrence rates remain high. Immunotherapy plus chemotherapy may improve outcomes. In a phase 3, multinational, double-blind, randomized trial, we assigned participants with resectable gastric or gastroesophageal junction adenocarcinoma, in a 1:1 ratio, to receive durvalumab at a dose of 1500 mg or placebo every 4 weeks plus FLOT for 4 cycles (2 cycles each of neoadjuvant and adjuvant therapy), followed by durvalumab or placebo every 4 weeks for 10 cycles. The primary end point was event-free survival; secondary end points included overall survival and pathological complete response. A total of 474 participants were randomly assigned to the durvalumab group, and 474 to the placebo group (median follow-up, 31.5 months; interquartile range, 26.7 to 36.6). Two-year event-free survival (Kaplan-Meier estimate) was 67.4% among the participants in the durvalumab group and 58.5% among those in the placebo group (hazard ratio for event or death, 0.71; 95% confidence interval [CI], 0.58 to 0.86; P<0.001). Two-year overall survival was 75.7% in the durvalumab group and 70.4% in the placebo group (piecewise hazard ratio for death during months 0 to 12, 0.99 [95% CI, 0.70 to 1.39], and during the period from month 12 onward, 0.67 [95% CI, 0.50 to 0.90]; P = 0.03 by a stratified log-rank test [exceeding the significance threshold of P<0.0001]). The percentage of participants with a pathological complete response was 19.2% in the durvalumab group and 7.2% in the placebo group (relative risk, 2.69 [95% CI, 1.86 to 3.90]). Adverse events with a maximum grade of 3 or 4 were reported in 340 participants (71.6%) in the durvalumab group and in 334 (71.2%) in the placebo group. The percentage of participants with delayed surgery was 10.1% and 10.8%, respectively, and the percentage with delayed initiation of adjuvant treatment was 2.3% and 4.6%. Perioperative durvalumab plus FLOT led to significantly better event-free survival outcomes than FLOT alone among participants with resectable gastric or gastroesophageal junction adenocarcinoma. (Funded by AstraZeneca; MATTERHORN ClinicalTrials.gov number, NCT04592913.).",
    "authors": [
      "Yelena Y Janjigian",
      "Salah-Eddin Al-Batran",
      "Zev A Wainberg",
      "Kei Muro",
      "Daniela Molena",
      "Eric Van Cutsem",
      "Woo Jin Hyung",
      "Lucjan Wyrwicz",
      "Do-Youn Oh",
      "Takeshi Omori",
      "Markus Moehler",
      "Marcelo Garrido",
      "Sulene C S Oliveira",
      "Moishe Liberman",
      "Victor Castro Oliden",
      "Elizabeth C Smyth",
      "Alexander Stein",
      "Mehmet Bilici",
      "Maria Lorena Alvarenga",
      "Vadim Kozlov",
      "Fernando Rivera",
      "Akihito Kawazoe",
      "Olivier Serrano",
      "Eric Heilbron",
      "Alejandra Negro",
      "John F Kurland",
      "Josep Tabernero"
    ],
    "pub_date": "2025-Jun-01",
    "pmid": "40454643"
  },
  {
    "title": "Combination regimens as potential treatment of non-small-cell lung cancer patients with HER2 mutation in the real world: a multicenter study.",
    "abstract": "Non-small-cell lung cancer (NSCLC) with human epidermal growth factor receptor 2 (HER2) mutations poses significant treatment challenges. While chemotherapy combined with immunotherapy or anti-angiogenic therapy has been explored, no standardized regimen exists for these patients. This study aims to evaluate the efficacy of different treatment regimens for HER2-mutated NSCLC. Our study aimed to investigate the survival among NSCLC patients with HER2 mutation who received various treatment regimens in real-world settings, providing insights and guidance for clinical practice. Survival analyses were conducted on patients who underwent different treatment regimens, including chemotherapy, immunotherapy, tyrosine kinase inhibitors (TKIs), and combination therapies, to evaluate their effectiveness. This retrospective study included 118 patients diagnosed with HER2 mutations through next-generation sequencing at Zhejiang Cancer Hospital and Jinling Hospital affiliated with Nanjing University Medical School from September 2017 to December 2024. Data on treatment regimens and clinical outcomes, including objective response rate (ORR), disease control rate (DCR), progression-free survival (PFS), and overall survival (OS), were collected. Kaplan-Meier analysis estimated PFS and OS, and Cox regression identified factors influencing PFS. Among the 118 patients, ORR and DCR were 22.9% and 58.5%, respectively. Median PFS and OS were 7.3 and 44.9 months, respectively. Combination therapies significantly improved PFS compared to single chemotherapy or immunotherapy or TKIs group (7.8 vs 5.3 months,  Combination regimens, especially C + I + A, significantly improve PFS and offer superior therapeutic benefits for patients with HER2-mutated NSCLC compared to single chemotherapy or immunotherapy or TKIs treatments.",
    "authors": [
      "Yue Hao",
      "Qian Wang",
      "Ke Wang",
      "Chengyu Chen",
      "Chunwei Xu",
      "Dong Wang",
      "Yong Song",
      "Zhengbo Song",
      "Tangfeng Lv"
    ],
    "pub_date": "2025--",
    "pmid": "40453694"
  },
  {
    "title": "Synergistic effects of PD-1 antibody and chemotherapy followed by surgery-centric local treatment in patients with limited-metastatic gastric or gastroesophageal adenocarcinoma (ROSETTE trial): an open-label, single-center, randomized phase 2 trial.",
    "abstract": "Limited metastatic gastric cancer (lmGC) represents an intermediate disease stage, positioned between localized and widely disseminated gastric cancer, and has garnered increasing attention due to its distinct prognostic outcomes. Currently, there is no consensus on the optimal treatment approach for lmGC, raising the question of whether it should align more with the systemic treatment-focused approach used for metastatic gastric cancer or adopt a surgery-centric strategy similar to that used in localized disease. Previous studies have preliminarily explored combining systemic treatment and surgical resection to address both the primary tumor and metastatic lesions. However, these investigations have been constrained by limited evidence and yielded inconclusive findings. ROSETTE trial is an open-label, randomized phase II study designed to investigate treatment strategies for patients with limited metastatic gastric or gastroesophageal adenocarcinoma. Eligible patients, confirmed through comprehensive evaluation including radiography and laparoscopy, are randomized to receive either systemic treatment followed by surgery-centric local treatment, or systemic treatment alone. Systemic treatment combines immunotherapy with chemotherapy, while the surgery-centric local treatment utilizes a surgery-centric, multi-modality approach involving resection of both primary and metastatic tumors where feasible. For unresected or unresectable metastatic lesions, alternative local therapies are provided. The primary endpoint is the 1-year event-free survival (EFS) rate. Secondary endpoints include objective response rate (ORR), disease control rate (DCR), extended EFS, overall survival (OS), pathologic complete response rate (pCR), major pathologic response rate (MPR), and R0 resection rate. The ROSETTE trial aims to evaluate whether systemic treatment followed by surgery-centric local treatment provides a survival advantage over the standard systemic-only approach for patients with limited metastatic gastric cancer. It seeks to build on previous research while addressing limitations such as selection bias inherent to non-randomized designs, patient recruitment challenges, and the complexities of managing surgical complications. By applying the latest evidence and a multi-modality approach, the ROSETTE trial endeavors to offer new insights into optimizing treatment strategies for patient with lmGC. NCT06468280 (Registration date: 05/28/2024).",
    "authors": [
      "Ying Ying Wu",
      "Lian Chen Lee",
      "Hong Zeng",
      "Yuan Gu",
      "Chen Xu",
      "Wei Dong Chen",
      "Zhen Bin Shen",
      "Kun Tang Shen",
      "Yue Hong Cui",
      "Yi Hong Sun",
      "Tian Shu Liu",
      "Zhao Qing Tang",
      "Xue Fei Wang"
    ],
    "pub_date": "2025-Jun-01",
    "pmid": "40452026"
  },
  {
    "title": "Avelumab and taxol chemotherapy in platinum-refractory or ineligible metastatic urothelial carcinoma (AVETAX trial).",
    "abstract": "This study investigates the role of taxanes and immunotherapy for inoperable advanced or metastatic urothelial carcinoma in patients unable to tolerate or refractory to platinum-based regimens. We aimed to determine the safety and estimate the efficacy of a combination of avelumab and docetaxel in treating advanced or metastatic urothelial carcinoma. This phase 1b, single-arm, open-label clinical trial involved adults with advanced or metastatic urothelial carcinoma, progressing during or after platinum-containing chemotherapy, within 12 months of neoadjuvant or adjuvant platinum-containing chemotherapy, or ineligible for platinum regimens. Primary objectives were determining the maximum tolerated dose (MTD) of docetaxel with avelumab and estimating efficacy via the objective response rate (ORR). In Phase I, docetaxel (45, 60, 75 mg/m²) was combined with 10 mg/kg avelumab every 3 weeks for 6 cycles, followed by avelumab biweekly as maintenance. The expansion cohort received treatment at the MTD of 75 mg/m² docetaxel with 10 mg/kg of avelumab. Twenty-one patients with advanced or metastatic urothelial carcinoma were studied: 8 cisplatin-refractory and 13 cisplatin-ineligible. The 75 mg/m² dose of docetaxel with 10 mg/kg avelumab was safe, with 1 dose-limiting toxicity (neutropenic fever). The ORR was 52.4% (95% CI: 29.8%-74.3%). Median progression-free survival and overall survival were 14.6 months (95% CI: 2.8-15.8) and 16.6 months (95% CI: 13.2-not reached), respectively. The combination of avelumab and docetaxel shows favorable safety and efficacy in treating advanced or metastatic bladder cancer. Funded by Pfizer Pharmaceuticals; AVETAX; https://classic. gov/ct2/show/NCT03575013, NCT03575013.",
    "authors": [
      "Rohan Garje",
      "Aditya Ravindra",
      "Bilal Rahim",
      "Mathew Kroll",
      "Jeffrey S Johnson",
      "Julie Torres",
      "Jaime Bonner",
      "Vignesh T Packiam",
      "Sarah Mott",
      "Michael O'Donnell",
      "Yousef Zakharia"
    ],
    "pub_date": "2025-May-31",
    "pmid": "40451703"
  },
  {
    "title": "Integrative transcriptomic and single-cell analysis reveals IL27RA as a key immune regulator and therapeutic indicator in breast cancer.",
    "abstract": "Interleukin-27 receptor alpha (IL27RA), a key subunit of the interleukin-27 receptor, plays an essential role in T cell-mediated immunity. However, its relevance in breast cancer and response to immunotherapy remains unexplored. We integrated bulk and single-cell RNA sequencing data from TCGA, GEO, and scRNA-seq datasets to analyze IL27RA expression, prognosis, immune infiltration, and treatment response. TIDE and immune checkpoint-treated clinical cohorts were used to assess immunotherapy responsiveness. Chemotherapy sensitivity was predicted using GDSC data, and IL27RA protein expression was validated by Western blot. IL27RA was downregulated in breast cancer but high expression correlated with favorable survival. It was primarily expressed in T cells, particularly CD8⁺ subsets, and associated with enriched immune infiltration and elevated checkpoint gene expression. IL27RA high-expression patients showed lower TIDE scores, better outcomes in ICI-treated cohorts, and higher sensitivity to multiple chemotherapeutic agents. IL27RA is a potential immune biomarker that reflects an inflamed tumor microenvironment and predicts benefit from immunotherapy and chemotherapy in breast cancer. These findings provide novel insights into immune-based stratification using single-cell transcriptomic data.",
    "authors": [
      "Yi Chen",
      "Munawar Anwar",
      "Xiaoli Wang",
      "Boxiang Zhang",
      "Binlin Ma"
    ],
    "pub_date": "2025-Jun-01",
    "pmid": "40450602"
  },
  {
    "title": "Combination of encorafenib and binimetinib followed by ipilimumab and nivolumab versus ipilimumab and nivolumab in patients with advanced melanoma with BRAF",
    "abstract": "Current first-line treatment for patients with metastatic melanoma with BRAF This open-label, randomised, controlled, phase 2 trial (EBIN) was conducted at 37 centres in eight European countries. Eligible patients were 18 years or older and had previously untreated, unresectable, stage III or IV melanoma with BRAF Between Nov 12, 2018, and July 11, 2022, 271 patients were randomly assigned: 136 to the induction group and 135 to the control group. 103 (38%) patients were female, 168 (62%) were male, and the median age was 55 years (IQR 43-66). The median follow-up time was 21 months (IQR 13-33). There was no evidence of a longer progression-free survival in the induction group than in the control group (hazard ratio 0·87, 90% CI 0·67-1·12; p=0·36). The median progression-free survival was 9 months (95% CI 7-13) in the induction group and 9 months (5-14) in the control group. Grade 3-5 treatment-related adverse events occurred in 57 (42%) of 136 patients who started treatment in the induction group and in 42 (32%) of 131 patients who started treatment in the control group. The most common grade 3-4 treatment-related adverse event was hepatitis (17 [13%] of 136 patients in the induction group and nine [7%] of 131 patients in the control group). Serious treatment-related adverse events occurred in 45 (33%) of 136 patients in the induction group and 33 (25%) of 131 patients in the control group. There were three treatment-related deaths: two from cardiac events (heart failure and arrhythmia) in the induction group and one from meningitis in the control group. The targeted-therapy induction regimen did not improve progression-free survival compared with first-line treatment with immune checkpoint inhibitors in unselected patients with advanced melanoma with BRAF Bristol Myers Squibb and Pierre Fabre.",
    "authors": [
      "Caroline Robert",
      "Michal Kicinski",
      "Caroline Dutriaux",
      "Émilie Routier",
      "Anne-Sophie Govaerts",
      "Emanuel Bührer",
      "Eve-Marie Neidhardt",
      "Xavier Durando",
      "Barouyr Baroudjian",
      "Philippe Saiag",
      "Caroline Gaudy-Marqueste",
      "Paolo A Ascierto",
      "Ana Arance",
      "Michelangelo Russillo",
      "Jean-Luc Perrot",
      "Laurent Mortier",
      "Francois Aubin",
      "Stéphane Dalle",
      "Florent Grange",
      "Eva Muñoz-Couselo",
      "Sorilla Mary-Prey",
      "Mona Amini-Adle",
      "Sandrine Mansard",
      "Céleste Lebbe",
      "Elisa Funck-Brentano",
      "Sandrine Monestier",
      "Alexander M M Eggermont",
      "Felix Oppong",
      "Leen Wijnen",
      "Bastian Schilling",
      "Mario MandalÁ",
      "Paul Lorigan",
      "Alexander C J van Akkooi"
    ],
    "pub_date": "2025-Jun-",
    "pmid": "40449497"
  },
  {
    "title": "Anti-viral CD8 central memory veto cells as a new platform for CAR T cell therapy.",
    "abstract": "Central memory CD8 T cells exhibit marked veto activity enhancing engraftment in several mouse models of T cell-depleted bone marrow (TDBM) allografting. Graft-versus-host disease (GVHD) can be prevented by stimulation of mouse or human memory CD8 T cells against their cognate antigens under cytokine deprivation, in the early phase of culture followed by further expansion with IL21, IL15, and IL7. Thus, human anti-viral CD8 central memory veto T cells generated from CMV and EBV-positive donors are currently evaluated in a clinical trial at MD Anderson Cancer Centre (MDACC). Results in 15 patients indicate a low risk of GVHD. Considering that these cells could offer an attractive platform for CAR cell therapy, we evaluated methodologies for their effective transduction with 2 retroviral vectors. Initially, a vector directed against Her2 was tested and optimal transduction was attained at day 5 of culture. The transduced cells were expanded for an additional 7 days and exhibited marked anti-tumor reactivity ex-vivo while retaining their veto activity. Transduction with a vector directed at CD19 was effectively attained at days 4-5 allowing for substantial harvest of transduced cells at day 12 of culture. These Veto-CD19CAR central memory CD8 T cells exhibited marked anti-tumor reactivity in-vitro and in-vivo without GVHD, measured following transplantation into immune-deficient mice. These results strongly suggest that Veto-CAR T cells offer an attractive platform for CAR T cell therapy without gene editing for addressing the risk of GVHD or graft rejection.",
    "authors": [
      "Wei-Hsin Liu",
      "Anat Globerson Levin",
      "Assaf Lask",
      "Galit Horn",
      "Tova Waks",
      "Bar Nathansohn Levi",
      "Irit Milman Krentsis",
      "Einav Shoshan",
      "Xiaohua Su",
      "Maksim Mamonkin",
      "Richard E Champlin",
      "Yair Reisner",
      "Esther Bachar Lustig"
    ],
    "pub_date": "2025-May-31",
    "pmid": "40448965"
  },
  {
    "title": "Human autoimmunity at single cell resolution in aplastic anemia before and after effective immunotherapy.",
    "abstract": "Severe immune aplastic anemia is a fatal disease due to the destruction of marrow hematopoietic cells by cytotoxic lymphocytes, serving as a paradigm for marrow failure syndromes and autoimmune diseases. To better understand its pathophysiology, we apply advanced single cell methodologies, including mass cytometry, single-cell RNA, and TCR/BCR sequencing, to patient samples from a clinical trial of immunosuppression and growth factor stimulation. We observe opposing changes in the abundance of myeloid cells and T cells, with T cell clonal expansion dominated by effector memory cells. Therapy reduces and suppresses cytotoxic T cells, but new T cell clones emerge hindering robust hematopoietic recovery. Enhanced cell-cell interactions including between hematopoietic cells and immune cells, in particular evolving IFNG and IFNGR, are noted in patients and are suppressed post-therapy. Hematologic recovery occurs with increases in the progenitor rather than stem cells. Genetic predispositions linked to immune activation genes enhances cytotoxic T cell activity and crosstalk with target cells.",
    "authors": [
      "Zhijie Wu",
      "Shouguo Gao",
      "Xingmin Feng",
      "Haoran Li",
      "Nicolas Sompairac",
      "Shirin Jamshidi",
      "Desmond Choy",
      "Rita Antunes Dos Reis",
      "Qingyan Gao",
      "Sachiko Kajigaya",
      "Lemlem Alemu",
      "Diego Quinones Raffo",
      "Emma M Groarke",
      "Shahram Kordasti",
      "Bhavisha A Patel",
      "Neal S Young"
    ],
    "pub_date": "2025-May-30",
    "pmid": "40447607"
  },
  {
    "title": "Beyond maximum grade: using patient-generated data to inform tolerability of treatments for haematological malignancies.",
    "abstract": "Incorporating patient-generated data into drug development is crucial for assessing the tolerability of treatments, particularly in patients with haematological malignancies, some of whom receive high-intensity, short-duration treatments and others who endure chronic therapies for months to years at a time. With increasing use of novel therapies such as oral targeted agents and immunotherapy, including chimeric antigen receptor T-cell therapy and bispecific antibodies across different haematological malignancies, new types of toxicity assessment techniques that harness patient-generated data, including patient-reported outcomes (PROs) are required to fully evaluate short-term and long-term side-effects. In this second paper in this Series, we describe progress in PRO implementation in clinical trials and outline future directions for use of patient-generated data, including PRO implementation in early-phase trials, novel PRO-based endpoints in haematology trials, and updated PRO measures that reflect treatment advances across haematological malignancies.",
    "authors": [
      "Vishal Bhatnagar",
      "Amylou C Dueck",
      "Fabio Efficace",
      "Paul Kluetz",
      "Lori Minasian",
      "Galina Velikova",
      "Caitlin Drew",
      "Gita Thanarajasingam"
    ],
    "pub_date": "2025-Jun-",
    "pmid": "40447354"
  },
  {
    "title": "Role of high-dose interleukin-2 for melanoma in the age of cellular therapy.",
    "abstract": "Interleukin-2 (IL-2) was one of the first immunotherapies in the treatment of patients with cancer. High-dose bolus IL-2 (HD IL-2) can induce durable complete or partial tumor regression in a small proportion of advanced melanoma and renal cell carcinoma patients. However, its potential for life-threatening side effects and requirement for inpatient administration limits its use to patients with excellent organ function treated at experienced centers. In 2024, following decades of foundational work at the National Cancer Institute, lifileucel became the first FDA-approved tumor-infiltrating lymphocyte (TIL) therapy for cancer. HD IL-2 is routinely given after TIL infusion to promote the survival and proliferation of the T cell product. In this context, fewer doses are given, and the parameters for holding an IL-2 dose are more conservative, as compared with HD IL-2 monotherapy, which has now fallen out of routine use. The lower number of doses, and possibly the effects of the preparative lymphodepletion, result in much less cytokine-related toxicity. Nevertheless, concerns related to HD IL-2 toxicity persist and possibly impact decisions to offer TIL when indicated. Here, we discuss the differences in the administration of HD IL-2 as a monotherapy vs an adjunctive therapy following TIL infusion, in an effort to demystify the toxicity of HD IL-2 in the era of cellular therapy.",
    "authors": [
      "Elizabeth Buchbinder",
      "Michael T Lotze",
      "Kim A Margolin",
      "Rodabe Amaria",
      "Amod Sarnaik",
      "Virginia Seery",
      "Zeynep Eroglu",
      "Karam Khaddour",
      "Allison Betof Warner",
      "Harriet M Kluger",
      "Mario Sznol",
      "Michael B Atkins",
      "David F Mcdermott",
      "Ann W Silk"
    ],
    "pub_date": "2025-May-30",
    "pmid": "40447314"
  },
  {
    "title": "High pathological tumor response associates with enhanced overall survival in HNSCC patients following neoadjuvant immunochemotherapy and surgery.",
    "abstract": "This study aimed to evaluate the impact of the postoperative pathological remission status on the prognosis of patients who underwent surgery after neoadjuvant immunochemotherapy in head and neck squamous cell carcinoma (HNSCC). This study retrospectively analyzed patients who participated in a clinical trial at our hospital. These patients received neoadjuvant pembrolizumab combined with platinum and taxane followed by surgery from March 1, 2021, to November 1, 2024. Clinical and pathological characteristics were collected. Cox regression analysis was used to analyze clinical and pathological characteristics by univariate and multivariate analysis, and Kaplan Meier (KM) survival curves were plotted to evaluate the associations of clinical and pathological characteristics with the progression free survival (PFS) and overall survival(OS). Propensity score matching (PSM) was used to level the baseline of clinical characteristics. The study cohort consisted of a total of 62 patients. the PFS rate of the patients was 85.5%, and the OS rate was 87.1%. The follow-up period of the patients ranged from 4 to 41 months, with an mean follow-up time of 23.7 months. However, high pathological tumor response (PTR) was significantly associated with better OS (97.2% vs 70.8%) and was an independent prognostic factor ( hazard ratio 0.153; 95% Confidence interval 0.018 - 1.307, p = 0.046). Before and after PSM, patients with high PTR had a significantly longer OS than those without high PTR (p = 0.0258,0.0053). Our study showed a strong OS improvement in patients who achieved high PTR after neoadjuvant immunochemotherapy.",
    "authors": [
      "Yudong Ning",
      "Yixuan Song",
      "Han Li",
      "Yuqin He",
      "Shaoyan Liu",
      "Yang Liu"
    ],
    "pub_date": "2025-May-29",
    "pmid": "40442776"
  },
  {
    "title": "To explore the molecular mechanisms and shared genetic characteristics of rheumatoid arthritis and cervical cancer based on multiple omics and clinical samples.",
    "abstract": "The potential association between rheumatoid arthritis (RA) and cervical cancer risk is still debated and necessitates additional clinical investigations. This study aimed to explore this relationship using Mendelian randomization and multi-omics analysis, aiming to enhance insights and reduce redundancy. This study employs a Mendelian randomization approach to investigate potential associations between rheumatoid arthritis (RA) and cervical cancer susceptibility. Single-cell enrichment scores were calculated using RA-specific transcriptome differentially expressed genes, and prognostic models were developed using 10 machine learning algorithms to assess cervical cancer differential gene expression associated with RA scores. Subsequently, differences in clinical characteristics, immune cell infiltration, immunotherapy efficacy, and response to chemotherapeutic drugs were analyzed between high- and low-risk groups of patients. Finally, the expression of model genes was verified by cervical cancer cell lines and clinical fresh samples. Mendelian randomization has revealed an increased incidence of cervical cancer associated with RA. RA enrichment scores show predominant enrichment in the single-cell NK cell subpopulation. Cervical cancer can be distinctly categorized into two subgroups based on RA score-associated prognostic genes, demonstrating significant differences in immune cell infiltration and prognosis between these subgroups. Prognostic modeling indicates that patients in the low-risk group exhibit better prognosis, enhanced immune cell infiltration, and improved response to immunotherapy and drug treatments. Finally, multiple external data confirmed that there were significant differences in the expression of model genes. Rheumatoid arthritis is causally associated with the development of cervical cancer. Patients with rheumatoid arthritis have an increased risk of concurrent cervical cancer. Immune cell pathways, such as NK cell-based, may be important in increasing the risk of cervical cancer in RA patients. The abnormal expression of the model gene may be involved in the progression of cervical cancer patients and the impact of immunotherapy.",
    "authors": [
      "Xifeng Xu",
      "Yujie Huang",
      "Wu Wei",
      "Zhong Lin",
      "Yongjin Luo",
      "Kaiyi Meng"
    ],
    "pub_date": "2025-May-29",
    "pmid": "40439976"
  },
  {
    "title": "TEIPP-vaccination in checkpoint-resistant non-small cell lung cancer: a first-in-human phase I/II dose-escalation study.",
    "abstract": "Functional loss of the intracellular peptide Transporter associated with Antigen Processing (TAP) fosters resistance to T-cell based immunotherapy. We discovered the presentation of an alternative set of shared tumor antigens on such escaped cancers and developed a LRPAP1 synthetic long peptide vaccine (TEIPP24) to stimulate T-cell immunity. In this first-in-human multicenter dose-escalation study with extension cohort, HLA-A*0201-positive patients with non-small cell lung cancer progressive after checkpoint blockade were treated with TEIPP24 (NCT05898763). Dose escalation followed an adapted 3 + 3 scheme where in each cohort six patients received the TEIPP24 peptide emulsified in Montanide ISA-51 at either 20, 40, 100 µg of peptide, subcutaneously injected three times every three weeks in alternating limbs. The extension cohort of six patients received the highest safe dose of TEIPP24 combined with the PD-1 checkpoint blocker pembrolizumab. The primary objectives of the study were safety, tolerability and immunogenicity of the TEIPP24 vaccine. Secondary objectives included the evaluation of specificity and immune modulatory effects of the vaccine, antigen and immune status of the patients, progression free (PFS) and overall survival (OS) and radiological tumor response rate and duration. A total of 26 patients were enrolled across 2 institutions. Treatment was well tolerated, and vaccine-induced LRPAP1-specific CD8",
    "authors": [
      "Mitchell Emmers",
      "Marij J P Welters",
      "Michelle V Dietz",
      "Saskia J Santegoets",
      "Sanne Boekesteijn",
      "Anouk Stolk",
      "Nikki M Loof",
      "Daphne W Dumoulin",
      "Annemarie L Geel",
      "Lauri C Steinbusch",
      "A Rob P M Valentijn",
      "Danielle Cohen",
      "Noel F C C de Miranda",
      "Egbert F Smit",
      "Hans Gelderblom",
      "Thorbald van Hall",
      "Joachim G Aerts",
      "Sjoerd H van der Burg"
    ],
    "pub_date": "2025-May-28",
    "pmid": "40436854"
  },
  {
    "title": "Systemic delivery of cadherin 17-specific CAR T cells allows effective and safe targeting of colorectal cancer liver metastases.",
    "abstract": "Liver metastases represent the leading cause of death in patients with colorectal cancer (CRC). Chimeric antigen receptor (CAR) T cell therapy holds promise in this context, but any effort to bring it to the bedside requires careful antigen selection and testing in clinically relevant models. Here, we identified cadherin-17 (CDH17) as a candidate antigen for CAR T cell therapy of CRC liver metastases. We hence designed human CDH17 CARs differing in antigen binding and extracellular spacer regions and compared the different constructs in preclinical models of antitumor efficacy, cytokine release syndrome, and on-target off-tumor toxicity. Whereas the binding domains differed in efficacy in vitro, the spacer region shaped the kinetics of the CAR T cells in vivo. When used in a CRC liver xenograft model, CDH17 CAR T cells efficiently suppressed tumor growth upon either systemic or locoregional administration. However, when tested in mice reconstituted with a human immune system, CAR T cells injected locally caused a particularly harsh cytokine release syndrome. Confocal microscopy revealed that CDH17 is exposed on the entire surface of tumor cells, whereas its expression in healthy colon is restricted to lateral junctions between epithelial cells. Accordingly, CDH17 CAR T cells showed dose-dependent cytokine release in response to CRC tissue slices while displaying no reaction against healthy colon tissue samples. Overall, these findings support systemic delivery of CDH17 CAR T cells as a safe and effective approach to treat CRC liver metastases and pave the way for a phase 1/2 clinical trial.",
    "authors": [
      "Beatrice Greco",
      "Rita El Khoury",
      "Chiara Balestrieri",
      "Camilla Sirini",
      "Alice Machado",
      "Federica De Girardi",
      "Laura De Rossi",
      "Oronza Antonietta Botrugno",
      "Giulio Giovannoni",
      "Laura Falcone",
      "Barbara Camisa",
      "Elena Tiziano",
      "Katia Palmisano",
      "Edoardo Campodonico",
      "Marta Angiola Moresco",
      "Laura Perani",
      "Alice Bergamini",
      "Amanda Facoetti",
      "Federica Ungaro",
      "Giovanni Tonon",
      "Emmanuel Donnadieu",
      "Claudio Doglioni",
      "Fabio Ciceri",
      "Chiara Bonini",
      "Monica Casucci"
    ],
    "pub_date": "2025-May-28",
    "pmid": "40435215"
  },
  {
    "title": "Impact of maintenance treatment on male gonadal function in patients treated for localized rhabdomyosarcoma in RMS2005 trial in France.",
    "abstract": "Maintenance treatment with vinorelbine and oral cyclophosphamide (oral-CPM) improves outcome of nonmetastatic high-risk (HR) and very-high risk (VHR) rhabdomyosarcoma (RMS) patients. However, gonadal toxicity of maintenance was not yet investigated. The authors focused their analysis on male gonadal toxicity in HR/VHR groups of RMS2005 trial, in France. In the HR group, patients were randomized to receive or not receive 6 months of maintenance (after nine or four IVADo] + five IVA). In the VHR group, patients received 6 months of maintenance (after four IVADo + five IVA). Exocrine gonadal dysfunction (EGD) was defined as followed: follicle-stimulating hormone level >10 IU/L and/or inhibin-B <80 pg/mL and/or oligoasthenozoospermia/azoospermia. Among 86 eligible 5-year RMS survivors ≥12 years old, 49 had available gonadal evaluation (median age at diagnosis = 6.4 years, median age at evaluation =  18.7 years, 41 HR/8 VHR). Twenty-six (53%) received oral-CPM (median cumulative dose = 4.2 g/m Oral-CPM induces additional gonadal damage to the ifosfamide-based induction regimen. Fertility preservation could be considered in patients exposed to maintenance, especially those >5 years old and exposed to ≥12 months of oral-CPM.",
    "authors": [
      "Lea Rossillon",
      "Cécile Thomas-Teinturier",
      "Daniel Orbach",
      "Marie-Dominique Tabone",
      "Amandine Bertrand",
      "Sophie Ansoborlo",
      "Anne-Sophie Defachelles",
      "Angelique Rome",
      "Stéphanie Haouy",
      "Dominique Plantaz",
      "Stéphanie Bolle",
      "Valérie Bernier-Chastagner",
      "Florent Guerin",
      "Sabine Sarnacki",
      "Pascale Philippe-Chomette",
      "Rodrigue Allodji",
      "Laura Lenez",
      "Lucy Métayer",
      "Virginie Barraud-Lange",
      "Véronique Minard-Colin",
      "Brice Fresneau"
    ],
    "pub_date": "2025-Jun-01",
    "pmid": "40433871"
  },
  {
    "title": "The promise of PD1/PDL1 targeted immunotherapy in locally advanced cervical cancer: a game-changer for patients outcome?",
    "abstract": "Locally advanced cervical cancer remains a significant therapeutic challenge, with high rates of recurrence and metastasis despite advances in chemoradiation. Immunotherapy, particularly immune checkpoint inhibitors targeting the PD-1/PD-L1 axis, has emerged as a promising strategy to enhance treatment efficacy. This review explores the integration of immunotherapy with standard chemoradiation, highlighting the potential of PD-1 inhibitors, such as pembrolizumab, in improving progression-free survival (PFS) among high-risk patients. Furthermore, the role of predictive biomarkers, including microsatellite instability (MSI) and tumor mutational burden (TMB), is examined to refine patient selection and personalize therapeutic approaches. Emerging strategies, including the use of nivolumab, ipilimumab, and maintenance immunotherapy, are also discussed. While preliminary clinical data are encouraging, further research is required to optimize treatment combinations, establish robust patient selection criteria, and enhance long-term outcomes in cervical cancer management.",
    "authors": [
      "Fadila Kouhen",
      "Adil El Ghanmi",
      "Hanane Inghaoun",
      "Hayat Miftah",
      "Bouchra Ghazi",
      "Abdallah Badou"
    ],
    "pub_date": "2025--",
    "pmid": "40433369"
  },
  {
    "title": "Assessment of biophysical properties of the first-in-class anti-cancer IgE antibody drug MOv18 IgE demonstrates monomeric purity and stability.",
    "abstract": "Therapeutic monoclonal antibodies, which are almost exclusively IgG isotypes, show significant promise but are prone to poor solution stability, including aggregation and elevated solution viscosity at dose-relevant concentrations. Recombinant IgE antibodies are emerging cancer immunotherapies. The first-in-class MOv18 IgE, recognizing the cancer-associated antigen folate receptor-alpha (FRα), completed a Phase 1 clinical trial in patients with solid tumors, showing early signs of efficacy at a low dose. The inaugural process development and scaled manufacture of MOv18 IgE for clinical testing were undertaken with little baseline knowledge about the solution phase behavior of recombinant IgE at dose-relevant concentrations. We evaluated MOv18 IgE physical stability in response to environmental and formulation stresses encountered throughout shelf life. We analyzed changes in physical stability using multiple orthogonal analytical techniques, including particle tracking analysis, size exclusion chromatography, and multidetector flow field flow fractionation hyphenated with UV. We used dynamic and multiangle light scattering to profile aggregation status. Formulation at pH 6.5, selected for use in the Phase 1 trial, resulted in high monomeric purity and no submicron proteinaceous particulates. Formulation at pH 5.5 and 7.5 induced significant submicron and sub-visible particle formation. IgE formulation was resistant to aggregation in response to freeze-thaw stress, retaining high monomeric purity. Exposure to thermal stress at elevated temperatures resulted in loss of monomeric purity and aggregation. Agitation stress-induced submicron and subvisible aggregation, but monomeric purity was not significantly affected. MOv18 IgE retains monomeric purity in response to formulation and stress conditions, confirming stability. Our results offer crucial guidance for future IgE-based drug development.",
    "authors": [
      "Paul Considine",
      "Panida Punnabhum",
      "Callum G Davidson",
      "Georgina B Armstrong",
      "Michaela Kreiner",
      "Heather J Bax",
      "Jitesh Chauhan",
      "James Spicer",
      "Debra H Josephs",
      "Sophia N Karagiannis",
      "Gavin Halbert",
      "Zahra Rattray"
    ],
    "pub_date": "2025-Dec-",
    "pmid": "40432600"
  },
  {
    "title": "Cemiplimab in the treatment of metastatic basal cell carcinoma.",
    "abstract": "Metastatic basal cell carcinoma (mBCC) is a rare but aggressive form of skin cancer that poses significant therapeutic challenges. Historically, systemic treatment options were limited, with hedgehog pathway inhibitors (HHIs) providing modest efficacy, but poor tolerability long term. This review explores cemiplimab, an immune checkpoint inhibitor targeting PD-1, as a novel therapeutic agent for mBCC. We examine its pharmacologic profile, clinical efficacy in clinical trials, safety and tolerability, and real-world performance. A comprehensive literature review was conducted using PubMed and clinical trial registries to assess cemiplimab's role in mBCC treatment, including its comparison to HHIs and potential in combination or neoadjuvant strategies. Cemiplimab has emerged as a transformative therapy for patients with mBCC who are intolerant to or have progressed on HHIs. Despite lower response rates compared to cutaneous squamous cell carcinoma, cemiplimab offers meaningful and durable disease control with a favorable safety profile and preservation of quality of life. Ongoing research into predictive biomarkers, neoadjuvant use, and combination regimens may further enhance its clinical utility.",
    "authors": [
      "Monika Bapna",
      "Emily Ruiz"
    ],
    "pub_date": "2025-May-27",
    "pmid": "40432222"
  },
  {
    "title": "Update: Immunotherapeutic Strategies in HPV-Associated Head and Neck Squamous Cell Carcinoma.",
    "abstract": "The incidence of human papillomavirus (HPV)-associated oropharyngeal squamous cell carcinoma (OPSCC) has increased substantially over the past three decades, and since 2017, it has been recognized in the AJCC staging system as distinct from its HPV-negative counterpart. The underlying mechanisms of HPV-associated carcinogenesis, tumor microenvironment, and host immune response represent opportunities for therapeutic development. While anti-PD-1 immunotherapy is now part of standard treatment for recurrent or metastatic head and neck squamous cell carcinoma (HNSCC) in general, there are no established immunotherapeutic strategies specifically for HPV-related HNSCC. In this context, multiple emerging approaches are being actively studied-among these are therapeutic vaccines with or without anti-PD-(L)1 adjuvants, peptide-HLA-based immunotherapeutic platforms, and adoptive cell therapies including tumor-infiltrating lymphocytes (TILs), T-cell receptor (TCR) therapy, and chimeric antigen receptor (CAR) T-cell therapy. Beyond further maturation of these novel immunotherapeutic strategies, additional work is needed to delineate the optimal disease state of application (localized versus recurrent/metastatic), as well as in the development of small molecule inhibitors targeting HPV-specific mechanisms of viral oncogenesis.",
    "authors": [
      "Fangdi Sun",
      "A Dimitrios Colevas"
    ],
    "pub_date": "2025-May-16",
    "pmid": "40431723"
  },
  {
    "title": "Integrative Analysis of Immune- and Metabolism-Related Genes Identifies Robust Prognostic Signature and PYCR1 as a Carcinogenic Regulator in Clear Cell Renal Cell Carcinoma.",
    "abstract": "Clear cell renal cell carcinoma (ccRCC) is distinguished by metabolic irregularities and unique immunological profiles. Nevertheless, the comprehensive examination of immune and metabolic attributes within the tumor microenvironment of ccRCC remains inadequately elucidated. In this study, we identified two distinct molecular subtypes (C1 and C2) of ccRCC using the non-negative matrix factorization (NMF) algorithm. Utilizing univariate and least absolute shrinkage and selection operator (LASSO) Cox regression analyses, we developed a prognostic signature comprising eight immune- and metabolism-related genes (IMRGs) associated with the tumor microenvironment. The validation of this signature was performed using both testing and entire datasets. A nomogram was developed using IMRGs prognostic signature and various clinical parameters, including age and TNM stage. We also performed the in vitro experiments to validate the carcinogenic role of PYCR1 in ccRCC cells. Subtype C1 exhibited a more favorable prognosis and higher levels of immune cell infiltration compared to subtype C2. The AUCs of the nomogram at 1-, 3-, and 5-year intervals (AUC = 0.874, 0.820, and 0.794) were slightly higher than those of the IMRGs signature alone (AUC = 0.773, 0.755, and 0.764). The association between risk score and immune checkpoint expressions, immunophenoscore (IPS), and microsatellite instability (MSI) collectively predicted treatment efficacy accurately. Additionally, in vitro experiments confirmed the involvement of ",
    "authors": [
      "Guo Zhao",
      "Jiatong Ding",
      "Jiaxiu Ma",
      "Yale Jiang",
      "Yuning Wang",
      "Shuhang Wang",
      "Ning Li"
    ],
    "pub_date": "2025-May-21",
    "pmid": "40430095"
  },
  {
    "title": "Mechanisms and Therapeutic Strategies for Endocrine Resistance in Breast Cancer: A Comprehensive Review and Meta-Analysis.",
    "abstract": "",
    "authors": [
      "Asiya Khan",
      "Sandeep Sisodiya",
      "Mehreen Aftab",
      "Pranay Tanwar",
      "Showket Hussain",
      "Vivek Gupta"
    ],
    "pub_date": "2025-May-14",
    "pmid": "40427153"
  },
  {
    "title": "Efficacy and safety of third-generation CD19-CAR T cells incorporating CD28 and TLR2 intracellular domains for B-cell malignancies with central nervous system involvement: results of a pivotal trial.",
    "abstract": "Third‑generation CAR-T cells demonstrated promising efficacy and remarkably low toxicity in refractory or relapsed (R/R) B-cell malignancies. However, data on the patients with central nervous system (CNS) involvement are limited due to concerns regarding treatment-related neurotoxicity. This study aimed to evaluate the safety and efficacy of a novel third-generation anti-CD19 CAR T cells in patients with CNS involvement of B-cell malignancies. A total of 21 patients with R/R B-cell malignancies with CNS involvement, including 11 with B-cell acute lymphoblastic leukemia (B-ALL) and 10 with B-cell non-Hodgkin lymphoma (B-NHL) were enrolled. Patients derived lymphocytes were collected through apheresis and lentivirally transduced with the third-generation CAR incorporating both CD28 co-stimulation and TLR2-derived stimulatory domains (1928zT2). Patients received a single-dose 1928zT2 CAR-T cell infusion following lymphodepleting regimen. Safety, efficacy and cellular pharmacokinetics were investigated. Of the 21 patients with CNS involvement, the overall response rate (ORR) was 71% (15/21), with 73% (8/11) in B-ALL and 70% (7/10) in B-NHL. At a median follow-up of 20.4 months, median duration of response (DOR) was 11.1 months (95% CI, 2.9-24.4). 12-months progression-free survival (PFS) and overall survival (OS) estimates were 41.5% and 61.2%, respectively. Cytokine release syndrome (CRS) of any grade occurred in 20 patients (95%; grade ≥ 3 in 3 patients). Immune effector cell-associated neurotoxicity syndrome (ICANS) occurred in 9 patients (42.8%; grade ≥ 3 in 6 patients). All CRS and ICANS events were manageable. The outcomes and adverse events are comparable between B-ALL and B-NHL patients. Notably, 1928zT2 CAR-T cells demonstrated blood-brain barrier penetrance, with subsequent detection in patient cerebrospinal fluid (CSF) correlating significantly with improved clinical outcomes. Third-generation 1928zT2 CAR-T cells are associated with high response rates, manageable safety and durable remissions in R/R B-cell malignancies with CNS involvement. ClinicalTrials.gov, NCT04605666. Registered 1 May 2020.",
    "authors": [
      "Bailin He",
      "Ren Lin",
      "Na Xu",
      "Le Qin",
      "Zhixiang Wang",
      "Qiang Wang",
      "Xiaofang Li",
      "Xiaolei Wei",
      "Yongqiang Wei",
      "Zhaoyang Tang",
      "Zhiping Fan",
      "Fen Huang",
      "Xiaoli Liu",
      "Jing Sun",
      "Li Xuan",
      "Peng Li",
      "Hongsheng Zhou",
      "Qifa Liu"
    ],
    "pub_date": "2025-May-27",
    "pmid": "40426201"
  },
  {
    "title": "The safety and feasibility of multiple intrathecal injections of allogenic NK cells in pediatrics with refractory/recurrent brain tumors.",
    "abstract": "Pediatric glioma is a rare condition that can lead to significant mortality and morbidity due to its high recurrence rate. This study is a phase I nonrandomized clinical trial that was conducted to assess the safety, feasibility, and potential efficacy of the intrathecal (IT) injection of multiple doses of allogenic NK cells in pediatric patients with refractory/recurrent gliomas. Allogeneic NK cells were isolated from random healthy unrelated donors via positive selection of CD56 + cells. Nine patients were selected according to the inclusion criteria and received weekly doses of up to 10 doses of 5 × 10 Multiple intrathecal injections of allogeneic NK cells in pediatric gliomas were safe, without any serious adverse events (SAEs). The most prevalent AEs were headache [29% (17% grade 1 and 13% grade 2)], fever and chills [21% (17% grade 1 and 4% grade 2)], vomiting [13% grade 2], and back pain [12% (4% grade 1 and 8% grade 2)]. 18 months of follow-up, among the five patients in the intervention group who were still alive (August 7, 2024), three exhibited stable disease (SD), one had progressive disease (PD), and one experienced a partial response (PR) with a reduction in tumor size. Among the four deceased patients, two died due to tumor progression, and two died due to infections. In the retrospective control group, five out of six patients developed PD and leptomeningeal spread (LMS), four of whom died, and one patient showed radiological evidence of a complete response (CR). Cerebrospinal fluid (CSF) analysis revealed increases in the percentages of NK and T cells and significant reductions in the levels of IFN-γ and TNF-α. Multiple intrathecal injections of allogeneic NK cells are safe and feasible in pediatric patients with refractory/recurrent gliomas. Although we reported a reduction in recurrence episodes and an increase in overall survival, further studies with extended follow-up periods and appropriate control groups are necessary to assess the efficacy of NK cell therapy in these patients. The trial was registered on the Iranian Registry of Clinical Trials (IRCT20170122032121N6), Date 2021-11-19.",
    "authors": [
      "Hamid Mahdizadeh",
      "Amirhossein Izadpanah",
      "Yasaman Nouri",
      "Parisa Shams",
      "Delbar Daneshjou",
      "Alireza Aziz Ahari",
      "Alireza Tabibkhooei",
      "Hamidreza Haghighatkhah",
      "Massoud Vosough",
      "Pooya Faranoush",
      "Masoumeh Azimi",
      "Saba Yousefi",
      "Atefeh Barzegari",
      "Alireza Khosravani",
      "Niloufar Shayan Asl",
      "Mohammad Faranoush",
      "Marzieh Ebrahimi"
    ],
    "pub_date": "2025-May-27",
    "pmid": "40426086"
  },
  {
    "title": "Multiplex base editing to protect from CD33 directed drugs for immune and gene therapy.",
    "abstract": "The selection of genetically engineered immune or hematopoietic cells in vivo after gene editing remains a clinical problem and requires a method to spare on-target toxicity to normal cells. Here, we develop a base editing approach exploiting a naturally occurring CD33 single nucleotide polymorphism leading to removal of full-length CD33 surface expression on edited cells. CD33 editing in human and nonhuman primate hematopoietic stem and progenitor cells protects myeloid progeny from CD33-targeted therapeutics without affecting normal hematopoiesis in vivo, thus demonstrating potential for improved immunotherapies with reduced off-leukemia toxicity. For broader application to gene therapies, we demonstrate highly efficient (>70%) multiplexed adenine base editing of the CD33 and gamma globin genes, resulting in long-term persistence of dual gene-edited cells with HbF reactivation in nonhuman primates. Using the CD33 antibody-drug conjugate Gemtuzumab Ozogamicin, we show resistance of engrafted, multiplex edited human cells in vivo, and a 2-fold enrichment for edited cells in vitro. Together, our results highlight the potential of adenine base editors for improved immune and gene therapies.",
    "authors": [
      "Florence Borot",
      "Olivier Humbert",
      "Jeffrey T Ehmsen",
      "Emily Fields",
      "Sajeev Kohli",
      "Stefan Radtke",
      "Kyle Swing",
      "Dnyanada Pande",
      "Mark R Enstrom",
      "George S Laszlo",
      "Thiyagaraj Mayuranathan",
      "Abdullah Mahmood Ali",
      "Mitchell J Weiss",
      "Jonathan S Yen",
      "Gregory A Newby",
      "Roland B Walter",
      "David R Liu",
      "Siddhartha Mukherjee",
      "Hans-Peter Kiem"
    ],
    "pub_date": "2025-May-27",
    "pmid": "40425554"
  },
  {
    "title": "De-escalating first-line treatment in stage IVB or recurrent cervical cancer: outcomes of immunotherapy alone and systemic review.",
    "abstract": "Chemo-immunotherapy (IO) is the preferred first-line treatment for stage IVB or recurrent cervical cancer. However, limited data exist on the efficacy and safety of using IO-alone as a de-escalation strategy. We report outcomes from a case series of selected patients treated with IO-alone and review the feasibility of de-escalating first-line treatment. The authors conducted a literature review using Google Scholar and PubMed to identify reports using IO-alone as a de-escalation strategy across malignancies published between 1999 and December 2024 and also reviewed a cervical cancer database from a tertiary academic to identify patients with stage IVB or recurrent disease treated with IO-alone. The authors used the Kaplan-Meier method to estimate progression-free survival (PFS) and overall survival (OS). Among 582 patients treated between 2015 and 2021, 18 met the inclusion criteria. The median age was 43 years (range 28-84); 67% had squamous cell carcinoma, 11% adenocarcinoma, and 80% expressed PD-L1. CPS scores were <1 in 20%, 1--10 in 33%, and >10 in 47%. Most patients had oligo-metastatic disease (83%). Treatment with IO-alone began a median of 7 months after platinum-based chemotherapy. Indications included prior adjuvant (44%) or neoadjuvant (22%) chemotherapy, clinical trial participation (11%), or patient preference (22%). Median PFS and OS were 27 months and 82 months, respectively. These findings support the need for clinical trials evaluating IO-alone as a first-line treatment option for de-escalation in stage IVB or recurrent cervical cancer. Biomarker development is needed to better identify candidates for personalized therapy.",
    "authors": [
      "Akram Saad",
      "Alexandra Taylor",
      "Shira Felder",
      "Limor Helpman",
      "Smadar Bauer",
      "Ronnie Shapira",
      "Keren Levanon",
      "Jacob Korach",
      "Ronza Atamneh",
      "Samantha Breslauer",
      "Jeffrey Goldstein",
      "Shira Peleg Hasson"
    ],
    "pub_date": "2025-May-08",
    "pmid": "40421960"
  },
  {
    "title": "E-VIRTUE: a study of enfortumab vedotin with or without pembrolizumab in rare genitourinary tumors-design and rationale.",
    "abstract": "NCT06041503 (ClinicalTrials.gov).",
    "authors": [
      "Elias B A Chandran",
      "Saad Atiq",
      "Nicholas Simon",
      "Daniel Girardi",
      "Lisa Ley",
      "Lisa Cordes",
      "Ruchi Patel",
      "Tzu-Fang Wang",
      "Andre R Kydd",
      "Bernadette Redd",
      "Salah Boudjadi",
      "Ian Stukes",
      "Rouf Banday",
      "Elizabeth Smith",
      "Dilara Akbulut",
      "Scot Niglio",
      "Sandeep Gurram",
      "Seth Steinberg",
      "Andrea B Apolo"
    ],
    "pub_date": "2025-Jun-",
    "pmid": "40421891"
  },
  {
    "title": "Pathological complete response and prognostic predictive factors of neoadjuvant chemoimmunotherapy in early stage triple-negative breast cancer.",
    "abstract": "Neoadjuvant chemoimmunotherapy (nCIT) has shown promise in treating early-stage triple-negative breast cancer (eTNBC), but predictive biomarkers for pathological response and prognosis remain poorly defined. This study aimed to explore pathological complete response and prognostic predictive factors in eTNBC patients treated with nCIT. We retrospectively analyzed 112 eTNBC patients who underwent surgery after nCIT at Sun Yat-sen University Cancer Center between June 2019 and June 2023. Pathological response was assessed using Miller-Payne grade. Clinicopathological features and hematologic markers were analyzed with univariate and multivariate logistic regression or Cox regression, as well as Kaplan-Meier survival curves. Objective response rate (ORR), pathological complete response (pCR), and disease-free survival (DFS) were evaluated. Nomograms predicting pCR and DFS were constructed based on significant risk factors and the systemic inflammatory response index (SIRI). Higher baseline lymphocyte counts ( Hematologic inflammatory markers, particularly SIRI, are cost-effective and reliable predictors of prognosis and treatment efficacy in eTNBC patients undergoing nCIT, helping clinicians develop personalized treatment strategies. https://www.medicalresearch.org.cn/, identifier MR-44-24-046099.",
    "authors": [
      "Xuwei Chen",
      "Hengming Ye",
      "Daming Xu",
      "Siqi Chen",
      "Wei Wu",
      "Xiaoyu Qian",
      "Xinyu Zhang",
      "Xuxiazi Zou",
      "Junquan Chen",
      "Xi Wang"
    ],
    "pub_date": "2025--",
    "pmid": "40421023"
  },
  {
    "title": "Sintilimab + Nab-PP Combined with Recombinant Human Vascular Endothelial Inhibitor for Locally Advanced/Advanced and Recurrent Metastatic Squamous Non-Small Cell Lung Cancer: Study Protocol for a Single-Arm, Multi-Centre Phase II Clinical Study.",
    "abstract": "BackgroundSquamous non-small cell lung cancer (sq-NSCLC) remains a major cause of cancer-related mortality in world. While immunotherapy combined with chemotherapy has improved outcomes, response rates and survival remain suboptimal. Anti-angiogenic agents, such as recombinant human vascular endothelial inhibitor (endostar), may enhance the efficacy of immune checkpoint inhibitors (ICIs) by modulating the tumor microenvironment. This phase II trial evaluates the combination of endostar, sintilimab, and chemotherapy in advanced sq-NSCLC.ObjectiveTo assess the efficacy and safety of endostar combined with sintilimab and chemotherapy in patients with advanced sq-NSCLC, focusing on progression-free survival (PFS) as the primary endpoint. Secondary endpoints include overall survival (OS), duration of response (DoR), disease control rate (DCR), and safety. Exploratory analyses will investigate biomarkers and quality of life.MethodsThis prospective, single-arm, multicenter phase II trial (NCT06746179) will enroll 64 patients with advanced sq-NSCLC (stage IIIB-IV) and negative driver gene mutations. Patients will receive endostar (210 mg/dose, 72 h), sintilimab (200 mg/dose), and chemotherapy (nab-pp, carboplatin/cisplatin + albumin-bound paclitaxel) every 3 weeks for up to 6 cycles, followed by maintenance therapy until progression or intolerable toxicity. Radiological assessments will occur every 8 weeks initially, then every 12 weeks. Biomarker analysis and quality of life assessments will be performed.",
    "authors": [
      "Junzhu Xu",
      "Mi Meng",
      "Sisi He",
      "Shixiang Wang",
      "Jie Peng",
      "Biao Yao",
      "Yi Li",
      "Yong Hu",
      "Xiaobin Qian",
      "Tianwu Wang",
      "Hu Ma",
      "Jian-Guo Zhou"
    ],
    "pub_date": "2025--",
    "pmid": "40415559"
  },
  {
    "title": "Efficacy, safety and exploratory analysis of neoadjuvant tislelizumab (a PD-1 inhibitor) plus nab-paclitaxel followed by epirubicin/cyclophosphamide for triple-negative breast cancer: a phase 2 TREND trial.",
    "abstract": "The optimal chemotherapy backbone and specific population of triple-negative breast cancer (TNBC) patients that benefit from neoadjuvant immunotherapy are not well established. This prospective, single-arm, phase II TREND trial assessed the efficacy and safety of tislelizumab plus nab-paclitaxel and epirubicin/cyclophosphamide-based chemotherapy as a neoadjuvant treatment for TNBC (ChiCTR2000035262). The primary endpoint was pathological complete response (pCR), with the secondary endpoints including safety assessment and objective response rate (ORR). ScRNA-seq, bulk RNA-seq, TCR-seq, cyTOF and WES were performed on pre-treatment and post-treatment samples. Among 53 total enrolled patients, 44 completed the combined neoadjuvant therapy, and 30 of 44 patients (68.18%) achieved pCR. Additionally, 14 out of 44 patients had a complete response (31.82%), with an ORR of 93.18%. The most commonly observed treatment-related adverse events (TRAEs) were alopecia, nausea and liver injury with 6 cases classified as grade 3 or higher adverse events. Immune response-related pathways, including TNF signaling pathway, T cell receptor signaling pathway, were enriched in pCR group. Pre-treatment model was identified and construct to predict response to immunotherapy. CDKN1A+ CD8 T lymphocytes were enriched in pCR group after neoadjuvant immunotherapy. Dynamic change of immune-related pathways at an early stage during the neoadjuvant immunotherapy may be associated with the treatment efficacy. In conclusion, neoadjuvant treatment of tislelizumab with nab-paclitaxel and anthracycline-based chemotherapy showed promising clinical activity and was well-tolerated among TNBC patients, without high incidence of TRAEs. These findings provide evidence supporting neoadjuvant tislelizumab with chemotherapy as an effective rational approach for treating TNBC.",
    "authors": [
      "Qiang Zhang",
      "Mozhi Wang",
      "Yumeng Li",
      "Hengjun Zhang",
      "Yusong Wang",
      "Xiuyun Chen",
      "Litong Yao",
      "Mingke Cui",
      "Haoran Dong",
      "Xiang Li",
      "Jian Liu",
      "Bo Zhu",
      "Yingying Xu"
    ],
    "pub_date": "2025-May-26",
    "pmid": "40414961"
  },
  {
    "title": "Efficacy and safety of combining tislelizumab with capecitabine compared to capecitabine alone in the adjuvant treatment of biliary tract cancers: rationale and protocol design for a randomized clinical trial.",
    "abstract": "Adjuvant therapy with capecitabine is recommended to improve survival for resectable biliary tract cancers (BTC) patients. Considering that the combination of PD-1/PD-L1 inhibitors with chemotherapy has demonstrated a survival benefit over chemotherapy alone in advanced stage BTC, we aim to evaluate the treatment efficacy and safety of tislelizumab, a PD-1 inhibitor, combined with capecitabine vs. capecitabine alone as an adjuvant treatment in patients with resectable BTC. This multicenter randomized controlled study will include a total of 140 patients who will have undergone curative resection within 4 weeks prior to enrollment and will have been pathologically diagnosed with cholangiocarcinoma (including intrahepatic and extrahepatic cholangiocarcinoma) or muscle-invasive gallbladder carcinoma. Those patients will be randomly assigned 1:1 to tislelizumab combined with capecitabine or capecitabine alone group. The primary endpoint will be recurrence free survival (RFS), the secondary endpoints will be overall survival (OS) and adverse events (AEs). Multi-omics biomarkers will be assessed as exploratory objective. There remains a major unmet need for more effective adjuvant therapies for resectable BTC. If this study demonstrates that adding tislelizumab enhances the therapeutic efficacy of capecitabine, this combined regimen will potentially improve the prognosis of patients with resectable BTC. In addition, we will analyze the relationship between various gene expression profiles and clinical endpoint events to define the ideal patient population receiving adjuvant immunotherapy.",
    "authors": [
      "Xubiao Wei",
      "Yabo Jiang",
      "Jinxue Zhou",
      "Hongkun Zhou",
      "Dong Qu",
      "Xiaofei Ye",
      "Yaxin Zheng",
      "Shuqun Cheng"
    ],
    "pub_date": "2025-May-25",
    "pmid": "40414848"
  },
  {
    "title": "Avelumab-based neoadjuvant therapy in patients with muscle-invasive bladder cancer (AURA Oncodistinct-004): a phase 2 multicenter clinical trial.",
    "abstract": "Immunotherapy is becoming a standard of care for non-metastatic muscle-invasive bladder cancer (MIBC). The optimal chemotherapy partner for chemo-immunotherapy combinations remains unknown. We evaluated the efficacy and safety of neoadjuvant avelumab-based regimens in patients with MIBC. The multicenter phase 2 AURA trial (NCT03674424) enrolled patients with non-metastatic MIBC undergoing radical cystectomy. Cisplatin-eligible patients were randomized to receive avelumab with either dose-dense methotrexate-vinblastine-doxorubicin-cisplatin (ddMVAC-A) or gemcitabine-cisplatin (GC-A). Cisplatin-ineligible patients received either avelumab alone (A) or combined with paclitaxel-gemcitabine (PG-A). The primary endpoint was pathological complete response (pCR). Secondary endpoints included safety, event-free survival, and overall survival (OS). Between July 2018 and September 2021, 137 eligible patients were enrolled in the trial. In the cisplatin-eligible cohort (n=79), pCR rates were 58% (95% CI: 42% to 72%) in the ddMVAC-A arm and 53% (95% CI: 37% to 68%) in the GC-A arm. The 36-month OS rates were 87% (95% CI: 76% to 98%) for ddMVAC-A and 67% (95% CI: 53% to 84%) for GC-A. In the cisplatin-ineligible cohort (n=58), pCR rates were 14% (95% CI: 6% to 31%) in the PG-A arm and 32% (95% CI: 18% to 51%) in the A arm. The 36-month OS rates were 48% (95% CI: 33% to 71%) for PG-A and 42% (95% CI: 27% to 65%) for A. Overall, 51 (38%) patients experienced grade 3-4 treatment-related adverse events. Avelumab combined with cisplatin-based neoadjuvant chemotherapy showed promising efficacy in MIBC with a favorable safety profile, also with the ddMVAC regimen. Among cisplatin-ineligible patients, avelumab monotherapy showed encouraging activity, with no additional benefit observed from the PG-A regimen. These results support the use of the ddMVAC regimen as a potential chemotherapy partner for neoadjuvant chemo-immunotherapy combinations in future phase 3 trials, providing an alternative to the GC regimen currently under investigation. NCT03674424.",
    "authors": [
      "Jérémy Blanc",
      "Aurélien Carnot",
      "Philippe Barthélémy",
      "Vinciane Casert",
      "Brieuc Sautois",
      "Jan Van den Brande",
      "Vincent Vanhaudenarde",
      "Lionel Staudacher",
      "Emmanuel Seront",
      "Veronique Debien",
      "Lieveke Ameye",
      "Nuria Kotecki",
      "Françoise Rothé",
      "Sandrine Rorive",
      "Jean-Christophe Fantoni",
      "Thibault Tricard",
      "Thierry Roumeguère",
      "Ahmad Awada",
      "Nieves Martinez Chanza"
    ],
    "pub_date": "2025-May-24",
    "pmid": "40413024"
  },
  {
    "title": "Tislelizumab as adjuvant therapy following endoscopic surgery for resectable recurrent nasopharyngeal carcinoma: a randomized clinical trial.",
    "abstract": "Endoscopic surgery has become the first-line treatment for surgically resectable recurrent nasopharyngeal carcinoma (rNPC), but it is associated with a high risk of postoperative tumor progression. Currently, there is a lack of effective and well-tolerated adjuvant treatment regimens. Thus, the primary objective was to investigate the efficacy and safety of tislelizumab as adjuvant therapy with endoscopic surgery for the treatment of patients with rNPC. This was a single-center, open-label, randomized, controlled, phase 2 trial between November 23, 2021, and May 8, 2024. Eligible patients included those with complete tumor disappearance as indicated by postoperative imaging, histopathologically diagnosed with undifferentiated or differentiated non-keratinizing rNPC. Patients with rNPC were randomized to receive endoscopic surgery alone or adjuvant tislelizumab treatment 2-6 weeks after endoscopic surgery. Tislelizumab was administered as a 200 mg intravenous infusion every 3 weeks until disease progression, death, unacceptable toxicity, withdrawal of consent, investigator's decision, or 1 year. The primary endpoint was progression-free survival (PFS) at 1 year, and secondary endpoints included 1-year progression-free interval (PFI), 1-year overall survival (OS), and safety. The trial is ongoing. 42 patients were enrolled at a median follow-up of 18 months (IQR 10-27), the 1-year PFS was significantly higher in the tislelizumab group (94%, 95% CI: 83% to 100%) than in the endoscopic surgery alone group (57%, 95% CI: 38% to 85%). The 1-year PFI was also higher in the tislelizumab group (100%, 95% CI: 100% to 100%) than in the endoscopic surgery alone group (60%, 95% CI: 40% to 89%). No significant difference in the 1-year OS was observed at the data cut-off. Grade ≥3 immune-related adverse events (irAEs) occurred in 9% of tislelizumab recipients, and all of these events were elevated blood creatine phosphokinase levels. Additionally, the most common irAEs in this group were hypothyroidism, affecting 27%, and pruritus, observed in 9%. Tislelizumab as adjuvant therapy significantly enhanced PFS and PFI, with a favorable safety profile. Longer follow-up is necessary to determine whether this regimen can be considered as the standard of care for patients with resectable rNPC following endoscopic surgery. NCT05092217.",
    "authors": [
      "Wanpeng Li",
      "Tian Wang",
      "Haoyuan Xu",
      "Quan Liu",
      "Huankang Zhang",
      "Yufei Yang",
      "Xicai Sun",
      "Huapeng Yu",
      "Yurong Gu",
      "Houyong Li",
      "Hao Ding",
      "Dehui Wang"
    ],
    "pub_date": "2025-May-24",
    "pmid": "40413023"
  },
  {
    "title": "Management of In-transit Disease: Regional Therapies, Intralesional Therapies, and Systemic Therapy.",
    "abstract": "In-transit (IT) melanoma represents a distinct, heterogeneous pattern of disease that arises as superficial tumors along the track between the primary site and the draining regional lymph node basin. Many therapies have been explored for treatment of this disease with the goal of maximizing delivery of the therapeutic agent to the tumor while minimizing systemic toxicities. These include regional chemotherapies, intralesional injections, checkpoint inhibitors, immunomodulators, and vaccines in various combinations or as monotherapy. Here, we review the general managemnt of patients with ITmelanoma, the range of currently available treatment options, and recommendations for specific therapies for individual patients.",
    "authors": [
      "Margaret H O'Connor",
      "Kristen E Rhodin",
      "Douglas S Tyler",
      "Georgia M Beasley"
    ],
    "pub_date": "2025-Jul-",
    "pmid": "40413006"
  },
  {
    "title": "Clinical, immune cell, and genetic features predicting survival and long-term response to first-line chemo-immunotherapy treatment for non-small cell lung cancer.",
    "abstract": "Chemo-immunotherapy has become a standard of care for the first-line treatment of non-small cell lung cancer (NSCLC), but currently still lacks reliable markers to predict therapeutic efficacy and long-term response (LTR). In this study, we retrospectively summarized the survival outcome of 319 patients with locally advanced or metastatic NSCLC who received anti-programmed cell death protein-1 (PD-1)/programmed cell death-ligand 1 (PD-L1) based therapy from January 1st, 2018 to February 28th, 2022 at the Cancer Hospital, Chinese Academy of Medical Sciences & Peking Union Medical College. Then a comprehensive analysis of the association of LTR or survival outcomes with various characteristics including clinical parameters, peripheral blood lymphocyte subsets and common gene mutations in 167 NSCLC patients who received first-line anti-PD-1 plus chemotherapy treatment was conducted. LTR was defined as progression-free survival (PFS) exceeding 24 months, while non-responders had a PFS of less than 6 months. With a median follow-up time of 32.1 months (95% confidence interval [CI] 29.2-38.0), the median overall survival (OS) was 29.9 months (95% CI 23.6-37.5) in locally advanced or metastatic NSCLC receiving anti-PD-1/PD-L1 based treatment. Among 167 patients who received the first-line chemo-immunotherapy, 25.1% (n = 42) achieved LTR. Independent baseline predictors of LTR included age < 65 years (odds ratio [OR] = 3.22, p = 0.024), overweight or obesity (body mass index [BMI] ≥ 24 kg/m This study provides some new insights into the features and predictors significantly associated with LTR and survival in NSCLC patient receiving first-line treatment of anti-PD-1 plus chemotherapy. Those whose age < 65 years, overweight or obesity, or has a baseline CAR score < 0.07 are more likely to achieve optimal benefit from the first-line treatment of chemo-immunotherapy.",
    "authors": [
      "Liling Huang",
      "Haohua Zhu",
      "Liyuan Dai",
      "Yu Feng",
      "Xinrui Chen",
      "Zucheng Xie",
      "Xingsheng Hu",
      "Yutao Liu",
      "Xuezhi Hao",
      "Lin Lin",
      "Hongyu Wang",
      "Shengyu Zhou",
      "Jiarui Yao",
      "Le Tang",
      "Xiaohong Han",
      "Yuankai Shi"
    ],
    "pub_date": "2025-May-24",
    "pmid": "40411563"
  },
  {
    "title": "NIH Chronic Graft-versus-Host Disease Consensus Conference 2025 Update.",
    "abstract": "In 2020, the third NIH Consensus Development Project on Criteria for Chronic Graft-versus-Host Disease (GVHD) Clinical Trials was held with the goals of identifying gaps in understanding, prevention and treatment of chronic graft-versus-host disease (GVHD) and making actionable recommendations that would advance the field. An interim meeting was held in October 2024 to review progress on the 2020 recommendations. Each group was charged with reviewing their previous recommendations, assessing whether the field is on track to eventually achieve the goals, and considering whether recommendations should be modified in light of new data or insufficient progress. This manuscript summarizes the Working Groups' reports and helps define the research agenda for future studies in chronic GVHD. Overall, modest progress has been made on most initiatives. Some studies in progress will address key recommendations and results are eagerly anticipated.",
    "authors": [
      "Stephanie J Lee",
      "Kirsten M Williams",
      "Stefanie Sarantopoulos",
      "Carrie L Kitko",
      "Corey Cutler",
      "Joseph Pidala",
      "Geoffrey R Hill",
      "Zachariah DeFilipp",
      "Hildegard T Greinix",
      "Daniel Wolff",
      "Sophie Paczesny",
      "Geoffrey D E Cuvelier",
      "Kirk R Schultz",
      "Steven Z Pavletic"
    ],
    "pub_date": "2025-May-21",
    "pmid": "40409691"
  },
  {
    "title": "Neoadjuvant immunotherapy in early-stage NSCLC: navigating biomarker dilemmas and special population challenges.",
    "abstract": "Neoadjuvant immunotherapy has shown impressive outcomes in treating non-small cell lung cancer (NSCLC) recently due to advancements in immune checkpoint inhibitors (ICIs) research. Neoadjuvant immunotherapy can lower the tumor load, raise the complete surgical (R0) resection rate, and improve clinical outcomes by alleviating the immune system repression caused by tumor cells. This review provides a comprehensive evaluation of neoadjuvant immunotherapy in NSCLC, focusing on: (1) its safety and efficacy profiles, (2) the most recent clinical trial evidence, and (3) critical unresolved challenges including predictive biomarker development, management of driver mutation-positive patients, chronic obstructive pulmonary disease (COPD) comorbidity considerations, and its application in stage III-IVA (oligometastatic) disease. Furthermore, we explore future research directions to optimize neoadjuvant immunotherapy approaches for resectable NSCLC, aiming to guide clinical practice and investigation.",
    "authors": [
      "Tong Chen",
      "Fang Liu"
    ],
    "pub_date": "2025-Jun-",
    "pmid": "40409027"
  },
  {
    "title": "A phase II study of neoadjuvant GVAX and cyclophosphamide combined with nivolumab and SBRT followed by surgery in borderline resectable pancreatic adenocarcinoma.",
    "abstract": "BR-PDAC is treated with perioperative chemotherapy and surgical resection +/- SBRT, but long-term survival is rare. GVAX is a GM-CSF- secreting vaccine that activates T-cell immunity against tumor-associated antigens. This multi- center phase II clinical trial evaluated the safety and immune effects of GVAX/Cy/nivolumab and SBRT on the PDAC TME. Patients received neoadjuvant mFOLFIRINOX or gemcitabine/nab-paclitaxel if intolerant to mFOLFIRINOX followed by combination immunotherapy and SBRT before surgical resection. The primary endpoint was CD8+ T-cell density in surgical specimens compared with in historical controls treated with neoadjuvant mFOLFIRINOX and SBRT. Pathologic response rate, overall survival, and exploratory immune evaluation of the TME is also reported. 31 patients were enrolled from January 2018 to July 2021. 18 patients received at least one dose of combined immunotherapy. Fourteen patients underwent definitive surgical resection and one complete pathologic complete response was observed. At a median follow-up of 19.5 months, median OS was 20.4 months (95% CI 18.2, NA). There was no difference in the mean CD8 T cell density between study patients as compared to historical control patients. Nonsignificant increases in the abundance score for specific immune cell subsets were observed in responders as compared to non-responders. The addition of combined immunotherapy and SBRT was safe and feasible in this patient population. No difference was observed in the mean CD8 T cell density between study patients and historical controls. These findings support the need for better characterization of how neoadjuvant immunotherapy may shift the phenotype of the PDAC TME.",
    "authors": [
      "Parul Agarwal",
      "Matthew Guo",
      "Kabeer Munjal",
      "Hanfei Qi",
      "Rose Parkinson",
      "Anna Ferguson",
      "Christina Mitchell",
      "Jeanne Harrison",
      "Robert A Anders",
      "Elizabeth D Thompson",
      "Hao Wang",
      "Ana De Jesus",
      "Lei Zheng",
      "Jin He",
      "Richard Burkhart",
      "Amol Narang",
      "Ben George",
      "Elizabeth M Jaffee",
      "Mark Yarchoan",
      "Daniel Laheru",
      "Arsen Osipov"
    ],
    "pub_date": "2025-May-23",
    "pmid": "40407726"
  },
  {
    "title": "Case Report: Bispecific CD20/CD30-targeted chimeric antigen receptor T-cell therapy for non-Hodgkin's lymphoma.",
    "abstract": "CD19-directed CAR T-cell therapy is a breakthrough immunotherapy for B-cell malignancies. However, CD19 loss-mediated relapsed/refractory disease continues to pose a significant challenge, highlighting the urgent need for CAR T cells targeting alternative antigens. To address this issue, we developed a CD20-directed CAR T incorporated with an additional CD30-directed binder to enhance cytotoxicity toward cancer cells. Here, we report that a patient with bulky transformed follicular lymphoma was successfully treated with CD20/CD30-directed CAR-T cells. The patient received two doses of anti-CD20/CD30-CAR-T therapy administered one month apart. Complete metabolic remission was achieved 1 month after the first infusion without evidence of cytokine release syndrome (CRS) or immune effector cell-associated neurotoxicity syndrome (ICANS). The second dose was given as a consolidation therapy with sustained disease-free survival exceeding 12 months to date. The report underscores the promising therapeutic potential and safety profile of CD20/CD30-directed CAR T-cell therapy. https://www.clinicaltrials.gov, identifier NCT06756321.",
    "authors": [
      "Yuejiao Huang",
      "Yiming Gong",
      "Xiang Liu",
      "Huaying Ruan",
      "Jinhua Lu",
      "Hosein Kouros-Mehr",
      "Hong Liu",
      "Han Wang"
    ],
    "pub_date": "2025--",
    "pmid": "40406106"
  },
  {
    "title": "Harnessing local and system immune profiling delineating differential responders to first-line sintilimab (anti-PD-1 antibody) combined with chemotherapy in extensive-stage small cell lung cancer: an exploratory biomarker analysis of a phase II study.",
    "abstract": "While chemo-immunotherapy has been established as the frontline therapeutic regimen for extensive-stage small cell lung cancer (ES-SCLC), durable responses persist predominantly in a minor population of patients. This underscores critical need to elucidate underlying local tumor microenvironment and systematic immune profiles for biomarker discovery. In this phase II trial (ChiCTR2000038354), the efficacy, safety, and immune-genomic signatures of sintilimab (anti-PD-1 antibody) synergized with chemotherapy as first-line regimen for ES-SCLC were evaluated. The regimen demonstrated a median progression-free survival (PFS) of 6.9 months and median overall survival of 17.1 months, accompanied by a 12-month PFS rate of 16.9%, fulfilling the primary endpoint. Manageable grade 3 or 4 treatment-related adverse events developed in 27.3% (12/44) of patients. The exploratory study indicated a higher infiltration of CD4",
    "authors": [
      "Mengqing Xie",
      "Minwei Bao",
      "Xiaorong Dong",
      "Lin Wu",
      "Li Liu",
      "Jing Zhao",
      "Xiangling Chu",
      "Yan Wu",
      "Xianxiu Ji",
      "Yujia Fang",
      "Xin Yu",
      "Shiji Zhang",
      "Qi Wang",
      "Tao Hu",
      "Jin Wang",
      "Changbin Zhu",
      "Chunxia Su"
    ],
    "pub_date": "2025-May-23",
    "pmid": "40404633"
  },
  {
    "title": "Decoding resistance to immune checkpoint inhibitors in non-small cell lung cancer: a comprehensive analysis of plasma proteomics and therapeutic implications.",
    "abstract": "Immune checkpoint inhibitors (ICIs) have shown substantial benefit for patients with advanced non-small cell lung cancer (NSCLC). However, resistance to ICIs remains a major clinical challenge. Here, we perform a comprehensive bioinformatic analysis of plasma proteomic profiles to explore the underlying biology of treatment resistance in NSCLC. The analysis was performed on 388 \"resistance-associated proteins\" (RAPs) that were previously described as pretreatment plasma proteomic predictors within the PROphet computational model designed to predict ICI clinical benefit in NSCLC. Putative tissue origins of the RAPs were explored using publicly available datasets. Enrichment analyses were performed to investigate RAP-related biological processes. Plasma proteomic data from 50 healthy subjects and 272 patients with NSCLC were compared, where patients were classified as displaying clinical benefit (CB; n=76) or no CB (NCB; n=196). Therapeutic agents targeting RAPs were identified in drug and clinical trial databases. The RAP set was significantly enriched with proteins associated with lung cancer, liver tissue, cell proliferation, extracellular matrix, invasion, and metastasis. Comparison of RAP expression in healthy subjects and patients with NSCLC revealed five distinct RAP subsets that provide mechanistic insights. The RAP subset displaying a pattern of high expression in the healthy population relative to the NSCLC population included multiple proteins associated with antitumor activities, while the subset displaying a pattern of highest expression in the NCB population included proteins associated with various hallmarks of treatment resistance. Analysis of patient-specific RAP profiles revealed inter-patient diversity of potential resistance mechanisms, suggesting that RAPs may aid in developing personalized therapeutic strategies. Furthermore, examination of drug and clinical trial databases revealed that 17.5% of the RAPs are drug targets, highlighting the RAP set as a valuable resource for drug development. The study provides insight into the underlying biology of ICI resistance in NSCLC and highlights the potential clinical value of RAP profiles for developing personalized therapies.",
    "authors": [
      "Michal Harel",
      "Nili Dahan",
      "Coren Lahav",
      "Eyal Jacob",
      "Yehonatan Elon",
      "Igor Puzanov",
      "Ronan J Kelly",
      "Yuval Shaked",
      "Raya Leibowitz",
      "David P Carbone",
      "David R Gandara",
      "Adam P Dicker"
    ],
    "pub_date": "2025-May-22",
    "pmid": "40404205"
  },
  {
    "title": "INBRX-106: a hexavalent OX40 agonist that drives superior antitumor responses via optimized receptor clustering.",
    "abstract": "Immunotherapies targeting immune checkpoint inhibitors have revolutionized cancer treatment but are limited by incomplete patient responses. Costimulatory agonists like OX40 (CD134), a tumor necrosis factor receptor family member critical for T-cell survival and differentiation, have shown preclinical promise but limited clinical success due to suboptimal receptor activation. Conventional bivalent OX40 agonists fail to induce the trimeric engagement required for optimal downstream signaling. To address this, we developed INBRX-106, a hexavalent OX40 agonist designed to enhance receptor clustering independently of Fc-mediated crosslinking and boost antitumor T-cell responses. We assessed INBRX-106's effects on receptor clustering, signal transduction, and T-cell activation using NF-kß reporter assays, confocal microscopy, flow cytometry, and single-cell RNA sequencing. Therapeutic efficacy was evaluated in murine tumor models and  INBRX-106 demonstrated superior receptor clustering and downstream signaling compared with bivalent agonists, leading to robust T-cell activation and proliferation. In murine models, hexavalent OX40 agonism resulted in significant tumor regression, enhanced survival, and increased CD8 Our data establish hexavalent INBRX-106 as a differentiated and more potent OX40 agonist, showcasing its ability to overcome the limitations of conventional bivalent therapies by inducing superior receptor clustering and multimeric engagement. This unique clustering mechanism amplifies OX40 signaling, driving robust T-cell activation, proliferation, and effector function in preclinical and clinical settings. These findings highlight the therapeutic potential of INBRX-106 and its capacity to redefine OX40-targeted immunotherapy, providing a compelling rationale for its further clinical development in combination with checkpoint inhibitors.",
    "authors": [
      "Nisha Holay",
      "Rashi Yadav",
      "Sae Jeong Ahn",
      "Melissa J Kasiewicz",
      "Anya Polovina",
      "Annah S Rolig",
      "Thi Staebler",
      "Bryan Becklund",
      "Noah D Simons",
      "Yoshinobu Koguchi",
      "Brendan P Eckelman",
      "Yaiza Diaz de Durana",
      "William L Redmond"
    ],
    "pub_date": "2025-May-21",
    "pmid": "40404202"
  },
  {
    "title": "A phase II basket trial of dual anti-CTLA-4 and anti-PD-1 blockade in rare tumors (DART) SWOG S1609: durable responses and delayed pseudoprogression in small cell carcinoma of the ovary, hypercalcemic type cohort.",
    "abstract": "The combined use of anti-programmed cell death protein 1 (PD-1)/anti-cytotoxic T-lymphocyte associated protein 4 (CTLA-4) checkpoint inhibitors has been effective in various cancer types. The Southwest Oncology Group (SWOG) Dual Anti-CTLA-4 and Anti-PD-1 Blockade in Rare Tumors (DART) S1609 study investigated ipilimumab and nivolumab in ultra-rare cancers, including small cell carcinoma of the ovary, hypercalcemic type (SCCOHT). The purpose of the study was to evaluate the potential clinical benefit of ipilimumab and nivolumab in patients with SCCOHT. DART was a prospective, open-labeled, multicenter (>1,000 US sites), multi-cohort phase II clinical trial of intravenous administration of ipilimumab (1 mg/kg, every 6 weeks) plus nivolumab (240 mg, every 2 weeks). The primary endpoint was overall response rate [ORR, confirmed complete response (CR) and partial response (PR)] per RECIST. Secondary endpoints included progression-free survival (PFS), overall survival (OS), clinical benefit rate (CBR; overall response plus stable disease ≥6 months), and toxicity. Immune responses were also evaluated. Six patients (median age, 30.5 years; median, 2 prior therapies; no prior immunotherapy exposure) with advanced/metastatic SCCOHT were evaluable. ORR and CBR were both 16.7% (1/6) with one patient having a confirmed CR lasting 46.2+ months. However, another patient had a confirmed immune CR (iCR) with immune PFS (iPFS) of 53+ months [ORR/iORR, 33.3% (2/6)]. Notably, the latter patient had a progressing lesion at 24 weeks after initial response, but with renewed regression with ongoing therapy, suggesting delayed pseudo-progression. At 12-months, 3 patients remained alive. Median PFS was 1.4 months (range, 0.9 months-not reached); median OS was 14.2 months (2 months-not reached). No adverse events caused treatment discontinuation. Two of 6 patients (33.3%) with SCCOHT achieved durable CR/iCR and long-term survival with ipilimumab plus nivolumab. Correlative studies to determine response and resistance markers are ongoing. NCT02834013.",
    "authors": [
      "Young Kwang Chae",
      "Megan Othus",
      "Sandip Pravin Patel",
      "Raid Aljumaily",
      "Khine Z Win",
      "Tanya Pejovic",
      "Sajeve S Thomas",
      "William R Robinson",
      "Hye Sung Kim",
      "Liam Il-Young Chung",
      "Christine M McLeod",
      "Helen X Chen",
      "Elad Sharon",
      "Howard Streicher",
      "Christopher W Ryan",
      "Charles D Blanke",
      "Razelle Kurzrock"
    ],
    "pub_date": "2025-May-22",
    "pmid": "40402690"
  },
  {
    "title": "Pancreatic resection with perioperative drug repurposing of propranolol and etodolac - the phase II randomized controlled PROSPER trial.",
    "abstract": "The perioperative period is characterized by psychological stress and inflammatory reactions that can contribute to disease recurrence or metastatic spread. These reactions are mediated particularly by catecholamines and prostaglandins. The PROSPER trial aimed to evaluate whether a perioperative drug repurposing with a non-selective betablocker (propranolol) and a COX-2 inhibitor (etodolac) is feasible and safe in the setting of pancreatic cancer surgery. Patients undergoing partial pancreatoduodenectomy for pancreatic cancer were randomized to perioperative treatment with propranolol and etodolac or placebo. Main safety endpoint was the rate of serious adverse events (SAE) and the main feasibility endpoint was adherence. Overall and disease-free survival (DFS) as well as recurrences were assessed as efficacy parameters and the trial was accompanied by a translational study. The trial was prematurely closed due to slow recruitment. 26 patients were randomized, but 6 never started trial medication. Finally, 9 patients received the trial medication and 11 patients placebo. There were 6 SAE in the treatment vs. 14 in the placebo group. Adherence was lower in the treatment group, but without statistically significance. Median DFS was 16.36 months (95%-CI 1.18 - not reached) in verum vs. 11.25 (95%-CI 2.2 - 17.25) in placebo group. The rate of distant recurrences was 11.1% in verum vs. 54.5% in placebo group. There were no safety concerns, but the trial intervention was not feasible given slow recruitment and limited adherence. However, the translational study and preliminary efficacy data revealed some promising findings, warranting further investigation. DRKS00014054.",
    "authors": [
      "Felix J Hüttner",
      "Rosa Klotz",
      "Nathalia A Giese",
      "Bo Kong",
      "Azaz Ahmed",
      "Daniela Merz",
      "Alexandra Pöchmann",
      "Ina Burghaus",
      "Thilo Hackert",
      "Oliver Strobel",
      "André L Mihaljevic",
      "Christoph W Michalski",
      "Markus W Büchler",
      "Markus K Diener"
    ],
    "pub_date": "2025-May-22",
    "pmid": "40402347"
  },
  {
    "title": "Harnessing Cellular Immunotherapy for EBV-Associated Malignancies: Current Advances and Future Directions.",
    "abstract": "Standard treatments for EBV-associated malignancies, such as chemotherapy and radiotherapy, demonstrate limited efficacy in relapsed or refractory cases, underscoring an urgent need for innovative therapeutic strategies. Recent advances in immunotherapy-particularly EBV-specific cytotoxic T lymphocytes and dendritic cell vaccines-have shown promise for both treatment and prevention. Engineered T cell therapies, including T-cell receptor (TCR) and chimeric antigen receptor (CAR) approaches targeting EBV antigens such as LMP1 and gp350, are progressing in clinical development. Compared to conventional intensive therapies, which often require prolonged administration and are associated with significant toxicity, cellular immunotherapy offers a favourable safety profile alongside robust in vivo T cell expansion and potent antitumor effects. Although preclinical and clinical trial results are encouraging, further refinement of therapeutic protocols is critical to enhance efficacy and improve access for diverse patient populations. In this review, we summarise the rationale for EBV-directed cellular therapies, outline their clinical applications to date, and discuss current limitations as well as emerging opportunities to optimise these strategies.",
    "authors": [
      "Yang Gao",
      "Di Wang",
      "Chunrui Li"
    ],
    "pub_date": "2025-May-",
    "pmid": "40401927"
  },
  {
    "title": "Expert consensus on cancer treatment-related lung injury.",
    "abstract": "Although advancements in cancer therapies have substantially improved the survival of cancer patients, these treatments may also result in acute or chronic lung injury. Cancer treatment-related lung injury (CTLI) presents with a diverse array of clinical manifestations and can involve multiple sites. Due to the lack of specific diagnostic protocols, CTLI can deteriorate rapidly and may be life-threatening if not promptly addressed. Unfortunately, there is no universally accepted consensus document on the diagnosis and management of CTLI. A multidisciplinary panel comprising experts from respiratory and critical care medicine, oncology, radiation oncology, thoracic surgery, radiology, pathology, infectious diseases, pharmacy, and rehabilitation medicine participated in this consensus development. Through a systematic literature review and detailed panel discussions, the team formulated nine key recommendations. This consensus document addresses the concept, epidemiology, pathogenesis, risk factors, diagnostic approach, evaluation workflow, management strategies, differential diagnosis, type-specific management and clinical staging of CTLI. Emphasis is placed on raising awareness among clinicians and therapeutic practices through comprehensive guidelines. The consensus provides a detailed diagnostic protocol for CTLI and introduces a structured management framework based on grading, typing, and staging. It highlights the critical role of multidisciplinary team (MDT) collaboration and emphasizes the need for individualized, whole-process patient care strategies to optimize clinical outcomes.",
    "authors": [
      "Xinqing Lin",
      "Hui Guo",
      "Wei Zhao",
      "Min Li",
      "Gen Lin",
      "Qian Chu",
      "Enguo Chen",
      "Liang'an Chen",
      "Rui Chen",
      "Tianqing Chu",
      "Haiyi Deng",
      "Yu Deng",
      "Hangming Dong",
      "Wen Dong",
      "Yuchao Dong",
      "Wenfeng Fang",
      "Xin Gan",
      "Liang Gong",
      "Yingying Gu",
      "Qian Han",
      "Yue Hao",
      "Yong He",
      "Chengping Hu",
      "Jie Hu",
      "Yi Hu",
      "Yongliang Jiang",
      "Yang Jin",
      "Fen Lan",
      "Weimin Li",
      "Weifeng Li",
      "Wenhua Liang",
      "Anwen Liu",
      "Dan Liu",
      "Ming Liu",
      "Mengjie Liu",
      "Zhuo Liu",
      "Zhefeng Liu",
      "Qun Luo",
      "Liyun Miao",
      "Chuanyong Mu",
      "Pinhua Pan",
      "Ping Peng",
      "Jianwen Qin",
      "Yinyin Qin",
      "Panxiao Shen",
      "Minhua Shi",
      "Yong Song",
      "Chunxia Su",
      "Jin Su",
      "Xin Su",
      "Xiaowu Tan",
      "Kejing Tang",
      "Xiaomei Tang",
      "Panwen Tian",
      "Binchao Wang",
      "Huijuan Wang",
      "Kai Wang",
      "Mengzhao Wang",
      "Qi Wang",
      "Wenxian Wang",
      "Zhijie Wang",
      "Di Wu",
      "Fei Xu",
      "Yan Xu",
      "Chunwei Xu",
      "Zhanhong Xie",
      "Xiaohong Xie",
      "Boyan Yang",
      "Meng Yang",
      "Feng Ye",
      "Xiaoqun Ye",
      "Zongyang Yu",
      "Jian Zhang",
      "Jianqing Zhang",
      "Xiaoju Zhang",
      "Fei Zhao",
      "Xiaobin Zheng",
      "Bo Zhu",
      "Zhengfei Zhu",
      "Jianya Zhou",
      "Jianying Zhou",
      "Min Zhou",
      "Qing Zhou",
      "Zihua Zou",
      "Biniam Kidane",
      "Elena Bignami",
      "Fumio Sakamaki",
      "Giandomenico Roviello",
      "Hirokazu Taniguchi",
      "Kyeongman Jeon",
      "Lenko Saric",
      "Miguel Ariza-Prota",
      "Ninh M La-Beck",
      "Nobuhiro Kanaji",
      "Satoshi Watanabe",
      "Takehito Shukuya",
      "Tomohiro Akaba",
      "Tracy L Leong",
      "Wolfgang Gesierich",
      "Yasuhiko Koga",
      "Yoshinori Tanino",
      "Yuji Uehara",
      "Shiyue Li",
      "Rongchang Chen",
      "Chengzhi Zhou"
    ],
    "pub_date": "2025-Apr-30",
    "pmid": "40400937"
  },
  {
    "title": "Multicenter phase Ib/II study of second-line durvalumab and tremelimumab in combination with paclitaxel in patients with biomarker-selected metastatic gastric cancer.",
    "abstract": "This multicenter phase Ib/II trial aimed to evaluate the safety and efficacy of combining durvalumab, tremelimumab, and paclitaxel as second-line treatment for biomarker-selected patients with metastatic gastric cancer. In phase Ib, the standard 3 + 3 dose escalation method was used. Durvalumab and tremelimumab were administered every 4 weeks for 13 and 4 cycles, respectively, combining paclitaxel 80 mg/m In phase Ib (n = 7), dose level-1 was selected as the recommended phase II dose. In phase II, 48 patients were enrolled: microsatellite instability-high or deficient mismatch repair protein tumors (n = 16); EBV-positive tumors (n = 15); high tumor mutation burden ( ≥ 5/Mb) (n = 11); CD274 amplification (n = 5); and POLD1 mutation (n = 1). The ORR was 52.1%, meeting the primary endpoint. The median progression-free survival and overall survival were 5.3 and 13.1 months, respectively. The most common any-grade and grade 3-4 adverse events were anemia (41.7%) and neutropenia (10.4%), respectively. Durvalumab-tremelimumab with paclitaxel was tolerable and efficacious in biomarker-selected gastric cancer patients as a second-line treatment, highlighting the importance of biomarker-based approaches for immunotherapy in gastric cancer. NCT03751761.",
    "authors": [
      "Keun Wook Lee",
      "Da Young Zang",
      "Hyung-Don Kim",
      "Jin-Won Kim",
      "Bum Jun Kim",
      "Yoon-Koo Kang",
      "Min-Hee Ryu",
      "Hark Kyun Kim"
    ],
    "pub_date": "2025-May-21",
    "pmid": "40399487"
  },
  {
    "title": "Single-arm phase II study of consolidation serplulimab following hypofractionated radiotherapy with concurrent chemotherapy for patients with limited stage small-cell lung cancer: ASTRUM-LC01 study protocol.",
    "abstract": "With the inspiring results of the PACIFIC trial in non-small-cell lung cancer (NSCLC), and the CAPIAN and IMpower133 trials in extensive-stage small-cell lung cancer (SCLC), immunotherapy has increasingly gained attention. Serplulimab, a PD-1 inhibitor, showed great antitumour activity in the ASTRUM-005 trial and has been recommended as first-line therapy in extensive-stage SCLC. Whether serplulimab following hypofractionation radiotherapy and chemotherapy could bring better outcomes in limited-stage SCLC remains to be answered. We designed a prospective multicentre single-arm phase II clinical trial to evaluate both the efficacy and safety of chemoradiotherapy and consolidation by serplulimab in limited-stage SCLC. Eligible patients will receive standard chemotherapy for four cycles and concurrent thoracic radiotherapy with a total dose of 45 Gy in 3 weeks and a 3 Gy dose per fraction. Prophylactic cranial irradiation is recommended for responding patients. Serplulimab will be delivered afterwards every 3 weeks for up to 1 year. Based on sample size estimation, 55 patients will be enrolled in total. Ethics approval was obtained from the Independent Ethics Committee of National Cancer Centre/Cancer Hospital, Chinese Academy of Medical Sciences and Peking Union Medical College (22/236-3438). NCT05443646.",
    "authors": [
      "Yuqi Wu",
      "Lei Deng",
      "Jianyang Wang",
      "Tao Zhang",
      "Jianzhong Cao",
      "Xiaohong Zhou",
      "Jianchun Duan",
      "Nan Bi"
    ],
    "pub_date": "2025-May-21",
    "pmid": "40398957"
  },
  {
    "title": "Embracing cancer immunotherapy with manganese particles.",
    "abstract": "A substance integral to the sustenance and functionality of virtually all forms of life is manganese (Mn), classified as an essential trace metal. Its significance lies in its pivotal role in facilitating metabolic processes crucial for survival. Additionally, Mn exerts influence over various biological functions including bone formation and maintenance, as well as regulation within systems governing immunity, nervous signaling, and digestion. Manganese nanoparticles (Mn-NP) stand out as a beacon of promise within the realm of immunotherapy, their focus honed on intricate mechanisms such as triggering immune pathways, igniting inflammasomes, inducing immunogenic cell death (ICD), and sculpting the nuances of the tumor microenvironment. These minuscule marvels have dazzled researchers with their potential in reshaping the landscape of cancer immunotherapy - serving as potent vaccine enhancers, efficient drug couriers, and formidable allies when paired with immune checkpoint inhibitors (ICIs) or cutting-edge photodynamic/photothermal therapies. Herein, we aim to provide a comprehensive review of recent advances in the application of Mn and Mn-NP in the immunotherapy of cancer. We hope that this review will display an insightful view of Mn-NPs and provide guidance for design and application of them in immune-based cancer therapies.",
    "authors": [
      "Ali Moosavi Zenooz",
      "Majid Eterafi",
      "Soheil Azarmi Giglou",
      "Elham Safarzadeh"
    ],
    "pub_date": "2025-May-21",
    "pmid": "40397376"
  },
  {
    "title": "Impact of clinical trial participation on the survival of patients with newly diagnosed advanced ovarian cancer.",
    "abstract": "Clinical trials provide access to novel treatments that may offer survival benefits to ovarian cancer patients. This study investigates whether clinical trial participation is associated with improved survival in newly diagnosed advanced ovarian cancer. We retrospectively investigated patients treated for advanced ovarian cancer at Yonsei Cancer Hospital between 2019 and 2021. During this period, the standard of care included cytoreductive surgery with platinum-based chemotherapy, with or without bevacizumab, followed by maintenance therapy with PARP inhibitors or bevacizumab. This study included 202 patients with stage III-IV, 82 participated in clinical trials [DUO-O (Bevacizumab+immunotherapy (IO)+/- PARP inhibitors), KEYLYNK-001 (PARP inhibitors +IO), ATHENA (PARP inhibitors), TRU-D (IO+IO)] and 120 received standard-of-care. The median follow-up duration was 39.8 months. Disease recurrence occurred in 123 (60.9%) patients and 45 (22.3%) patients died. Among the patients in both groups, there were no significant differences in age, histologic type, stage, median CA-125 level, comorbidities, and  Clinical trial participation was associated with improved survival compared with standard of care in patients with newly diagnosed advanced ovarian cancer.",
    "authors": [
      "Yong Jae Lee",
      "Jung-Yun Lee",
      "Eun Ji Nam",
      "Sang Wun Kim",
      "Sunghoon Kim",
      "Young Tae Kim"
    ],
    "pub_date": "2025--",
    "pmid": "40395326"
  },
  {
    "title": "Adjuvant nonavalent HPV vaccination in women treated for vulvar HSIL, a randomized placebo-controlled trial; VulVaccin study protocol.",
    "abstract": "Each year, 45,000 women worldwide develop vulvar cancer, often occurred from vulvar high-grade squamous intraepithelial lesions (vHSIL), a precancerous stage associated with high- risk human papillomavirus (HPV). Recurrent vHSIL, experienced by over 30% of patients despite treatment, conducting in significant physical and psychosocial challenges. With no established method to reduce recurrence, our study investigates the potential of adjuvant HPV vaccination during treatment. We aim to determine whether nonavalent HPV vaccination can effectively prevent vHSIL recurrence in women treated for vulvar HSIL. This is a randomized, double-blind, placebo-controlled study protocol involving 498 women diagnosed with vHSIL. Participants will be randomized to receive either the nonavalent HPV vaccine or a placebo in addition to standard treatment. The primary outcome is the recurrence of vHSIL within 24 months following treatment. Secondary endpoints are treatment effectiveness, immune response, cost-effectiveness, and quality of life. Long-term follow-up examines vaccine effect after 5 and 10 years, along with the occurrence of vulvar malignancies. Relative risk between vaccinated and placebo groups will be evaluated, employing intention-to-treat principles. This study is designed to investigate the potential benefits of HPV vaccination in managing vHSIL. Results from the trial will provide evidence on the vaccine's impact on recurrence rates, treatment outcomes, and long-term prevention of vulvar malignancies. ClinicalTrials.gov. Identifier: NCT06052696. Registered 12 January 2023, https://clinicaltrials.gov/study/NCT06052696 .",
    "authors": [
      "Vera J G M Vaessen",
      "Ralf L O van de Laar",
      "Marta Piso-Jozwiak",
      "Virgil A S H Dalm",
      "Elmar A Joura",
      "Matthias Jentschke",
      "Heleen J van Beekhuizen"
    ],
    "pub_date": "2025-May-20",
    "pmid": "40394508"
  },
  {
    "title": "The hormonal nexus in PIK3CA-mutated meningiomas: implications for targeted therapy and clinical trial design.",
    "abstract": "The presence of hormonal receptors in meningiomas has been known for decades. More recently, evidence has shown increased prevalence of meningiomas in patients taking certain types of hormonal treatments, such as oral contraceptives, progestins or hormone replacement therapy. Epidemiological evidence suggests that patients undergoing hormonal therapy harbor higher mutational rates of the oncogene PIK3CA. Due to the relative paucity of literature describing the intersection of hormone therapy and mutated PIK3CA pathways in meningioma, we have conducted a narrative review on this topic. Similarly, the clinical trial landscape for hormonal therapies for meningioma currently focuses on somatostatin receptor-targeted therapies and peptide receptor radionucleotide therapy, and the PIK3CA-hormonal signaling axis has not been explicitly targeted. Given the role of PIK3CA mutations in promoting cancer progression in other hormone-sensitive tumors, such as breast and prostate cancer, exploring this axis could inform drug repurposing including hormonal therapy specifically for these tumors.",
    "authors": [
      "Matthew Abikenari",
      "Amit Regev",
      "Vratko Himic",
      "John Choi",
      "Sanjeeva Jeyaretna",
      "Daniel M Fountain",
      "Michael Lim"
    ],
    "pub_date": "2025-May-20",
    "pmid": "40392516"
  },
  {
    "title": "Optimized GMP-grade production of non-viral Sleeping Beauty-generated CARCIK cells for enhanced fitness and clinical scalability.",
    "abstract": "Strict adherence to GMP guidelines and regulatory compliance is crucial when transitioning from research to clinical-grade production of ATMPs like CAR T cells. The success of CAR T cell therapy in treating hematological malignancies highlights the need for closed or automated systems to ensure quality and efficacy. Recent evidence also suggests that ex vivo culture conditions can significantly impact CAR T cell functionality. We present our optimized methodology for expanding Sleeping Beauty transposon-engineered Chimeric Antigen Receptor-Cytokine-Induced Killer (CARCIK) cells using G-Rex devices and evaluate its impact on CARCIK cell phenotype and T cell fitness. Building on our previously validated protocol, we introduced key simplifications to optimize the CARCIK differentiation process. Delaying the nucleofection step eliminated the need for feeder cells while maintaining efficient CAR expression and high cell viability. Transitioning from T-flasks to G-Rex bioreactors reduced operator hands-on time from 21 to 28 days to 14-17 days and resulted in a less differentiated CARCIK cell product. Metabolic and transcriptional analyses showed that the novel protocol improves CARCIK cell fitness and in vivo efficacy against B-cell lymphoma. The novel method was validated in Good Manufacturing Practices (GMP) conditions at our two Cell Factories and yielded enough numbers of CARCIK-CD19 cells for clinical use. Optimizing non-viral CARCIK cell production using G-Rex bioreactors and refined timing adjustments has streamlined the workflow, enhanced cell fitness, and resulted in a highly effective therapeutic product with demonstrated in vivo efficacy in mice. These improvements reduced manipulation and contamination risks, while optimizing logistics and space efficiency, facilitating allogeneic CARCIK generation for a current phase I/II clinical trial (NCT05869279) in patients with R/R CD19 + non-Hodgkin Lymphoma (B-cell NHL) and Chronic Lymphocytic Leukemia (CLL), confirming the approach's scalability and clinical potential.",
    "authors": [
      "Ilaria Pisani",
      "Giusi Melita",
      "Patricia Borges de Souza",
      "Stefania Galimberti",
      "Angela Maria Savino",
      "Jolanda Sarno",
      "Beatrice Landoni",
      "Stefano Crippa",
      "Elisa Gotti",
      "Carolina Cuofano",
      "Olga Pedrini",
      "Chiara Capelli",
      "Giada Matera",
      "Daniela Belotti",
      "Stefania Cesana",
      "Benedetta Cabiati",
      "Michele Quaroni",
      "Valentina Colombo",
      "Massimiliano Mazza",
      "Barbara Vergani",
      "Anna Gaimari",
      "Fabio Nicolini",
      "Marcella Tazzari",
      "Martine Bocchini",
      "Marta Serafini",
      "Alessandro Rambaldi",
      "Benedetta Rambaldi",
      "Giuseppe Dastoli",
      "Andrea Biondi",
      "Giuseppe Gaipa",
      "Martino Introna",
      "Josée Golay",
      "Sarah Tettamanti"
    ],
    "pub_date": "2025-May-19",
    "pmid": "40390044"
  },
  {
    "title": "Rationale and feasibility of a rapid integral biomarker program that informs immune-oncology clinical trials: the ADVISE trial.",
    "abstract": "ADVISE (ADaptiVe biomarker trial that InformS Evolution of therapy) (NCT03335540) was a biomarker-adapted feasibility clinical trial of immunohistochemistry (IHC) to inform combination immuno-oncology (I-O) treatment. To inform I-O combination selection, messenger RNA expression analyses from The Cancer Genome Atlas evaluated associations between programmed death 1/programmed death ligand 1 (PD-1/PD-L1) and other I-O-associated genes. Tumor tissue blocks of melanoma, non-small cell lung cancer, renal cell carcinoma, urothelial carcinoma, squamous cell carcinoma of the head and neck, and gastroesophageal junction/gastric cancer were stained by IHC to assess expression of CD8, colony-stimulating factor 1 receptor, glucocorticoid-induced tumor necrosis factor receptor (GITR), indoleamine 2,3-dioxygenase 1, lymphocyte-activation gene 3, NKp46, forkhead box P3, and PD-L1. These results facilitated an I-O treatment selection algorithm where patient biopsy results dictated allocation into combinations of nivolumab with cabiralizumab, urelumab, linrodostat mesylate, relatlimab, BMS-986156 (anti-GITR), lirilumab, ipilimumab, or irradiation. The primary endpoint was the proportion of patients with qualified baseline tumor biopsy specimens where decision-enabling biomarker analysis was completed within 12 business days to select an I-O combination therapy. Correlation of PD-1/L1 and I-O-associated genes varied across the spectrum of T-cell-inflamed versus non-inflamed tumors; however, tumors with low/intermediate  Actualization of a patient-specific I-O combination treatment selection strategy is feasible, however, determination of de novo integral biomarker thresholds of novel I-O targets to facilitate effective treatment of PD-1-refractory cancer remains fraught. These data emphasize the difficulty of integral biomarker development for I-O in translating from immunotherapy treatment-naïve biospecimens to the selection of patients in the PD-1-refractory state. NCT03335540.",
    "authors": [
      "Jason J Luke",
      "Katherine Bever",
      "F Stephen Hodi",
      "Janis Taube",
      "Ashish Massey",
      "David Yao",
      "Jaclyn Neely",
      "Rachel Tam",
      "George Lee",
      "Akshita Gupta",
      "Santanu Dutta",
      "Peter Szabo",
      "Riyue Bao",
      "Tim Reilly"
    ],
    "pub_date": "2025-May-19",
    "pmid": "40389374"
  },
  {
    "title": "Interplay between sarcopenia, GDF-15, and the efficacy of nivolumab plus ipilimumab in patients with mismatch repair deficient metastatic colorectal cancer: final survival analysis of the phase II GERCOR NIPICOL study.",
    "abstract": "Sarcopenia and growth differentiation factor 15 (GDF-15) are linked to poor cancer survival. In this exploratory analysis, we evaluated their interaction with nivolumab-ipilimumab efficacy in chemoresistant metastatic colorectal cancer (mCRC) harboring microsatellite instability and/or mismatch-repair deficiency (MSI/dMMR), based on the final survival analysis of the NIPICOL phase II trial. 57 patients with MSI/dMMR chemoresistant mCRC received nivolumab-ipilimumab for 3 months (3M), then, nivolumab alone for 9M. Skeletal muscle mass index (SMI) was evaluated by CT scan at baseline and 12M to assess sarcopenia. GDF-15 levels were assessed at baseline and 3M. Main endpoints were overall survival (OS) and immune Response Evaluation Criteria In Solid Tumors progression-free survival (iPFS). After excluding three patients not confirmed as MSI/dMMR by central review, the overall median follow-up was 60.4 months. The 3-year and 5 year iPFS rates were 72.0% and 65.3%, with OS rates of 77.5% and 73.3%, respectively. Among 49 patients with evaluable GDF-15, high-baseline GDF-15 was associated with poorer survival: 3-year iPFS rate of 56.3% for GDF-15≥2500 versus 81.7% for GDF-15<2500 (PFS HR=2.45, 95% CI 0.91 to 6.55), 3-year OS rates of 61.4% versus 84.5% (OS HR=2.08, 95% CI 0.70 to 6.22). Of the 48 evaluable patients for SMI, 31 (65.0%) displayed sarcopenia at baseline. 11 out of 20 (55%) patients with baseline sarcopenia and assessed for SMI at 12M, reversed sarcopenia by 12M. They had higher baseline GDF-15 levels and greater GDF-15 decrease by 3M (delta mean change: -69.8% vs -40.3%) compared with patients who remained sarcopenic. 1-year nivolumab-ipilimumab demonstrates consistent efficacy after 5-year follow-up in an MSI/dMMR chemoresistant mCRC population. GDF-15 confirms to be a promising biomarker for sarcopenia and survival. NCT03350126.",
    "authors": [
      "Leonard Depotte",
      "Paula Nay",
      "Christophe Borg",
      "Aurélia Meurisse",
      "Julie Henriques",
      "Jaafar Bennouna",
      "Christelle De La Fouchardière",
      "David Tougeron",
      "Thibault Mazard",
      "Benoist Chibaudel",
      "Christophe Tournigand",
      "Dewi Vernerey",
      "Frédéric Pigneur",
      "Thierry Andre",
      "Romain Cohen"
    ],
    "pub_date": "2025-May-19",
    "pmid": "40389373"
  },
  {
    "title": "Efficacy and safety of cadonilimab combined with chemotherapy as the first-line treatment for primary advanced or recurrent endometrial cancer: a prospective single-arm open-label phase II clinical trial.",
    "abstract": "Recently, immunotherapy has significantly transformed the treatment landscape of endometrial cancer (EC). Results from KEYNOTE-158, RUBY and AtTEnd showed programmed cell death 1 (PD-1) or programmed cell death-ligand 1 inhibitors with promising efficacy in primary advanced or recurrent EC. However, few studies focused on the role of dual immune checkpoints in primary advanced or recurrent EC. Cadonilimab is an immune checkpoint inhibitor targeting the PD-1 and T-lymphocyte antigen-4, which is expected to show substantial clinical efficacy in EC. Combining cadonilimab with standard chemotherapy may have synergistic effects, making this combination a promising first-line treatment for primary advanced or recurrent EC. Furthermore, incorporating molecular classification for guidance on the use of cadonilimab may hold valuable clinical benefits. In this multicentre, open-label, phase II study, patients with histologically confirmed EC were eligible. Forty-five patients will be recruited. Seventeen patients will be enrolled in stage I, and at least seven cases of complete response (CR) and partial response (PR) should be observed before entering stage II. All patients will receive cadonilimab at a dosage of 10 mg/kg along with carboplatin (area under the curve (AUC)=4-5) plus paclitaxel (175 mg/m The study protocol meets the approval of the ethical committee of Fujian Cancer Hospital (K2023-173-04) and all other participating hospitals. Study findings will be disseminated in peer-reviewed publications. NCT06066216.",
    "authors": [
      "Jie Lin",
      "Tongyu Liu",
      "Jian Chen",
      "Yingtao Lin",
      "Xiaoxiang Chen",
      "Yanhong Zhuo",
      "Yuzhi Li",
      "Yu Jiang",
      "Linlin Yang",
      "Chunhua Tu",
      "Bin Liu",
      "Jianping Zou",
      "Lijun Chen",
      "Yang Sun"
    ],
    "pub_date": "2025-May-19",
    "pmid": "40389320"
  },
  {
    "title": "COMIC: A Bayesian Dose Optimization Design for Drug Combination in Multiple Indications With Application to CAR-T Therapies.",
    "abstract": "Project Optimus, initiated by the US Food and Drug Administration (FDA), seeks to shift the focus of dose finding and selection from the maximum tolerated dose to the optimal dose that offers the most favorable risk-benefit balance. However, applying this paradigm shift to drug combination trials presents challenges, particularly due to limited sample sizes and a large two-dimensional dose exploration space. These challenges are amplified when trials involve multiple indications. To address this, we developed a two-stage Bayesian dose optimization design, called COMIC (Combination Optimization in Multiple IndiCations), to efficiently identify Optimal Biological Dose Combinations (OBDC) for multiple indications. The COMIC design follows a two-stage strategy: First, optimizing the dose for one indication based on a utility function that measures the risk-benefit tradeoff, and then using that data to inform and accelerate dose optimization for additional indications. This approach significantly reduces the required sample size. Additionally, we incorporate a pharmacodynamic endpoint (e.g., receptor occupancy) to prioritize which component of the combination should be escalated, further enhancing the efficiency of dose optimization. Simulation studies demonstrate the strong performance and robustness of the COMIC design across various scenarios. We illustrate the method using a CAR-T therapy trial.",
    "authors": [
      "Kai Chen",
      "Kentaro Takeda",
      "Ying Yuan"
    ],
    "pub_date": "2025-May-",
    "pmid": "40386962"
  },
  {
    "title": "Perioperative immunotherapy strategies for resectable non-small cell lung cancer.",
    "abstract": "This is a protocol for a Cochrane Review (intervention). The objectives are as follows: To compare, via a network meta-analysis, the effectiveness and safety of different immunotherapy agents that are administered in a perioperative setting to people with resectable non small-cell lung cancer To perform indirect comparisons in order to generate a clinically meaningful hierarchy of perioperative strategies of immunotherapy administration for overall survival in operable people with resectable non small-cell lung cancer.",
    "authors": [
      "Corynne Marchal",
      "Guillaume Eberst",
      "François Calais",
      "Virginie Westeel",
      "Reem Malouf"
    ],
    "pub_date": "2025-May-19",
    "pmid": "40386901"
  },
  {
    "title": "An update on the clinical trial research of immunotherapy for glioblastoma.",
    "abstract": "Glioblastoma multiforme (GBM) is a common primary malignant brain tumor in adults, characterized by a high rate of recurrence and mortality. The median overall survival is less than 2 years with the current standard therapy. As immunotherapy has begun to show promising results in solid tumors such as non-small cell lung cancer and melanoma in recent years, immnunotherapy for patients with glioblastoma is also in full swing, which is mainly consisted of immune checkpoint inhibitors, cancer vaccines, chimeric antigen receptor T-cell and oncolytic viral therapy. However, the application of immunotherapy in glioblastoma is severely hampered by cognitive impairment of intracerebral lymphatic system, the existence of blood-brain barrier, highly immunosuppressive tumor microenvironment and GBM's intrinsic features, including low tumor mutation burden and high heterogeneity. This review systematically evaluates recently published clinical trial outcomes of GBM immunotherapy, critically analyses both the progress and limitations of these trials, thoroughly examines current barriers to effective immunotherapy, and highlights promising preclinical studies that may guide future therapeutic development.",
    "authors": [
      "Yichen Zhou",
      "Fanxing Shi",
      "Junyu Zhu",
      "Yi Yuan"
    ],
    "pub_date": "2025--",
    "pmid": "40386781"
  },
  {
    "title": "Cost-effectiveness of atezolizumab versus chemotherapy in patients with non-small-cell lung cancer ineligible for platinum-based doublet chemotherapy.",
    "abstract": "Atezolizumab has recently demonstrated improved prognosis in patients with advanced or metastatic non-small-cell lung cancer (NSCLC) who are not eligible for treatment with a platinum-containing regimen, as observed in a randomized phase 3 clinical trial. This study aims to evaluate the cost-effectiveness of atezolizumab for the treatment of NSCLC from the perspective of payers in both developed and developing countries. A Markov model was developed to simulate treatment scenarios involving atezolizumab or chemotherapy for patients diagnosed with NSCLC. The model estimated the transition probabilities, health care costs, and health utilities base on the risk of disease progression, survival, and toxicity using data from IPSOS clinical trials, relevant literature, and publicly available databases. A price simulation was conducted to guide the pricing strategy at the specified willingness-to-pay (WTP) threshold, and sensitivity analyses were performed to assess the model's response to uncertainty. Among patients with NSCLC who are not suitable for treatment with a platinum-containing regimen, the use of atezolizumab led to an incremental gain of 0.35 quality adjusted life years (QALYs) compared to chemotherapy. The ICER for atezolizumab compared to chemotherapy was calculated at $220400.53 per QALY in the US and $101874.61 per QALY in China. The price simulation results indicated that atezolizumab was favored in the US when the price was less than $371.28/60 mg and $474.92/60 mg at the WTP thresholds of $100,000 and $150,000, respectively; it was cost-effective at a WTP threshold of $36023.71when the price was about 40% of the current price in China. Sensitivity analysis revealed that variables such as the price of atezolizumab and utilities influenced the r model's outcomes, although these factors did not significantly alter the overall conclusion. Atezolizumab was not considered cost-effective at the WTP thresholds of $150,000 per QALY in the US and $36,024 per QALY in China for patients with advanced NSCLC who are ineligible for platinum-based chemotherapy.",
    "authors": [
      "Qiuji Wu",
      "Yi Qin",
      "Qiu Li"
    ],
    "pub_date": "2025--",
    "pmid": "40385627"
  },
  {
    "title": "Cost-effectiveness of cetuximab-containing regimens for squamous cell carcinoma of the head and neck in Italy.",
    "abstract": "To investigate the differences in clinical outcomes and costs for the treatment of recurrent and/or metastatic squamous cell carcinoma of the head and neck (R/M SCCHN) with a combined positive score (CPS) of 1-19, with pembrolizumab ± chemotherapy or a cetuximab-containing regimen (CCR) in Italy. A naïve indirect treatment comparison was conducted, and outcomes were incorporated into a newly developed cost-utility model. Inputs were derived from clinical trials, technology appraisal reports, and published literature. Scenario analyses were undertaken to explore key areas of uncertainty. Across the comparisons of pembrolizumab ± chemotherapy versus CCRs, incremental life-years ranged from - 0.502 to 0.155, while incremental quality-adjusted life years (QALYs) ranged from - 0.379 to 0.085. In some scenarios, CCRs dominated pembrolizumab ± chemotherapy (i.e. more QALYs at lower costs). In others, CCRs yielded similar estimates of QALYs at lower costs. CCRs are likely to represent a comparable or more effective treatment option compared to pembrolizumab ± chemotherapy. Model results consistently demonstrated that CCRs are a cost-effective treatment strategy. CCRs remain a relevant treatment option for R/M SCCHN and a CPS of 1-19, for whom a targeted, patient-focused approach is warranted.",
    "authors": [
      "Philipp Ivanyi",
      "Ash Bullement",
      "Andrea Botticelli",
      "Francesco Perri",
      "Giorgio L Colombo",
      "Viviana Annibali",
      "Anita Gandola",
      "Jaesh Naik",
      "Michael Schlichting",
      "Chris P Pescott"
    ],
    "pub_date": "2025-May-18",
    "pmid": "40383966"
  },
  {
    "title": "BCMA/GPRC5D bispecific CAR T-cell therapy for relapsed/refractory multiple myeloma with extramedullary disease: a single-center, single-arm, phase 1 trial.",
    "abstract": "Relapsed/refractory multiple myeloma (RRMM) with extramedullary disease (EMD) represents a challenging condition, with limited treatment options and poor prognosis. We conducted a phase 1 clinical trial to evaluate the safety and effectiveness of a novel bispecific chimeric antigen receptor (CAR) T-cell therapy targeting two antigens, B-cell maturation antigen and G protein-coupled receptor class C group 5 member D (BCMA/GPRC5D), in this high-risk population. A total of 12 patients were enrolled, of whom 3 were excluded due to disease progression or death before CAR T-cell infusion, despite meeting the inclusion criteria, leaving 9 for analysis. The median follow-up was 6.08 months (Interquartile Range [IQR]: 0.9-16.5). All patients received BCMA/GPRC5D bispecific CAR T-cell therapy after bridging therapy with localized radiotherapy or Elranatamab. Efficacy assessments revealed that 100% of patients achieved partial response (PR) or better, with 44.4% achieving complete response (CR). Common adverse events included hematological toxicities such as anemia, leukopenia, and thrombocytopenia. Cytokine release syndrome (CRS) occurred in 66.7% of patients, all of which were grade 1-2, and no neurotoxicity (ICANS) was observed. The 1-year overall survival (OS) and progression-free survival (PFS) rates were 60% and 63%, respectively. Median OS and PFS were not reached. Collectively, these findings highlight a potential therapeutic strategy involving BCMA/GPRC5D dual-targeted CAR T-cell therapy for patients with aggressive forms of multiple myeloma, particularly those with extramedullary disease, and support the need for further exploration and validation in larger, multi-center clinical studies.",
    "authors": [
      "Hao Yao",
      "Shi-Hui Ren",
      "Lin-Hui Wang",
      "Ming-Qiang Ren",
      "Jiao Cai",
      "Dan Chen",
      "Ying He",
      "Si-Han Lai",
      "Bai-Tao Dou",
      "Meng-Jiao Li",
      "Yan-Ling Li",
      "Ya-Li Cen",
      "Alex H Chang",
      "Yi Su",
      "Ling Qiu",
      "Fang-Yi Fan"
    ],
    "pub_date": "2025-May-19",
    "pmid": "40383818"
  },
  {
    "title": "Oxidative complexity: The role of ROS in the tumor environment and therapeutic implications.",
    "abstract": "Reactive oxygen species (ROS) constitutes a group of reactive molecules that play a critical role in biological processes. Varying ROS levels have been frequently observed in cancer cells and the tumor microenvironment (TME). The role of ROS displays significant complexity in cancer development and therapy. Elevated ROS levels can induce metabolic reprogramming and promote the proliferation, invasion, and metastasis of cancer cells, resulting in cancer progression. However, excessive ROS accumulation leads to the occurrence of apoptosis, pyroptosis, necroptosis, and ferroptosis in cancer cells, which restrains tumor development. In the TME, ROS frequently promotes angiogenesis and remodels the extracellular matrix (ECM) by enhancing the differentiation of cancer-associated fibroblasts (CAFs), thereby supporting tumor growth. Concurrently, high ROS levels favour immunosuppressive cells, including M2-polarized macrophages, and regulatory T cells (Tregs), while impairing the antitumor capabilities of T cells. In the aspect of cancer therapy, it is overly simplistic to merely combine chemoradiotherapy with antioxidants as a therapeutic strategy. Instead, highlighting targeted therapies that modulate ROS is essential, given their inherent complexity. Fortunately, a variety of innovative treatments have emerged, including nanodrug delivery systems (NDDS), proteolysis-targeting chimeras (PROTAC), and adoptive cell therapy (ADT), which not only exhibit synergistic effects with immune checkpoint therapy (ICT), but also enhance the antitumor capabilities of the TME. In this paper, we elucidate the mechanism of ROS production, enumerate the role of ROS in cancer development and the TME, and discuss advancements in ROS-targeted cancer therapeutics.",
    "authors": [
      "Tingfeng Shen",
      "Yutong Wang",
      "Linmao Cheng",
      "Ann M Bode",
      "Ya Gao",
      "Shuntong Zhang",
      "Xue Chen",
      "Xiangjian Luo"
    ],
    "pub_date": "2025-May-15",
    "pmid": "40383035"
  },
  {
    "title": "Neoadjuvant with low-dose radiotherapy, tislelizumab, albumin-bound paclitaxel, and cisplatin for resectable locally advanced head and neck squamous cell carcinoma: phase II single-arm trial.",
    "abstract": "Although pathological complete response (pCR) and major pathological response (MPR) rates of neoadjuvant immunotherapy combined with chemotherapy in head and neck squamous cell carcinoma (HNSCC) trials remain suboptimal, emerging evidence highlights the synergistic potential of combining low-dose radiotherapy with immunotherapy to promote the efficacy of immunotherapy. This phase II, open-label, single-arm, multicenter trial (NCT05343325) enrolled 28 patients with untreated stage III-IVB HNSCC (NeoRTPC02). Patients received neoadjuvant low-dose radiotherapy, the programmed death-1 (PD-1) inhibitor tislelizumab, albumin-bound paclitaxel, and cisplatin for two cycles, followed by radical resection ~4 weeks after treatment completion. The primary endpoint, pCR rate, was achieved in 14 of 23 patients (60.9%; 23/28, 82.1% of the total cohort underwent surgery). Secondary endpoints included MPR rate (21.7%, 5/23), R0 resection rate (100%), and objective response rate (64.3%; 18/28). Treatment-related adverse events were manageable, with grade 3 or 4 treatment-related adverse events occurring in 10 (35.7%) patients. No surgical delays were observed. Single-cell RNA sequencing revealed remodeling of the HNSCC tumor microenvironment, which may correlate with improved clinical outcomes. This trial met the pre-specified primary endpoint, demonstrating a high pCR rate with promising efficacy and manageable toxicity in locally advanced HNSCC.",
    "authors": [
      "Zhigang Liu",
      "Dong Wang",
      "Guanjun Li",
      "Muhua Yi",
      "Zhaoyuan Zhang",
      "Guihua Zhong",
      "Liangfu Xu",
      "Rong Jiang",
      "Yannan Zheng",
      "Linxuan Huang",
      "Yingpeng Peng",
      "Lizhong Liang",
      "Jianpeng Li",
      "Ye Liu",
      "Jun Lai",
      "Xianjuan Lv",
      "Yongqiang Xu",
      "Qiaodan Liu",
      "Zhiqiang Wang",
      "Zhutian Liu",
      "Qinan Yang",
      "Li Nie",
      "Jiao Lei",
      "Xiaotao Huang",
      "Zhijie Liu",
      "Wen Jiang"
    ],
    "pub_date": "2025-May-17",
    "pmid": "40382318"
  },
  {
    "title": "Durvalumab plus chemotherapy in advanced biliary tract cancer: 3-year overall survival update from the phase III TOPAZ-1 study.",
    "abstract": "At the TOPAZ-1 (NCT03875235) primary analysis, durvalumab plus gemcitabine and cisplatin (GemCis) significantly improved overall survival (OS) in advanced biliary tract cancer (aBTC). We report updated exploratory analyses of OS and safety, characterisation of extended long-term survivors (eLTS), and subsequent anticancer therapy (SAT) use. Participants with aBTC received durvalumab+GemCis or placebo+GemCis every 3 weeks (≤8 cycles), then durvalumab or placebo monotherapy every 4 weeks until progressive disease or other discontinuation criteria were met. OS and serious adverse events (SAEs) were assessed in the full analysis and safety analysis sets (FAS/SAS), respectively. eLTS outcomes were assessed (FAS participants alive ≥30 months after randomisation). 685 participants were randomised: durvalumab+GemCis (n = 341); placebo+GemCis (n = 344). After a median 41.3 (95% confidence interval [CI] 39.3-44.1) months' follow-up in all participants, median OS (95% CI) for durvalumab+GemCis versus placebo+GemCis was 12.9 (11.6-14.1) versus 11.3 (10.1-12.5) months (hazard ratio, 0.74 [95% CI 0.63-0.87]); 36-month OS rate was 14.6% versus 6.9%, respectively. In participants who achieved disease control (566/685; 82.6%), the 36-month OS rate was higher for durvalumab+GemCis (17.0%) versus placebo+GemCis (7.6%). Overall, 12.8% were eLTS, with more eLTS in the durvalumab+GemCis (17.0%) versus placebo+GemCis (8.7%) arms; eLTS included all clinically relevant subgroups. Durvalumab+GemCis improved OS regardless of SAT use. In eLTS, SAEs were comparable between arms and less frequent than in the full SAS. Survival benefit and manageable safety continued with durvalumab+GemCis versus placebo+GemCis approximately 3 years after the last participant was randomised. All clinically relevant subgroups were represented in eLTS, supporting standard-of-care status for durvalumab+GemCis in aBTC. The TOPAZ-1 study found that treatment with durvalumab plus gemcitabine and cisplatin (chemotherapy, also known as GemCis), helped people with advanced biliary tract cancer (BTC) to live longer on average than those treated with a placebo plus GemCis. The latest results from TOPAZ-1 showed that these benefits continued for over 3 years in participants treated with durvalumab plus GemCis and side effects continued to be manageable. At an updated analysis, carried out 3 years after the last participant started the study, twice as many participants treated with durvalumab plus GemCis were alive compared to those treated with placebo plus GemCis. Results also showed that the positive effect of durvalumab plus GemCis compared with placebo plus GemCis was not affected by the use of other therapies some participants received after they finished the study treatment. These results continue to support durvalumab plus GemCis as a standard first-line treatment for people with advanced BTC. ClinicalTrials.gov Identifier: NCT03875235; https://clinicaltrials.gov/study/NCT03875235.",
    "authors": [
      "Do-Youn Oh",
      "Aiwu Ruth He",
      "Shukui Qin",
      "Li-Tzong Chen",
      "Takuji Okusaka",
      "Jin Won Kim",
      "Thatthan Suksombooncharoen",
      "Myung Ah Lee",
      "Masayuki Kitano",
      "Howard A Burris",
      "Mohamed Bouattour",
      "Suebpong Tanasanvimon",
      "Renata Zaucha",
      "Antonio Avallone",
      "Juan Cundom",
      "Aleksandra Kuzko",
      "Julie Wang",
      "Ioannis Xynos",
      "Arndt Vogel",
      "Juan W Valle"
    ],
    "pub_date": "2025-May-15",
    "pmid": "40381735"
  },
  {
    "title": "Key predictors of long-term outcomes in BCMA-targeted CAR-T therapy for relapsed/refractory multiple myeloma.",
    "abstract": "B-cell maturation antigen (BCMA)-directed chimeric antigen receptor T-cell (CAR-T) therapy exhibits high response rates in patients with relapsed/refractory multiple myeloma (r/r MM). However, the specific factors that influence the response duration remain poorly understood. This single-centre, retrospective observational study included 56 patients with r/r MM who received BCMA CAR-T therapy (equecabtagene autoleucel) at Tongji Hospital, China. We analysed response rates and long-term clinical outcomes and identified key factors contributing to the long-term efficacy of BCMA CAR-T therapy. At a median follow-up of 39.6 months, the overall response rate (ORR) was 96.4%. Among the patients, 96.4% (54 of 56) achieved minimal residual disease (MRD) negativity, whereas 80.4% (45 of 56) achieved complete response (CR) or stringent complete response (sCR). Poorer outcomes were observed in patients with triple exposure, high cytogenetic risk, or failure to achieve CR. Better outcomes were associated with a CAR-T cell persistence of at least six months and sustained MRD negativity. Prolonged MRD negativity was strongly correlated with longer progression-free survival (PFS), with median PFS durations of 58 months, 64 months, and not reached (NR) for patients who maintained MRD negativity for 12, 24, and 36 months, respectively. Patients who remained MRD-negative and progression-free exhibited higher CAR-T cell expansion peaks. Additionally, CAR-T cell persistence was positively correlated with the duration of MRD negativity duration, PFS, and overall survival (OS). BCMA CAR-T therapy provides durable responses in a subset of patients with r/r MM. Early intervention may improve patient prognosis by promoting sustained MRD negativity, thus improving overall treatment outcomes. Trial registration Chinese Clinical Trial Registry, ChiCTR2000033946 ( https://www.chictr.org.cn/showproj.html?proj=53503 ), Registered June 18, 2020. Trial registration Chinese Clinical Trial Registry, ChiCTR1800018137 ( https://www.chictr.org.cn/showproj.html?proj=30653 ), Registered August 31, 2018.",
    "authors": [
      "Ning An",
      "Juan Li",
      "Pan Luo",
      "Di Wang",
      "Peiling Zhang",
      "Chang Shu",
      "Songbai Cai",
      "Qiuxia Yu",
      "Xinyu Wen",
      "Xinran Wang",
      "Wei Mu",
      "Jianlin Hu",
      "Chunrui Li"
    ],
    "pub_date": "2025-May-16",
    "pmid": "40380297"
  },
  {
    "title": "The current status and prospects of gut microbiota combined with PD-1/PD-L1 inhibitors in the treatment of colorectal cancer: a review.",
    "abstract": "Colorectal cancer (CRC) is a common malignant tumor. Immune checkpoint inhibitors (ICIs), particularly those targeting programmed cell death protein 1(PD-1) and programmed cell death ligand 1(PD-L1), have shown promising potential in the treatment of CRC. Specific gut microbiota can modulate the efficacy of ICIs through immune or metabolic pathways. This review summarizes recent advances in the combined application of gut microbiota and PD-1/PD-L1 inhibitors in the treatment of CRC, aiming to provide insights for expanding clinical treatment options for CRC. We employed a systematic search strategy to screen relevant literature from databases such as PubMed, EMBASE, Medline, Cochrane Library, and Clinical Trial registries, with the search period covering from the inception of each database to October 2024. This study includes animal models and human trial subjects. Data extraction and literature screening were strictly carried out by two independent researchers. A total of 8 animal studies and 5 clinical trials were included to evaluate the effects of gut microbiota combined with PD-1/PD-L1 inhibitors in CRC. Tumor types included Microsatellite Stability(MSS), Microsatellite Instability-Low(MSI-L), and MSI-H CRC. Main outcomes were tumor volume, weight, and incidence; one study reported survival. Study durations ranged from 20 days to 26 weeks. Two studies used human fecal microbiota transplantation(FMT), and six applied experimental microbial interventions. The 5 clinical trials used ORR as the primary endpoint.Some also reported DCR, PFS, and OS. Two studies targeted Microsatellite Instability-High(MSI-H)/Deficient Mismatch Repair(dMMR), two MSS/Proficient Mismatch Repair(pMMR), and one lacked molecular subtype specification. All trials used full microbiota transplantation; one has released preliminary data. The treatment regimen combining gut microbiota with PD-1/PD-L1 inhibitors has shown promising therapeutic prospects in both animal studies and clinical research, although most clinical trials are data remain limited. Future studies should focus on: (1) gene-edited probiotic strains with targeted modifications; (2) the synergistic effects of multiple probiotics; and (3) conducting high-quality, multicenter clinical trials.",
    "authors": [
      "Min Deng",
      "Xiaoyu Li",
      "Huiming Wu",
      "Dingwen Xue",
      "Yize Wang",
      "Renkai Guo",
      "Yipeng Cui",
      "Chenfei Jin",
      "Fei Luo",
      "Huiyu Li"
    ],
    "pub_date": "2025-May-16",
    "pmid": "40380157"
  },
  {
    "title": "Response and Survival With Immune Checkpoint Inhibitor in Patients With Advanced Urothelial Carcinoma and Histology Subtypes.",
    "abstract": "Immune Checkpoint Inhibitors (ICIs) are used for advanced urothelial carcinoma (aUC) in different settings. Most patients have pure UC (PUC) but about one-third have UC mixed with histology subtypes (HS). We examined outcomes in patients with HS aUC treated with ICI. We included patients from 26 centers with PUC and any HS treated with ICI as 1st line (1L) upfront, maintenance avelumab (mAV), and ≥2nd line [2+L] therapy. We calculated overall and progression-free survival (OS, PFS) and observed response rate (ORR) from ICI start. We included 1511 patients; 752 1L, 609 2+L, 150 mAV. 1L: median OS was 15 (95% CI, 12-17) months for patients with PUC (n = 518), 15 (95% CI, 8-23) months for squamous UC (n = 85) (HR = 1.2, [95% CI, 0.8-1.6]), 11 (95% CI, 6-17) months for micropapillary UC (n = 46) (HR = 1.2, [95% 0.8-1.8]), and 21 (95% CI, 12-30) months in patients with UC mixed with ≥2 HS (n = 30), (HR = 0.9, [95% CI, 0.5-1.4]). 2+L: median OS was 9 (95% CI, 8-10) months for patients with PUC (n = 441), 9 (95% CI, 1-12) months for squamous UC (n = 60) (HR = 1.1, (95% CI, 0.8-1.6]), 6 (95% CI, 1-11) months for micropapillary UC (n = 37) (HR = 1.1, [95% 0.7-1.6]), and 7 (95% CI, 4-10) months in patients with UC mixed with ≥2 HS (n = 17), (HR = 1.6, [95% CI, 0.9-3.1]). We found no significant OS difference between PUC and HS in patients with aUC treated with ICI monotherapy. Limitations include retrospective design, small sample size in several subsets, lack of randomization, no central imaging or pathology review, selection and confounding biases. Results are hypothesis-generating and need prospective validation.",
    "authors": [
      "Dimitra Rafailia Bakaloudi",
      "Rafee Talukder",
      "Thomas Enright",
      "Jacob B Leary",
      "Dimitrios Makrakis",
      "Leonidas N Diamantopoulos",
      "Charbel Hobeika",
      "Vinay Mathew Thomas",
      "Umang Swami",
      "Roubini Zakopoulou",
      "Aristotelis Bamias",
      "Jason R Brown",
      "David J Pinato",
      "Charles Latchford",
      "Tanya Jindal",
      "Vadim S Koshkin",
      "Jure Murgić",
      "Marija Miletić",
      "Ana Frobe",
      "Jeffrey Johnson",
      "Yousef Zakharia",
      "Ajjai Alva",
      "Charles B Nguyen",
      "Gavin Hui",
      "Alexandra Drakaki",
      "Alejo Rodriguez-Vida",
      "Macarena Rey-Cárdenas",
      "Daniel Castellano",
      "Lucia Alonso Buznego",
      "Ignacio Duran",
      "Rafael Morales Barrera",
      "David Marmolejo",
      "Rana R McKay",
      "Tyler F Stewart",
      "Pedro Barata",
      "Ilana B Epstein",
      "Joaquim Bellmunt",
      "Evan Y Yu",
      "Ruben Raychaudhuri",
      "Rosa Nadal",
      "Funda Vakar-Lopez",
      "Shilpa Gupta",
      "Jonathan L Wright",
      "Ali Raza Khaki",
      "Petros Grivas"
    ],
    "pub_date": "2025-Apr-14",
    "pmid": "40378559"
  },
  {
    "title": "Perioperative nivolumab and chemotherapy in locally advanced squamous cell carcinoma of the oesophagus: a randomized multicentre phase 2 study with circulating tumor DNA dynamics monitoring.",
    "abstract": "Although neoadjuvant chemotherapy and immunotherapy show promise in treating oesophageal squamous cell carcinoma (OSCC), long-term survival data are limited. This randomized, multicenter phase 2 study evaluated the efficacy of perioperative Nivolumab with chemotherapy, followed by surgery and adjuvant immunotherapy, in patients with locally advanced resectable OSCC, and explored the prognostic role of circulating tumor DNA (ctDNA) status. In this trial, participants recruited from five centers were randomly assigned in a 2:1 ratio to receive either perioperative Nivolumab or a placebo in addition to chemotherapy (cisplatin and paclitaxel), followed by minimally invasive esophagectomy. For those who did not achieve a pathological complete response (pCR), adjuvant treatment with Nivolumab was administered. The main measure of success was the pCR rate, with secondary endpoints including the R0 resection rate, event-free survival, and overall survival. All outcomes and safety measures were assessed based on the intention-to-treat population. ctDNA levels were monitored as exploratory endpoints. Ninety patients were enrolled and randomized to Nivolumab or placebo plus chemotherapy. The pCR rate was slightly higher in the Nivolumab group (15%) compared to the control group (13.3%) (relative risk, 1.13; 95% CI, 0.38 to 3.36). No significant differences were observed in R0 resection rates (96.4% vs. 96.6%; P > 0.05). The median follow-up duration was 24.9 months (interquartile range: 22.8 to 26.7 months). Two-year event-free survival rates were 63.11% in the Nivolumab group versus 60.47% in the chemo group (hazard ratio, 0.97; 95% CI, 0.49 to 1.92). Two-year overall survival rates were 83.32% and 79.4%, respectively (hazard ratio, 0.82; 95% CI, 0.29 to 2.31). All participants were ctDNA positive at baseline, but post-treatment, 89% of the Nivolumab group and 62.5% of the placebo group turned ctDNA negative (P = 0.01). Those negative for ctDNA at all testing points showed significantly better disease-free survival (P < 0.001). Perioperative Nivolumab plus chemotherapy is a viable and safe option for systemically treating locally advanced resectable OSCC. Monitoring minimal residual disease through ctDNA could be potentially valuable for assessing the effectiveness of adjuvant therapy and for prognostic evaluation in a systemic manner. ClinicalTrials.gov registration NCT05213312.",
    "authors": [
      "Heng Jiao",
      "Siyun Lin",
      "Jianmin Gu",
      "Dongxian Jiang",
      "Peng Cui",
      "Zhiliang Huang",
      "Yong Fang",
      "Hao Wang",
      "Miao Lin",
      "Han Tang",
      "Tian Jiang",
      "Guangyi Lin",
      "Shaoyuan Zhang",
      "Hao Yin",
      "Fei Liang",
      "Jingshu Wang",
      "Xuning Fan",
      "Fujun Qiu",
      "Yang Yang",
      "Zhigang Li",
      "Bin Li",
      "Jiaqing Xiang",
      "Xuefeng Leng",
      "Yongtao Han",
      "Chengcheng Li",
      "Luoyan Ai",
      "Yingyong Hou",
      "Guoqiang Wang",
      "Zhihong Zhang",
      "Shangli Cai",
      "Tianshu Liu",
      "Jun Yin",
      "Lijie Tan"
    ],
    "pub_date": "2025-May-15",
    "pmid": "40375301"
  },
  {
    "title": "Autologous HIV-specific T cell therapy targeting conserved epitopes is well-tolerated in six adults with HIV: an open-label, single-arm phase 1 study.",
    "abstract": "Novel cellular therapies may enable HIV control or cure. HIV-specific T cells targeting conserved immunogenic protein regions of HIV Gag/Pol and the entirety of HIV Nef, termed HST-NEETs, eliminate HIV infected cells in vitro. Here we enroll seven participants in an open-label, single-arm phase 1 study (NCT03485963) to evaluate the safety (primary endpoint) of two autologous administrations of HST-NEET products without prescribed lymphodepletion. Adults with well-controlled HIV on anti-retroviral therapy are eligible. Six participants completed safety monitoring. No serious product-related toxicities are observed. Secondary endpoints are to assess expansion and persistence of HIV-reactive T cell clones, and changes to the HIV reservoir for each infused participant. HIV-specific T cell and HIV anti-Env antibody responses increase in two participants after infusion two. A trend towards decreasing levels of intact proviruses is observed in 2 participants. Three participants show persistence of HIV-reactive, product-associated T cell clones for ≥40 weeks post infusions. HST-NEETs infusions are well-tolerated. Future trials are needed to evaluate the efficacy of HST-NEETs in this population.",
    "authors": [
      "Danielle K Sohai",
      "Michael D Keller",
      "Patrick J Hanley",
      "Fahmida Hoq",
      "Divyesh Kukadiya",
      "Anushree Datar",
      "Emily Reynolds",
      "Dennis C Copertino",
      "Christopher Lazarski",
      "Chase D McCann",
      "Jay Tanna",
      "Abeer Shibli",
      "Haili Lang",
      "Anqing Zhang",
      "Pamela A Chansky",
      "Cecilia Motta",
      "Tan T Huynh",
      "Bridget Dwyer",
      "Andrew Wilson",
      "Rebecca Lynch",
      "Talia M Mota",
      "Winiffer D Conce Alberto",
      "Zabrina L Brumme",
      "Natalie N Kinloch",
      "Conrad Russell Y Cruz",
      "Lynsay MacLaren Ehui",
      "Sarah Henn",
      "R Brad Jones",
      "Catherine M Bollard"
    ],
    "pub_date": "2025-May-15",
    "pmid": "40374689"
  }
]